
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// #юум {
	// #ЧТЗ 03.01 Управление закупками
	// Галфинд Садомцев 2026/09/18        	
	юум_ДоработатьФормуНаСервере();
	// } #юум
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
&НаСервере
Процедура юум_ДоработатьФормуНаСервере()

	// Создаем новые реквизиты
	ДобавляемыеРеквизиты = Новый Массив; // Определяем массив добавляемых реквизитов
	
	НовыйРеквизит = Новый РеквизитФормы("юум_ВключатьМатериалыПоТребованию", Новый ОписаниеТипов("Булево"), , "Включать материалы по требованию");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	
	НовыйРеквизит = Новый РеквизитФормы("юум_Применение", Новый ОписаниеТипов("Строка"), "Объект.ЗаказыКОбеспечению", "Применение");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты); // Применяем реквизиты
	
	ЭтотОбъект.юум_ВключатьМатериалыПоТребованию = Истина;
	
	// Создаем новые поля
	НовыйЭлемент = Элементы.Добавить("юум_ВключатьМатериалыПоТребованию", Тип("ПолеФормы"), Элементы.ШагОтборПотребностей);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "юум_ВключатьМатериалыПоТребованию";
	
	Элементы.Переместить(НовыйЭлемент, Элементы.ШагОтборПотребностей, Элементы.РасчетОбособленныхПотребностейСУчетомОстатковНаВсехСкладах);
	
	НоваяКолонка = Элементы.Добавить("юум_Применение", Тип("ПолеФормы"), Элементы.ЗаказыКОбеспечению);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
	НоваяКолонка.ПутьКДанным = "Объект.ЗаказыКОбеспечению.юум_Применение";
	НоваяКолонка.Заголовок = "Применение";
	
КонецПроцедуры // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
&НаКлиенте
&После("ПолучениеТаблицыЗаказовКОбеспечениюВФонеЗавершение")
Процедура юум_ПолучениеТаблицыЗаказовКОбеспечениюВФонеЗавершение(Результат, ДополнительныеПараметры)
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем колонку "Применение"
	Элементы.юум_Применение.Видимость = ЭтотОбъект.юум_ВключатьМатериалыПоТребованию;
	Если ЭтотОбъект.юум_ВключатьМатериалыПоТребованию Тогда
		юум_ЗаполнитьПрименение();
	КонецЕсли;
КонецПроцедуры // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
&НаКлиенте
Процедура юум_ЗаполнитьПрименение()
	
	Для Каждого Стр Из Объект.ЗаказыКОбеспечению Цикл
		Парам = Новый Структура;
		Парам.Вставить("Заказ", Стр.Заказ);
		Парам.Вставить("Номенклатура", Стр.Номенклатура);
		Парам.Вставить("Характеристика", Стр.Характеристика);
		Стр.юум_Применение = юум_ЭтоНоменклатураПоТребованиюНаСервере(Парам);
	КонецЦикла;
	
КонецПроцедуры // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
//
// Параметры:
//  Парам - Структура
//
// Возвращаемое значение:
//	Строка - "По-умолчанию" или "По-требованию"
//
&НаСервереБезКонтекста
Функция юум_ЭтоНоменклатураПоТребованиюНаСервере(Парам)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Парам.Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Парам.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Парам.Характеристика);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	юум_НоменклатураПоТребованию.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	юум_НоменклатураПоТребованию.Спецификация КАК Спецификация,
	               |	юум_НоменклатураПоТребованию.Номенклатура КАК Номенклатура,
	               |	юум_НоменклатураПоТребованию.Характеристика КАК Характеристика,
	               |	юум_НоменклатураПоТребованию.Склад КАК Склад,
	               |	юум_НоменклатураПоТребованию.Подразделение КАК Подразделение,
	               |	юум_НоменклатураПоТребованию.Назначение КАК Назначение,
	               |	юум_НоменклатураПоТребованию.СпособОбеспечения КАК СпособОбеспечения,
	               |	юум_НоменклатураПоТребованию.Вероятность КАК Вероятность,
	               |	юум_НоменклатураПоТребованию.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.юум_НоменклатураПоТребованию КАК юум_НоменклатураПоТребованию
	               |ГДЕ
	               |	юум_НоменклатураПоТребованию.ЗаказНаПроизводство = &ЗаказНаПроизводство
	               |	И юум_НоменклатураПоТребованию.Номенклатура = &Номенклатура
	               |	И юум_НоменклатураПоТребованию.Характеристика = &Характеристика";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "По-умолчанию";
	Иначе
		Возврат "По-требованию";
	КонецЕсли;
	
КонецФункции // } #юум

&НаСервере
&ИзменениеИКонтроль("ПолучениеТаблицыЗаказовКОбеспечениюВФоне")
Функция юум_ПолучениеТаблицыЗаказовКОбеспечениюВФоне()

	Отбор = Новый Структура("Отметка", Истина);
	ТаблицаЗапасы = Объект.Запасы.Выгрузить(Отбор, "Номенклатура,Характеристика,Склад,КЗаказу,Отметка,ИДИндекса");
	ТаблицаСпособыОбеспечения = Объект.СпособыОбеспечения.Выгрузить(Отбор);

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТипОтбора", "ОтборыКомпоновки");
	ПараметрыПроцедуры.Вставить("Отбор", КомпоновщикНастроекДляОтборов.ПользовательскиеНастройки);
	ПараметрыПроцедуры.Вставить("ТаблицаСпособовОбеспечения", ТаблицаСпособыОбеспечения);
	ПараметрыПроцедуры.Вставить("ТаблицаЗапасы", ТаблицаЗапасы);
	ПараметрыПроцедуры.Вставить("ФормироватьЗаявкиНаЗакупку", ФормироватьЗаявкиНаЗакупку);
	ПараметрыПроцедуры.Вставить("РасчетОбособленныхПотребностейСУчетомОстатковНаВсехСкладах",
	РасчетОбособленныхПотребностейСУчетомОстатковНаВсехСкладах);
	#Вставка
	// #юум {
	// #ЧТЗ 03.01 Управление закупками
	// Галфинд Садомцев 2026/09/18        	
	// Добавляем в ПараметрыПроцедуры флажок "Включать материалы по требованию"
	ПараметрыПроцедуры.Вставить("юум_ВключатьМатериалыПоТребованию", ЭтотОбъект.юум_ВключатьМатериалыПоТребованию);
	// } #юум
	#КонецВставки

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Если КлючНазначенияИспользования = ОбеспечениеКлиентСервер.КлючНазначенияИспользованияФормированияЗаявокПоПотребностям() Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заявок: получение таблицы заказов к обеспечению';
		|en = 'Generate requests: receive the table of orders to supply'");
	Иначе
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заказов: получение таблицы заказов к обеспечению';
		|en = 'Generate orders: receive the table of orders to supply'");
	КонецЕсли;


	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ОбеспечениеПотребностей.ТаблицаПотребностейПоЗаказамИОстатков",
	ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПолучениеТаблицыСпособовОбеспеченияВФоне")
Функция юум_ПолучениеТаблицыСпособовОбеспеченияВФоне()

	Если СохранитьНастройки Тогда
		СохранитьНастройки();
	КонецЕсли;

	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("Настройки", КомпоновщикНастроекДляОтборов.ПолучитьНастройки());
	ПараметрыПроцедуры.Вставить("ТоварыПоддерживаемогоЗапаса", ЕстьШагЗапасы);
	ПараметрыПроцедуры.Вставить("СпособОбеспечения", Неопределено);
	ПараметрыПроцедуры.Вставить("КлючНазначенияИспользования", КлючНазначенияИспользования);
	#Вставка
	// #юум {
	// #ЧТЗ 03.01 Управление закупками
	// Галфинд Садомцев 2026/09/18        	
	// Добавляем в ПараметрыПроцедуры флажок "Включать материалы по требованию"
	ПараметрыПроцедуры.Вставить("юум_ВключатьМатериалыПоТребованию", ЭтотОбъект.юум_ВключатьМатериалыПоТребованию);
	// } #юум
	#КонецВставки

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Если КлючНазначенияИспользования = ОбеспечениеКлиентСервер.КлючНазначенияИспользованияФормированияЗаявокПоПотребностям() Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заявок: получение таблицы способов обеспечения';
		|en = 'Generate requests: receive the procurement strategy table'");
	Иначе
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заказов: получение таблицы способов обеспечения';
		|en = 'Generate orders: receive the procurement strategy table'");
	КонецЕсли;

	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ОбеспечениеПотребностей.ТаблицаСпособовОбеспечения",
	ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

#КонецОбласти