
&НаСервере
Процедура ПроверитьНаСервере()
	
	тз = РегистрыСведений.юум_СоответствиеКодовНоменклатурыЦГ_Статье.Выгрузить();

	тз0 = тз.Скопировать(, "Шаблон");
	тз0.Колонки.Добавить("Колво");
	тз0.ЗаполнитьЗначения(1, "Колво");
	тз0.Свернуть("Шаблон", "Колво");
	
	Для каждого стз Из тз0 Цикл
		Если стз.Колво > 1 Тогда
			Сообщить("Дублируется шаблон [" + стз.Шаблон + "]");
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КодНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	цг = РегистрыСведений.юум_СоответствиеКодовНоменклатурыЦГ_Статье.ЦеноваяГруппа(тз, КодНоменклатуры);
	ск = РегистрыСведений.юум_СоответствиеКодовНоменклатурыЦГ_Статье.СтатьяКалькуляции(тз, КодНоменклатуры);
	
	Сообщить(СтрШаблон("Ценовая группа: %1 
	|Статья калькуляции: %2", цг, ск));
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры
