#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
 
&Перед("ПриКомпоновкеРезультата")
Процедура юум_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// #юум {
	// #01/2
	// Добавление ликвидационной стоимости
	// Галфинд OShtak 2026/09/29
	ИзменитьЗапросОтчета();
	// } #юум
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 
&Перед("ПриСозданииНаСервере")
// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма - ФормаКлиентскогоПриложения - Форма отчета:
//   	* Параметры - Структура - может содержать свойства:
//				** ПараметрКоманды - СправочникСсылка.ОбъектыЭксплуатации -
//				** ОписаниеКоманды - Структура - может содержать свойства:
//					*** ДополнительныеПараметры - Структура - 
//   Отказ - Булево - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура юум_ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	// #юум {
	// #01/2
	// Добавление ликвидационной стоимости
	// Галфинд OShtak 2026/09/29
	ИзменитьЗапросОтчета();
	// } #юум
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ИзменитьЗапросОтчета()
	СхемаКомпоновки = ЭтотОбъект.СхемаКомпоновкиДанных; 
	НаборДанных = СхемаКомпоновки.НаборыДанных.НаборДанных;
	ТекстЗапроса = НаборДанных.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ЛитералВТ = "ПараметрыАмортизацииОС";
	ВыражениеОтбораПоПериоду = Новый ВыражениеСхемыЗапроса("{(&КонецПериода)}");
	
	ЗапросПараметрыАмортизацииОС = СхемаЗапроса.ПакетЗапросов.Добавить();
	
	ЗапросПараметрыАмортизацииОС.ТаблицаДляПомещения = ЛитералВТ;
	
	ОператорВыбрать = ЗапросПараметрыАмортизацииОС.Операторы[0];
	
	ИсточникПараметрыАмортизацииОС = ОператорВыбрать.Источники.Добавить("РегистрСведений.ПараметрыАмортизацииОСБУ.СрезПоследних", "ПараметрыАмортизацииОСБУСрезПоследних");
	ИсточникПараметрыАмортизацииОС.Источник.Параметры[0].Выражение = ВыражениеОтбораПоПериоду;
	
	СоответствиеТекстПсевдоним = Новый Соответствие();
	СоответствиеТекстПсевдоним.Вставить("ПараметрыАмортизацииОСБУСрезПоследних.ОсновноеСредство", "ОсновноеСредство");
	СоответствиеТекстПсевдоним.Вставить("ПараметрыАмортизацииОСБУСрезПоследних.Организация", "Организация");
	СоответствиеТекстПсевдоним.Вставить("ПараметрыАмортизацииОСБУСрезПоследних.ЛиквидационнаяСтоимость", "ЛиквидационнаяСтоимость");
	
	СоздатьПоляЗапроса(ЗапросПараметрыАмортизацииОС, ОператорВыбрать, СоответствиеТекстПсевдоним);
	
	ОператорВыбрать.ВыбиратьРазличные = Истина;
	
	СмещениеПакета = - 1;
	СхемаЗапроса.ПакетЗапросов.Сдвинуть(ЗапросПараметрыАмортизацииОС, СмещениеПакета);
	
 	ИндексПоследнегоПакета = СхемаЗапроса.ПакетЗапросов.Количество() - 1;
	ПоследнийПакет = СхемаЗапроса.ПакетЗапросов[ИндексПоследнегоПакета];
	
	ПолеПоиска = "СтоимостьОС.ОстаткиИОбороты";
	ЛитералЛиквидационнаяСтоимость = "ЛиквидационнаяСтоимость";
	ПсевдонимПоля = ЛитералЛиквидационнаяСтоимость;
	
	Для каждого ОператорВыбрать Из ПоследнийПакет.Операторы Цикл  
		ВыбираемыеПоля = ОператорВыбрать.ВыбираемыеПоля;
		ЕстьПолеПоиска = Ложь;
		Для каждого ВыбираемоеПоле Из ВыбираемыеПоля Цикл 
			Если НЕ Найти(ВыбираемоеПоле, ПолеПоиска) = 0  Тогда 
				ЕстьПолеПоиска = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьПолеПоиска Тогда
			ДобавитьДанныеОЛиквидационнойСтоимостиВОператор(ПоследнийПакет, ОператорВыбрать, ПсевдонимПоля);
		Иначе	
			ДобавитьПустоеПолеЛиквидационнойСтоимостиВОператор(ПоследнийПакет, ОператорВыбрать, ПсевдонимПоля);
		КонецЕсли;
		ПсевдонимПоля = "";
	КонецЦикла;
	
	НаборДанных.Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();  
	
	НовоеПоле = СхемаКомпоновки.ПоляИтога.Добавить();
	НовоеПоле.Выражение = "Максимум(ЛиквидационнаяСтоимость)"; 
	НовоеПоле.ПутьКДанным = ЛитералЛиквидационнаяСтоимость;
	НовоеПоле.Группировки.Добавить("ОсновноеСредство");  
	
	ПоляНабора = НаборДанных.Поля;   
	
	НовоеПоле = ПоляНабора.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПоле.Поле = ЛитералЛиквидационнаяСтоимость;
	НовоеПоле.ПутьКДанным = ЛитералЛиквидационнаяСтоимость; 
	НовоеПоле.Заголовок = "Ликвидационная стоимость"; 
	
	ПолеОбразец = ПоляНабора.Найти("СтоимостьКонечныйОстаток");
	Если ПолеОбразец = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для каждого ЭлементОформления Из ПолеОбразец.Оформление.Элементы Цикл
	    Если НЕ ЭлементОформления.Использование Тогда
		     Продолжить;
		КонецЕсли;
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(НовоеПоле.Оформление, 
			Строка(ЭлементОформления.Параметр), ЭлементОформления.Значение, Истина); 
	
	КонецЦикла;
КонецПроцедуры 

Процедура ДобавитьДанныеОЛиквидационнойСтоимостиВОператор(ПоследнийПакет, ОператорВыбрать, ПсевдонимПоля)
	ЛитералВТ = "ПараметрыАмортизацииОС";
	ОператорВыбрать.Источники.Добавить(ЛитералВТ, ЛитералВТ);
		
	МассивУсловий = Новый Массив;
	МассивУсловий.Добавить("СтоимостьОС.Организация = ПараметрыАмортизацииОС.Организация");
	МассивУсловий.Добавить("СтоимостьОС.ОсновноеСредство = ПараметрыАмортизацииОС.ОсновноеСредство");
	ТекстУсловияСвязи = СтрСоединить(МассивУсловий, " И "); 
	
	юум_СхемыЗапросов.ДобавитьУсловиеСоединения(
			ОператорВыбрать,
			"СтоимостьОС",
			ЛитералВТ,
			ТекстУсловияСвязи);  
	ТекстПоля = "ЕСТЬNULL(ПараметрыАмортизацииОС.ЛиквидационнаяСтоимость, 0)";

	юум_СхемыЗапросов.ДобавитьПолеВЗапрос(ПоследнийПакет, ОператорВыбрать, ПсевдонимПоля, "0");
	ВыбираемыеПоля = ОператорВыбрать.ВыбираемыеПоля;
	Индекс = ПоследнийПакет.Колонки.Количество() - 1;
	ОператорВыбрать.ВыбираемыеПоля.Установить(Индекс, Новый ВыражениеСхемыЗапроса(ТекстПоля));

КонецПроцедуры

Процедура ДобавитьПустоеПолеЛиквидационнойСтоимостиВОператор(ПоследнийПакет, ОператорВыбрать, ПсевдонимПоля)
	юум_СхемыЗапросов.ДобавитьПолеВЗапрос(ПоследнийПакет, ОператорВыбрать, ПсевдонимПоля, "0");
КонецПроцедуры  

Процедура СоздатьПоляЗапроса(ЗапросВыбора, ОператорВыбрать, СоответствиеТекстПсевдоним)
		
	Если СоответствиеТекстПсевдоним <> Неопределено Тогда
		Для Каждого элСоответствия Из СоответствиеТекстПсевдоним Цикл
			юум_СхемыЗапросов.ДобавитьПолеВЗапрос(ЗапросВыбора, ОператорВыбрать, элСоответствия.Значение, элСоответствия.Ключ);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
