#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
Функция юум_ВременнаяТаблицаСпособовОбеспеченияПоТребованию(ТоварыПоддерживаемогоЗапаса, КлючНазначенияИспользования)
	// код типовой функции ВременнаяТаблицаСпособовОбеспечения() с изменениями для номенклатуры "по требованию"
	
	ТекстЗапроса =
		ВременнаяТаблицаОтборПоЗаказам()
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь)
		// Отбор номенклатуры сегмента.
		+ "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураСегмента.Номенклатура    КАК Номенклатура,
		|	НоменклатураСегмента.Характеристика  КАК Характеристика
		|ПОМЕСТИТЬ ОтборПоСегментам
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		{ГДЕ
		|			НоменклатураСегмента.Номенклатура.*    КАК Номенклатура,
		|			НоменклатураСегмента.Характеристика.*  КАК Характеристика,
		|			НоменклатураСегмента.Сегмент.*         КАК СегментНоменклатуры}
		|ГДЕ
		|	&ИспользуетсяОтборПоСегментуНоменклатуры
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика
		|;
		|
		|//////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Номенклатура             КАК Номенклатура,
		|	Т.Характеристика           КАК Характеристика,
		|	Т.Склад                    КАК Склад,
		|	Т.Подразделение            КАК Подразделение,
		|	Т.Назначение               КАК Назначение,
		|	Т.СпособОбеспечения        КАК СпособОбеспечения,
		|	СУММА(Т.Количество)        КАК Количество
		|
		|ПОМЕСТИТЬ ВтПотребности
		|ИЗ (
		|	ВЫБРАТЬ
		|		Т.Номенклатура             КАК Номенклатура,
		|		Т.Характеристика           КАК Характеристика,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		|			КОНЕЦ                  КАК Склад,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ                  КАК Подразделение,
		|		Т.Назначение               КАК Назначение,
		|		СпрСпособ.Ссылка           КАК СпособОбеспечения,
		|		Т.Количество               КАК Количество
		|	ИЗ
		|		РегистрСведений.РаспределениеЗапасов КАК Т
		|	
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|	ГДЕ
		|		Т.ХарактеристикаПотребности В(
		|			ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.РезервироватьПоМереПоступления),
		|			ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.ОтложитьРезервирование),
		|			ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.КОбеспечению))
		|
		// отборы компоновщика
		|	{ГДЕ
		|		Т.Номенклатура.*                                       КАК Номенклатура,
		|		Т.Характеристика.*                                     КАК Характеристика,
		|		Т.Назначение.*                                         КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Т.Склад
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Т.ЗаказНаОтгрузку В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ   КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Т.Номенклатура, Т.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
// ++ НЕ УТКА
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Т.Номенклатура             КАК Номенклатура,
		|		Т.Характеристика           КАК Характеристика,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		|			КОНЕЦ                  КАК Склад,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ                  КАК Подразделение,
		|		Т.Назначение               КАК Назначение,
		|		СпрСпособ.Ссылка           КАК СпособОбеспечения,
		|
		|		СУММА(Т.КОбеспечению - Т.Заменено - Т.РаспределеноИзЗапасовОбособленно - Т.РаспределеноИзПартийОбособленно) КАК Количество
		|	ИЗ
		|		РегистрСведений.СтруктураЗаказа КАК Т
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|	ГДЕ
		|		Т.ВидСтроки НЕ В (
		|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
		|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
		|
		|	{ГДЕ
		|		Т.Номенклатура.*                                       КАК Номенклатура,
		|		Т.Характеристика.*                                     КАК Характеристика,
		|		Т.Назначение.*                                         КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Т.Склад
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Т.ЗаказНаПроизводство В (
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Т.Номенклатура, Т.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|	СГРУППИРОВАТЬ ПО
		|		Т.Номенклатура,
		|		Т.Характеристика,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		|			КОНЕЦ,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ,
		|		Т.Назначение,
		|		СпрСпособ.Ссылка
		|
		|	ИМЕЮЩИЕ
		|		СУММА(Т.КОбеспечению - Т.Заменено - Т.РаспределеноИзЗапасовОбособленно - Т.РаспределеноИзПартийОбособленно) > 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Т.Номенклатура             КАК Номенклатура,
		|		Т.Характеристика           КАК Характеристика,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		|			КОНЕЦ                  КАК Склад,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ                  КАК Подразделение,
		|		Т.НазначениеСтруктуры      КАК Назначение,
		|		СпрСпособ.Ссылка           КАК СпособОбеспечения,
		|	
		|		СУММА(Т.РаспределеноИзЗапасовОбособленно + Т.РаспределеноИзПартийОбособленно) КАК Количество
		|	ИЗ
		|		РегистрСведений.СтруктураЗаказа КАК Т
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|	ГДЕ
		|		Т.ВидСтроки НЕ В (
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
		|
		|	{ГДЕ
		|		Т.Номенклатура.*                                       КАК Номенклатура,
		|		Т.Характеристика.*                                     КАК Характеристика,
		|		Т.НазначениеСтруктуры.*                                КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Т.Склад
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Т.ЗаказНаПроизводство В (
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Т.Номенклатура, Т.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|	СГРУППИРОВАТЬ ПО
		|		Т.Номенклатура,
		|		Т.Характеристика,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		|			КОНЕЦ,
		|		ВЫБОР КОГДА Т.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Т.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ,
		|		Т.НазначениеСтруктуры,
		|		СпрСпособ.Ссылка
		|
		|	ИМЕЮЩИЕ
		|		СУММА(Т.РаспределеноИзЗапасовОбособленно + Т.РаспределеноИзПартийОбособленно) > 0
		// ++ номенклатура "по требованию"
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Т.Номенклатура             КАК Номенклатура,
		|		Т.Характеристика           КАК Характеристика,
		|		Т.Склад					   КАК Склад,
		|		Т.Подразделение            КАК Подразделение,
		|		Т.Назначение      КАК Назначение,
		|		СпрСпособ.Ссылка           КАК СпособОбеспечения,
		|	
		|		СУММА(ВЫБОР
		|				КОГДА Т.Вероятность = 0
		|					ТОГДА Т.Количество
		|				ИНАЧЕ Т.Количество * Т.Вероятность / 100
		|		КОНЕЦ) КАК Количество
		|	ИЗ
		|		РегистрСведений.юум_НоменклатураПоТребованию КАК Т
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|	{ГДЕ
		|		Т.Номенклатура.*                                       КАК Номенклатура,
		|		Т.Характеристика.*                                     КАК Характеристика,
		|		Т.Назначение.*                                КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Т.Подразделение ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Т.Подразделение
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Т.ЗаказНаПроизводство В (
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Т.Номенклатура, Т.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|	СГРУППИРОВАТЬ ПО
		|		Т.Номенклатура,
		|		Т.Характеристика,
		|		Т.Склад,
		|		Т.Подразделение,
		|		Т.Назначение,
		|		СпрСпособ.Ссылка
		|
		|	ИМЕЮЩИЕ
		|		СУММА(Количество) > 0
		// -- номенклатура "по требованию"
// -- НЕ УТКА
		|) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.Склад,
		|	Т.Подразделение,
		|	Т.Назначение,
		|	Т.СпособОбеспечения
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.Количество) > 0
		|
		|;
		|
		|////////////////////////////////////////////
		|" 
		
		+ ?(Не ТоварыПоддерживаемогоЗапаса, "", РегистрыСведений.ТоварныеОграничения.ВременнаяТаблицаТоварыПоддерживаемогоЗапаса());
		
		Тексты = Новый Массив();
		Тексты.Добавить(ТекстЗапроса);
		Тексты.Добавить("УНИЧТОЖИТЬ ВтФорматыСкладов");
		Тексты.Добавить(ОбщегоНазначения.РазделительПакетаЗапросов());
		ТекстЗапроса = ВременнаяТаблицаПеремещенияВнутриСети("ВтПотребности", Истина);
		Тексты.Добавить(ТекстЗапроса);
		Тексты.Добавить(ОбщегоНазначения.РазделительПакетаЗапросов());
		
		ТекстЗапроса = СтрСоединить(Тексты);
		
		ТекстЗапроса = ТекстЗапроса +
		// Способы обеспечения для товаров из заказов на отгрузку с вариантом обеспечения "К обеспечению" и "Резервировать по мере поступления".
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Т.Номенклатура      КАК Номенклатура,
		|	Т.Характеристика    КАК Характеристика,
		|	Т.Склад             КАК Склад,
		|	Т.СпособОбеспечения КАК СпособОбеспечения,
		|	Т.Количество        КАК Количество
		|ПОМЕСТИТЬ ВтУдаленныеСкладыСпособыОбеспечения
		|ИЗ
		|	ВтПотребности КАК Т
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТопологияСкладов КАК Топология
		|		ПО Топология.Номенклатура   =  Т.Номенклатура
		|		 И Топология.Характеристика =  Т.Характеристика
		|		 И Топология.Склад          =  Т.Склад
		|		 И Топология.Центр          =  Т.Склад
		|ГДЕ
		|	Топология.Номенклатура ЕСТЬ NULL
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Потребности.Номенклатура КАК Номенклатура,
		|	Потребности.Характеристика КАК Характеристика,
		|	ВЫРАЗИТЬ(Топология.Центр КАК Справочник.Склады) КАК Склад
		|ПОМЕСТИТЬ ВтРаспредЦентрыСпособыОбеспечения
		|ИЗ
		|	ВтПотребности КАК Потребности
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТопологияСкладов КАК Топология
		|		ПО Топология.Номенклатура   =  Потребности.Номенклатура
		|		 И Топология.Характеристика =  Потребности.Характеристика
		|		 И Топология.Склад          =  Потребности.Склад
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПеремещенияВнутриСети КАК ЗаказыВнутриСети
		|		ПО ЗаказыВнутриСети.Номенклатура = Потребности.Номенклатура
		|		 И ЗаказыВнутриСети.Характеристика = Потребности.Характеристика
		|		 И ЗаказыВнутриСети.Назначение = Потребности.Назначение
		|		 И ЗаказыВнутриСети.Склад = Топология.Центр
		|		 И ЗаказыВнутриСети.Заказ = НЕОПРЕДЕЛЕНО
		|ГДЕ
		|	НЕ Топология.Номенклатура ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	Потребности.Номенклатура,
		|	Потребности.Характеристика,
		|	Потребности.Назначение,
		|	Топология.Центр
		|ИМЕЮЩИЕ
		|	СУММА(Потребности.Количество)
		|			- МАКСИМУМ(
		|				ЕСТЬNULL(
		|					ЗаказыВнутриСети.РезервироватьПоМереПоступления
		|						+ ЗаказыВнутриСети.ОтложитьРезервирование
		|						+ ЗаказыВнутриСети.КОбеспечению, 0)) > 0
		|;
		|
		|//////////////////////////////////////////////////
		|";
		
	ИспользоватьАссортимент = ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент");
	ТекстСпособыОбеспечения = "";
	Если Не ИспользоватьАссортимент Тогда
		
		ТекстСпособыОбеспечения =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Т.СпособОбеспечения КАК СпособОбеспечения
			|ПОМЕСТИТЬ СпособыОбеспечения
			|ИЗ
			|	&НаборТекстовЗапросов КАК Т
			|ГДЕ
			|	&УсловиеДоступаПоТипуОбеспечения
			|ИНДЕКСИРОВАТЬ ПО
			|	СпособОбеспечения
			|;
			|
			|//////////////////////////////
			|";
			
	Иначе
		Тексты = Новый Массив();
		Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Т.Номенклатура КАК Номенклатура,
			|	Т.Склад КАК Склад,
			|	Т.СпособОбеспечения КАК СпособОбеспечения
			|ПОМЕСТИТЬ ВтТовары
			|ИЗ
			|	&НаборТекстовЗапросов КАК Т
			|ГДЕ
			|	&УсловиеДоступаПоТипуОбеспечения
			|ИНДЕКСИРОВАТЬ ПО
			|	СпособОбеспечения
			|;
			|
			|///////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Т.СпособОбеспечения КАК Ссылка
			|ПОМЕСТИТЬ СпособыОбеспеченияВременный
			|ИЗ
			|	ВтТовары КАК Т
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка";
		Тексты.Добавить(Текст);
		
		Текст = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
		Тексты.Добавить(Текст);
		
		Текст =
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Ссылка,
			|	РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки КАК ДатаПоставки
			|ПОМЕСТИТЬ БлижайшийЦиклПоСпособамОбеспечения
			|ИЗ
			|	СпособыОбеспеченияВременный КАК Таблица
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка";
		
		Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиПлановойДатыПоставки(
			"Таблица.Ссылка",
			"&НачалоТекущегоДня");
		
		Текст = СтрЗаменить(Текст, "РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки", Подстановки.Поле);
		Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
		Тексты.Добавить(Текст);
		
		Текст = ВременнаяТаблицаЗапретЗакупкиПоАссортименту(ИспользоватьАссортимент, Ложь);
		Тексты.Добавить(Текст);
		
		Тексты.Добавить(
			"УНИЧТОЖИТЬ ГодыГрафикаПредприятияВременный;
			|УНИЧТОЖИТЬ ГодыГрафикаПредприятия");
		
		Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Т.СпособОбеспечения КАК СпособОбеспечения
			|ПОМЕСТИТЬ СпособыОбеспечения
			|ИЗ
			|	ВтТовары КАК Т
			|		ЛЕВОЕ СОЕДИНЕНИЕ БлижайшийЦиклПоСпособамОбеспечения КАК ТаблицаСпособовОбеспечения
			|		ПО Т.СпособОбеспечения = ТаблицаСпособовОбеспечения.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапретЗакупкиПоАссортименту КАК ЗапретЗакупкиПоАссортименту
			|		ПО ЗапретЗакупкиПоАссортименту.Склад = Т.Склад
			|		 И ЗапретЗакупкиПоАссортименту.Номенклатура = Т.Номенклатура
			|		 И ЗапретЗакупкиПоАссортименту.ДатаВозможнойПоставки = ЕСТЬNULL(ТаблицаСпособовОбеспечения.ДатаПоставки, &НачалоТекущегоДня)
			|ГДЕ
			|	ЗапретЗакупкиПоАссортименту.Склад ЕСТЬ NULL";
		Тексты.Добавить(Текст);
		
		Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
		ТекстСпособыОбеспечения = Текст + ОбщегоНазначения.РазделительПакетаЗапросов();
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстСпособыОбеспечения;
	
	ИсточникДанных = ИсточникДанныхДляСпособовОбеспечения(ТоварыПоддерживаемогоЗапаса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НаборТекстовЗапросов", СтрШаблон("(%1)", ИсточникДанных));
	ТекстЗапроса = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
		ТекстЗапроса, "ПодстановкаОсновногоСпособаОбеспечения");
	
	ТекстЗапроса = ТекстЗапроса +
		// Фиктивный запрос, чтобы СКД не удалило нужные временные таблицы, упрощая запрос.
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.СпособОбеспечения КАК СпособОбеспечения
		|{ВЫБРАТЬ
		|	СпособОбеспечения.* КАК СпособОбеспечения}
		|ИЗ
		|	СпособыОбеспечения КАК Т";
	
	ДоступныеТипыОбеспечения = ДоступныеТипыОбеспечения(КлючНазначенияИспользования);
	ТекстУсловияДоступаПоТипуОбеспечения = ?(ДоступныеТипыОбеспечения = Неопределено,
		"ИСТИНА",
		"ЕСТЬNULL(Т.СпособОбеспечения.ТипОбеспечения, ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка)) В (&ДоступныеТипыОбеспечения)");
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам")
			И (ДоступныеТипыОбеспечения = Неопределено Или ДоступныеТипыОбеспечения.Количество() > 0) Тогда
		ТекстУсловияДоступаПоТипуОбеспечения = ?(ДоступныеТипыОбеспечения = Неопределено,
			"ИСТИНА",
			"(Т.СпособОбеспечения.ТипОбеспечения ЕСТЬ NULL ИЛИ Т.СпособОбеспечения.ТипОбеспечения В(&ДоступныеТипыОбеспечения))");
	КонецЕсли;
	ТекстУсловияДоступаПоТипуОбеспечения = ТекстУсловияДоступаПоТипуОбеспечения + "
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДоступаПоТипуОбеспечения", ТекстУсловияДоступаПоТипуОбеспечения);
	
	Возврат ТекстЗапроса;

КонецФункции // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
Функция юум_ВременнаяТаблицаПотребностиВсехСкладовПоЗаказамПоТребованию()
	// код типовой функции ВременнаяТаблицаПотребностиВсехСкладовПоЗаказам() с изменениями для номенклатуры "по требованию"
	
	ТекстЗапроса =
		Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь) +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Товары.Номенклатура                                    КАК Номенклатура,
		|	Товары.Характеристика                                  КАК Характеристика,
		|	
		|	ВЫБОР КОГДА Товары.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Товары.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР КОГДА Товары.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Товары.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОНЕЦ КАК ПодразделениеПолучатель,
		|	
		|	Товары.Назначение                                      КАК Назначение,
		|	Товары.ЗаказНаОтгрузку                                 КАК Заказ,
		|	Товары.ЖелаемаяДатаОтгрузки                            КАК ДатаОтгрузки,
		|	
		|	ВЫБОР
		|		КОГДА Товары.СостояниеЗапаса = ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.НеОбеспечен)
		|			ТОГДА Товары.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеОбеспечено,
		|	
		|	ВЫБОР
		|		КОГДА Товары.СостояниеЗапаса В(
		|				ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ВНаличии),
		|				ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ВНаличииОжидаетсяРазблокировка),
		|				ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ОжидаетсяКПоступлению),
		|				ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ОжидаетсяКПоступлениюСБлокировкой),
		|				ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.НаСогласованииПоставки))
		|			ТОГДА Товары.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Распределено,
		|	
		|	Товары.СостояниеЗапаса КАК СостояниеЗапаса,
// ++ НЕ УТКА
		|	НЕОПРЕДЕЛЕНО                                           КАК КлючПартия,
// -- НЕ УТКА
		|	СпрСпособ.Ссылка                                       КАК СпособОбеспечения
		|ПОМЕСТИТЬ ПотребностиВсехСкладовПоЗаказам
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Товары
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|		ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|ГДЕ
		|	Товары.ХарактеристикаПотребности В(
		|		ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.РезервироватьПоМереПоступления),
		|		ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.ОтложитьРезервирование),
		|		ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.КОбеспечению))
		|
		// отборы компоновщика
		|{ГДЕ
		|	Товары.Номенклатура.*                             КАК Номенклатура,
		|	Товары.Характеристика.*                           КАК Характеристика,
		|	Товары.Назначение.*                               КАК Назначение,
		|	ВЫРАЗИТЬ(
		|		ВЫБОР
		|			КОГДА Товары.Склад ССЫЛКА Справочник.СтруктураПредприятия
		|				ТОГДА Товары.Склад
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|		КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|{ГДЕ Товары.ЗаказНаОтгрузку В(
		|	ВЫБРАТЬ
		|		ТаблицаОтбора.Заказ КАК Заказ
		|	ИЗ
		|		ОтборПоЗаказам КАК ТаблицаОтбора
		|	ГДЕ
		|		&ИспользуетсяОтборПоЗаказам)}
		|
		|{ГДЕ (Товары.Номенклатура, Товары.Характеристика) В(
		|	ВЫБРАТЬ
		|		ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|		ТаблицаОтбора.Характеристика КАК Характеристика
		|	ИЗ
		|		ОтборПоСегментам КАК ТаблицаОтбора
		|	ГДЕ
		|		&ИспользуетсяОтборПоСегментуНоменклатуры)}
// ++ НЕ УТКА

		// Потребности по заказам на производство
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.Номенклатура                                           КАК Номенклатура,
		|	Товары.Характеристика                                         КАК Характеристика,
		|	
		|	ВЫБОР КОГДА Товары.Склад ССЫЛКА Справочник.Склады ТОГДА
		|				Товары.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР КОГДА Товары.Склад ССЫЛКА Справочник.СтруктураПредприятия ТОГДА
		|				Товары.Склад
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОНЕЦ КАК ПодразделениеПолучатель,
		|	
		|	Товары.Назначение                                               КАК Назначение,
		|	Товары.ЗаказНаПроизводство                                      КАК Заказ,
		|	Товары.ЖелаемаяДатаОтгрузки                                     КАК ДатаОтгрузки,
		|	Товары.Количество                                               КАК НеОбеспечено,
		|	0                                                               КАК Распределено,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.НеОбеспечен)              КАК СостояниеЗапаса,
		|	Товары.КлючПартия                                               КАК КлючПартия,
		|	Товары.СпособОбеспечения                                        КАК СпособОбеспечения
		|ИЗ
		|	(ВЫБРАТЬ
		|
		|		Товары.Номенклатура        КАК Номенклатура,
		|		Товары.Характеристика      КАК Характеристика,
		|		Товары.Склад               КАК Склад,
		|		Товары.Назначение          КАК Назначение,
		|		Товары.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		Товары.КлючНоменклатура    КАК КлючНоменклатура,
		|
		|		СпрСпособ.Ссылка КАК СпособОбеспечения,
		|
		|		МИНИМУМ(ВЫБОР
		|				КОГДА Товары.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
		|					ТОГДА Товары.КлючПартия
		|			КОНЕЦ) КАК КлючПартия,
		|		МИНИМУМ(ISNULL(ДатыГрафика.Начало, Товары.ЗаказНаПроизводство.НачатьНеРанее)) КАК ЖелаемаяДатаОтгрузки,
		|
		|		СУММА(Товары.КОбеспечению - Товары.Заменено - Товары.РаспределеноИзЗапасовОбособленно - Товары.РаспределеноИзПартийОбособленно) КАК Количество
		|
		|	ИЗ
		|		РегистрСведений.СтруктураЗаказа КАК Товары
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ДатыГрафика
		|			ПО Товары.ЗаказНаПроизводство = ДатыГрафика.ЗаказНаПроизводство
		|			 И ДатыГрафика.СтатусГрафика = 0
		|			 И Товары.Этап = ДатыГрафика.Этап
		|			 И Товары.КлючПартия = ДатыГрафика.КлючПартия
		|
		|	ГДЕ
		|		Товары.ВидСтроки НЕ В (
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
		|
		|	{ГДЕ
		|		Товары.Номенклатура.*   КАК Номенклатура,
		|		Товары.Характеристика.* КАК Характеристика,
		|		Товары.Назначение.*     КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Товары.Склад ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Товары.Склад
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Товары.ЗаказНаПроизводство В (
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Товары.Номенклатура, Товары.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|	СГРУППИРОВАТЬ ПО
		|		Товары.Номенклатура,
		|		Товары.Характеристика,
		|		Товары.Склад,
		|		Товары.Назначение,
		|		Товары.ЗаказНаПроизводство,
		|		Товары.КлючНоменклатура,
		|		СпрСпособ.Ссылка
		|
		|	ИМЕЮЩИЕ
		|		СУММА(Товары.КОбеспечению - Товары.Заменено - Товары.РаспределеноИзЗапасовОбособленно - Товары.РаспределеноИзПартийОбособленно) > 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|
		|		Товары.Номенклатура                          КАК Номенклатура,
		|		Товары.Характеристика                        КАК Характеристика,
		|		Товары.Склад                                 КАК Склад,
		|		Товары.НазначениеСтруктуры                   КАК Назначение,
		|		Товары.ЗаказНаПроизводство                   КАК ЗаказНаПроизводство,
		|		Товары.КлючНоменклатура                      КАК КлючНоменклатура,
		|
		|		СпрСпособ.Ссылка КАК СпособОбеспечения,
		|
		|		МИНИМУМ(ВЫБОР
		|				КОГДА Товары.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
		|					ТОГДА Товары.КлючПартия
		|			КОНЕЦ) КАК КлючПартия,
		|		МИНИМУМ(ISNULL(ДатыГрафика.Начало, Товары.ЗаказНаПроизводство.НачатьНеРанее)) КАК ЖелаемаяДатаОтгрузки,
		|
		|		СУММА(Товары.РаспределеноИзЗапасовОбособленно + Товары.РаспределеноИзПартийОбособленно) КАК Количество
		|
		|	ИЗ
		|		РегистрСведений.СтруктураЗаказа КАК Товары
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ДатыГрафика
		|			ПО Товары.ЗаказНаПроизводство = ДатыГрафика.ЗаказНаПроизводство
		|			 И ДатыГрафика.СтатусГрафика = 0
		|			 И Товары.Этап = ДатыГрафика.Этап
		|			 И Товары.КлючПартия = ДатыГрафика.КлючПартия
		|
		|	ГДЕ
		|		Товары.ВидСтроки НЕ В (
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
		|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
		|
		|	{ГДЕ
		|		Товары.Номенклатура.*                        КАК Номенклатура,
		|		Товары.Характеристика.*                      КАК Характеристика,
		|		Товары.НазначениеСтруктуры.*                 КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Товары.Склад ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Товары.Склад
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Товары.ЗаказНаПроизводство В (
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Товары.Номенклатура, Товары.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|	СГРУППИРОВАТЬ ПО
		|		Товары.Номенклатура,
		|		Товары.Характеристика,
		|		Товары.Склад,
		|		Товары.НазначениеСтруктуры,
		|		Товары.ЗаказНаПроизводство,
		|		Товары.КлючНоменклатура,
		|		СпрСпособ.Ссылка
		|
		|	ИМЕЮЩИЕ
		|		СУММА(Товары.РаспределеноИзЗапасовОбособленно + Товары.РаспределеноИзПартийОбособленно) > 0
		// ++ номенклатура "по требованию"
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|
		|		Товары.Номенклатура                          КАК Номенклатура,
		|		Товары.Характеристика                        КАК Характеристика,
		|		Товары.Склад                                 КАК Склад,
		|		Товары.Назначение                   КАК Назначение,
		|		Товары.ЗаказНаПроизводство                   КАК ЗаказНаПроизводство,
		|		НЕОПРЕДЕЛЕНО                      КАК КлючНоменклатура,
		|
		|		СпрСпособ.Ссылка КАК СпособОбеспечения,
		|
		|		НЕОПРЕДЕЛЕНО КАК КлючПартия,
		|		МИНИМУМ(Товары.ЗаказНаПроизводство.НачатьНеРанее) КАК ЖелаемаяДатаОтгрузки,
		|
		|		СУММА(ВЫБОР
		|				КОГДА Товары.Вероятность = 0
		|					ТОГДА Товары.Количество
		|				ИНАЧЕ Товары.Количество * Товары.Вероятность / 100
		|		КОНЕЦ) КАК Количество
		|
		|	ИЗ
		|		РегистрСведений.юум_НоменклатураПоТребованию КАК Товары
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
		|			ПО &ПодстановкаОсновногоСпособаОбеспечения
		|
		|	{ГДЕ
		|		Товары.Номенклатура.*                        КАК Номенклатура,
		|		Товары.Характеристика.*                      КАК Характеристика,
		|		Товары.Назначение.*                 КАК Назначение,
		|		ВЫРАЗИТЬ(
		|			ВЫБОР
		|				КОГДА Товары.Подразделение ССЫЛКА Справочник.СтруктураПредприятия
		|					ТОГДА Товары.Подразделение
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.Пустаяссылка)
		|			КОНЕЦ КАК Справочник.СтруктураПредприятия).* КАК ПодразделениеПолучатель}
		|
		|	{ГДЕ Товары.ЗаказНаПроизводство В (
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Заказ КАК Заказ
		|		ИЗ
		|			ОтборПоЗаказам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоЗаказам)}
		|
		|	{ГДЕ (Товары.Номенклатура, Товары.Характеристика) В(
		|		ВЫБРАТЬ
		|			ТаблицаОтбора.Номенклатура   КАК Номенклатура,
		|			ТаблицаОтбора.Характеристика КАК Характеристика
		|		ИЗ
		|			ОтборПоСегментам КАК ТаблицаОтбора
		|		ГДЕ
		|			&ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|	СГРУППИРОВАТЬ ПО
		|		Товары.Номенклатура,
		|		Товары.Характеристика,
		|		Товары.Склад,
		|		Товары.Назначение,
		|		Товары.ЗаказНаПроизводство,
		|		НЕОПРЕДЕЛЕНО,
		|		СпрСпособ.Ссылка
		|
		|	ИМЕЮЩИЕ
		|		СУММА(Количество) > 0
		// -- номенклатура "по требованию"
		|
		|) КАК Товары
		|
// -- НЕ УТКА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтФорматыСкладов";
	
	ТекстЗапроса = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
		ТекстЗапроса,
		"ПодстановкаОсновногоСпособаОбеспечения",
		"Товары.Номенклатура,Товары.Характеристика,ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады)");
	
	// ++ НЕ УТКА
	УправлениеПроизводством.ПодстановкаАктуальногоРегистраГрафика(ТекстЗапроса);
	// -- НЕ УТКА
	
	Возврат ТекстЗапроса;
	
КонецФункции // } #юум

&ИзменениеИКонтроль("ТаблицаПотребностейПоЗаказамИОстатков")
Процедура юум_ТаблицаПотребностейПоЗаказамИОстатков(Параметры, АдресРезультата)

	ОптимизироватьЗапасыРаспределительногоЦентра = Константы.ОптимизироватьЗапасыРаспределительногоЦентра.Получить();

	ИспользоватьАссортимент = Ложь;

	Если Параметры.ТипОтбора = "ОтборПоЗначениям" Тогда

		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Номенклатура   КАК Номенклатура,
		|	&Характеристика КАК Характеристика,
		|	&Склад          КАК Склад,
		|	&ДатаОтгрузкиЗаказа      КАК ДатаОтгрузкиЗаказа,
		|	&СкладОтгрузкиЗаказа     КАК СкладОтгрузкиЗаказа,
		|	&ПодразделениеПолучатель КАК ПодразделениеПолучатель,
		|	ВЫРАЗИТЬ(&СпособОбеспечения КАК Справочник.СпособыОбеспеченияПотребностей) КАК СпособОбеспечения,
		|	
		|	&Назначение     КАК Назначение,
		|	&Заказ          КАК Заказ,
		|	&ДатаОтгрузки   КАК ДатаОтгрузки,
		|	0 КАК НеОбеспечено,
		|	0 КАК РаспределеноНаСкладе,
		|	0 КАК РаспределеноИзЗаказов
		|ПОМЕСТИТЬ ВтТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Способы.СпособОбеспечения КАК СпособОбеспечения
		|ПОМЕСТИТЬ СпособыОбеспечения
		|ИЗ
		|	ВтТовары КАК Способы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Центр
		|ПОМЕСТИТЬ ТопологияСкладов
		|ГДЕ
		|	ЛОЖЬ
		|;
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)                 КАК Назначение
		|ПОМЕСТИТЬ ТоварыИСкладыПопавшиеВОбработку
		|ГДЕ
		|	ЛОЖЬ";

		Для Каждого Свойство Из Параметры.Отбор Цикл
			Запрос.УстановитьПараметр(Свойство.Ключ, Свойство.Значение);
		КонецЦикла;
		Запрос.Выполнить();

		ОбеспечениеВДокументахСервер.ВременнаяТаблицаБлижайшийЦиклПоСпособамОбеспечения(Запрос.МенеджерВременныхТаблиц);

	Иначе

		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

		СхемаКомпоновкиДанных = Обработки.ОбеспечениеПотребностей.ПолучитьМакет("МакетКомпоновкиДляСерверныхОтборов");
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);

		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.Отбор);

		// Основной запрос
		Тексты = Новый Массив();
		Тексты.Добавить(ВременнаяТаблицаОтборПоСегментам());
		Тексты.Добавить(ВременнаяТаблицаОтборПоЗаказам());
		#Вставка
		// #юум {
		// #ЧТЗ 03.01 Управление закупками
		// Галфинд Садомцев 2026/09/18        	
		// Проверяем флажок ""Включать материалы по требованию""
		юум_ВключатьМатериалыПоТребованию = Неопределено;
		Параметры.Свойство("юум_ВключатьМатериалыПоТребованию", юум_ВключатьМатериалыПоТребованию);
		Если ТипЗнч(юум_ВключатьМатериалыПоТребованию) = Тип("Булево")
			И юум_ВключатьМатериалыПоТребованию Тогда
			// здесь надо дополнить текст запроса номенклатурой " по требованию"
			Тексты.Добавить(юум_ВременнаяТаблицаПотребностиВсехСкладовПоЗаказамПоТребованию());
		Иначе
		// здесь типовой код
		// } #юум
		#КонецВставки
		Тексты.Добавить(ВременнаяТаблицаПотребностиВсехСкладовПоЗаказам());
		#Вставка
		КонецЕсли;
		#КонецВставки
		Тексты.Добавить(
		"ВЫБРАТЬ
		|	Таблица.СпособОбеспечения КАК СпособОбеспечения
		|ПОМЕСТИТЬ СпособыОбеспеченияДляОтборов
		|ИЗ
		|	&ТаблицаСпособовОбеспечения КАК Таблица");
		Тексты.Добавить(ВременнаяТаблицаПотребностиВыбранныхСкладов());
		Тексты.Добавить(ВыборкаПервойЗаписиПотребностейПоЗаказамДляКомпоновкиЗапроса());
		Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());

		СхемаКомпоновкиДанных.НаборыДанных.Набор.Запрос = Текст;
		Запрос = ПолучитьЗапросСОтборамиКомпоновкиДанных(АдресСхемыКомпоновкиДанных, КомпоновщикНастроек, "Набор");
		УдалитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

		// Отделим часть запроса, которую необходимо выполнить привилегированно.
		ПозицияУдаления = СтрНайти(Запрос.Текст, "УНИЧТОЖИТЬ ВтФорматыСкладов");
		Позиция = СтрНайти(Запрос.Текст, ";", НаправлениеПоиска.СНачала, ПозицияУдаления) + 1;
		ТекстЗапросаПривилегированно = Сред(Запрос.Текст, Позиция);
		Запрос.Текст = Лев(Запрос.Текст, ПозицияУдаления - 1);
		Запрос.УстановитьПараметр("ОптимизироватьЗапасыРаспределительногоЦентра", ОптимизироватьЗапасыРаспределительногоЦентра);
		Запрос.УстановитьПараметр("ФОЗаказыНаПеремещенияВключена",
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение"));
		Запрос.УстановитьПараметр("ФОПроизводство2_2Включена",
		ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));
		Запрос.УстановитьПараметр("ТаблицаСпособовОбеспечения", Параметры.ТаблицаСпособовОбеспечения);
		//++ НЕ УТКА
		Запрос.УстановитьПараметр("ИспользуетсяГрафикПроизводства",
		УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства());
		//-- НЕ УТКА
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();

		// Для части запроса выполняемой в привилегированном режиме нужна временная таблица топологии складов.
		Запрос.Текст = ВременнаяТаблицаРазличнаяНоменклатура("ПотребностиВсехСкладовПоЗаказам");
		Запрос.Выполнить();
		РегистрыСведений.СхемыОбеспечения.ВременнаяТаблицаТопологияСкладов(Запрос, "РазличнаяНоменклатура");

		УстановитьПривилегированныйРежим(Истина);

		Запрос.Текст = ТекстЗапросаПривилегированно;
		Запрос.Выполнить();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.СпособОбеспечения КАК Ссылка,
		|	Таблица.ДатаПоставки КАК ДатаПоставки,
		|	Таблица.ГраницаПериодаОбеспечения КАК ГраницаПериодаОбеспечения,
		|	Таблица.ФормироватьЗаказыПоРасписанию КАК ФормироватьЗаказыПоРасписанию,
		|	Таблица.ДатаПоставкиПоГрафику КАК ДатаПоставкиПоГрафику,
		|	Таблица.ГраницаПериодаОбеспеченияПоГрафику КАК ГраницаПериодаОбеспеченияПоГрафику,
		|	Таблица.ПлановаяДатаЗаказа КАК ПлановаяДатаЗаказа,
		|	Таблица.ДнейДоПлановогоЗаказа КАК ДнейДоПлановогоЗаказа,
		|	Таблица.ФормироватьЗаказыПоТочкеЗаказа КАК ФормироватьЗаказыПоТочкеЗаказа,
		|	Таблица.ДатаПоставкиПоТочкеЗаказа КАК ДатаПоставкиПоТочкеЗаказа,
		|	Таблица.ГраницаПериодаОбеспеченияПоТочкеЗаказа КАК ГраницаПериодаОбеспеченияПоТочкеЗаказа,
		|	Таблица.ГрафикПоставок КАК ГрафикПоставок,
		|	Таблица.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
		|	Таблица.КЗаказуТовары КАК КЗаказуТовары
		|ПОМЕСТИТЬ БлижайшийЦиклПоСпособамОбеспечения
		|ИЗ
		|	&ТаблицаСпособовОбеспечения КАК Таблица
		|;
		|
		|///////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры
		|				= ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|			ТОГДА Товары.ПодразделениеПолучатель
		|		ИНАЧЕ Товары.Склад
		|	КОНЕЦ КАК Склад,
		|	Товары.Назначение КАК Назначение
		|ПОМЕСТИТЬ ТоварыИСкладыПопавшиеВОбработку
		|ИЗ
		|	ВтТовары КАК Товары
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение";
		Запрос.Выполнить();

		ИспользоватьАссортимент = ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент");

	КонецЕсли;

	НачалоДня = НачалоДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня);

	ИспользоватьКонтрольКачества = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКачестваТоваров");

	Тексты = Новый Массив();

	Текст = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
	Тексты.Добавить(Текст);

	Если ИспользоватьКонтрольКачества Тогда

		Текст =
		"ВЫБРАТЬ
		|	*,
		|	ВЫБОР
		|		КОГДА Товары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА РасчетСроковКонтроляПереопределяемый.НайденнаяДата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА NULL
		|		ИНАЧЕ РасчетСроковКонтроляПереопределяемый.НайденнаяДата
		|	КОНЕЦ КАК ДатаОтгрузкиМинусСрокКонтроляКачества
		|ПОМЕСТИТЬ ВтТоварыСУчетомКонтроляКачества
		|ИЗ
		|	ВтТовары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлижайшийЦиклПоСпособамОбеспечения КАК Таблица
		|		ПО Таблица.Ссылка = Товары.СпособОбеспечения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетСроковКонтроляПереопределяемый ПО ИСТИНА";

		Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
		"Товары.ДатаОтгрузки",
		"ВЫБОР
		|	КОГДА Товары.Номенклатура.КонтролироватьКачествоПоступившегоТовара
		|			И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).КонтролироватьКачествоПоступившегоТовара
		|		ТОГДА -Товары.Номенклатура.СрокКонтроляКачества
		|	ИНАЧЕ 0
		|КОНЕЦ");

		Текст = СтрЗаменить(Текст, "РасчетСроковКонтроляПереопределяемый.НайденнаяДата", Подстановки.Поле);
		Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетСроковКонтроляПереопределяемый ПО ИСТИНА", Подстановки.Соединения);

		Тексты.Добавить(Текст);

	КонецЕсли;

	Текст =
	// Календари, где нужно искать дату заказа.
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.СпособОбеспечения,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки
	|ПОМЕСТИТЬ СпособыИДатыОтгрузки
	|ИЗ
	|	ВтТовары КАК Товары
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлижайшийЦиклПоСпособамОбеспечения КАК ТаблицаСпособовОбеспечения
	|		ПО ТаблицаСпособовОбеспечения.Ссылка = Товары.СпособОбеспечения
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВариантУпорядочиванияПотребностейПоЗаказамДляОбеспечения КАК УпорядочиваниеПоДатеДокумента
	|		ПО УпорядочиваниеПоДатеДокумента.Значение = ЗНАЧЕНИЕ(Перечисление.ВариантыУпорядочиванияПотребностейПоЗаказамДляОбеспечения.ПриоритетИДатаОтгрузки)
	|ГДЕ
	|	Товары.ДатаОтгрузки > ТаблицаСпособовОбеспечения.ДатаПоставки
	|		ИЛИ ТаблицаСпособовОбеспечения.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)";

	Если ИспользоватьКонтрольКачества Тогда

		Текст = СтрЗаменить(Текст, "ВтТовары", "ВтТоварыСУчетомКонтроляКачества");
		Текст = СтрЗаменить(Текст, "Товары.ДатаОтгрузки", "Товары.ДатаОтгрузкиМинусСрокКонтроляКачества");

	КонецЕсли;

	Тексты.Добавить(Текст);

	Текст =
	"ВЫБРАТЬ
	|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый.ПлановаяДатаПоставки КАК ДатаПоставки
	|ПОМЕСТИТЬ ДатыПоставок
	|ИЗ
	|	СпособыИДатыОтгрузки КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый ПО ИСТИНА
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОбеспечения";

	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиДатыПоставкиБлижайшейКДатеОтгрузки(
	"Таблица.СпособОбеспечения",
	"Таблица.ДатаОтгрузки");

	Текст = СтрЗаменить(Текст, "РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый.ПлановаяДатаПоставки", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	// Если заказы формируются только по точке заказа, то дата поставки любой день,
	// значит дата поставки = дата отгрузки, но если отгрузка в выходной, то дата поставки первый рабочий день до даты отгрузки.
	// Если первый рабочий день до даты отгрузки слева меньше текущего, то ставим на первый рабочий день после него (справа).
	Текст =
	"ВЫБРАТЬ
	|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(Таблица.СпособОбеспечения КАК Справочник.СпособыОбеспеченияПотребностей).ФормироватьЗаказыПоРасписанию
	|				И КалендарьПредприятияВременный.Значение <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|				И РасчетДобавленияДатыПереопределяемый.НайденнаяДата >= &НачалоТекущегоДня
	|			ТОГДА РасчетДобавленияДатыПереопределяемый.НайденнаяДата
	|		ИНАЧЕ Таблица.ДатаПоставки
	|	КОНЕЦ КАК ДатаПоставки,
	|	НЕ ВЫРАЗИТЬ(Таблица.СпособОбеспечения КАК Справочник.СпособыОбеспеченияПотребностей).ФормироватьЗаказыПоРасписанию
	|		И КалендарьПредприятияВременный.Значение <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|		И РасчетДобавленияДатыПереопределяемый.НайденнаяДата < &НачалоТекущегоДня
	|		И РасчетДобавленияДатыПереопределяемый.НайденнаяДата > ДАТАВРЕМЯ(1, 1, 1) КАК ПрибавитьОдинРабочийДень
	|ПОМЕСТИТЬ ДатыПоставокСУчетомРабочихДнейПервая
	|ИЗ
	|	ДатыПоставок КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ОсновнойКалендарьПредприятия КАК КалендарьПредприятияВременный
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОбеспечения";

	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
	"Таблица.ДатаПоставки", "0", Истина);

	Текст = СтрЗаменить(Текст, "РасчетДобавленияДатыПереопределяемый.НайденнаяДата", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Текст =
	"ВЫБРАТЬ
	|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА Таблица.ПрибавитьОдинРабочийДень
	|				И РасчетДобавленияДатыПереопределяемый.НайденнаяДата > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РасчетДобавленияДатыПереопределяемый.НайденнаяДата
	|		ИНАЧЕ Таблица.ДатаПоставки
	|	КОНЕЦ КАК ДатаПоставки
	|ПОМЕСТИТЬ ДатыПоставокСУчетомРабочихДней
	|ИЗ
	|	ДатыПоставокСУчетомРабочихДнейПервая КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОбеспечения";

	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
	"Таблица.ДатаПоставки", "1");

	Текст = СтрЗаменить(Текст, "РасчетДобавленияДатыПереопределяемый.НайденнаяДата", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Текст =
	"ВЫБРАТЬ
	|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Таблица.ДатаПоставки КАК ДатаПоставки,
	|	РасчетДобавленияДатыПереопределяемый.НайденнаяДата КАК ДатаЗаказа
	|ПОМЕСТИТЬ ДатыПоставокИДатыЗаказов
	|ИЗ
	|	ДатыПоставокСУчетомРабочихДней КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОбеспечения, ДатаОтгрузки";

	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
	"Таблица.ДатаПоставки", "-Таблица.СпособОбеспечения.СрокИсполненияЗаказа");

	Текст = СтрЗаменить(Текст, "РасчетДобавленияДатыПереопределяемый.НайденнаяДата", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();

	ТекстыЗапросов = Новый Массив();

	ТекстыЗапросов.Добавить(ВременнаяТаблицаДанныеЗаполненияЗаказаПоставщику());
	ТекстыЗапросов.Добавить(ВременнаяТаблицаЗапретЗакупкиПоАссортименту(ИспользоватьАссортимент, Ложь));
	Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Склад КАК Склад
	|ПОМЕСТИТЬ СкладыВходящиеВРаспределительныеСети
	|ИЗ
	|	ТопологияСкладов КАК Таблица
	|ГДЕ
	|	Таблица.Склад <> Таблица.Центр
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,Характеристика,Склад";

	ТекстыЗапросов.Добавить(Текст);

	Текст =
	"ВЫБРАТЬ
	|	Т.Номенклатура                                   КАК Номенклатура,
	|	Т.Характеристика                                 КАК Характеристика,
	|	Т.Склад                                          КАК Склад,
	|	НЕ СкладыВходящиеВРаспределительныеСети.Склад ЕСТЬ NULL КАК ОбеспечиваетсяИзРаспределительногоЦентра,
	|	Т.СкладОтгрузкиЗаказа                            КАК СкладОтгрузкиЗаказа,
	|	Т.ДатаОтгрузкиЗаказа                             КАК ДатаОтгрузкиЗаказа,
	|	Т.Номенклатура.Наименование                      КАК НоменклатураНаименование,
	|	Т.Характеристика.Наименование                    КАК ХарактеристикаНаименование,
	|	Т.Склад.Наименование                             КАК СкладНаименование,
	|	Т.Назначение.Наименование                        КАК НазначениеНаименование,
	|
	|	Т.ПодразделениеПолучатель                        КАК ПодразделениеПолучатель,
	|	Т.Назначение                                     КАК Назначение,
	|	Т.Заказ                                          КАК Заказ,
	|	ЗаказыРеестра.Приоритет                          КАК Приоритет,
	|	ЕСТЬNULL(ЗаказыРеестра.Приоритет.РеквизитДопУпорядочивания,
	|		0)                                           КАК ПриоритетРеквизитДопУпорядочивания,
	|	Т.ДатаОтгрузки                                   КАК ДатаОтгрузки,
	|	Т.НеОбеспечено + Т.РаспределеноНаСкладе + Т.РаспределеноИзЗаказов КАК Требуется,
	|	ВЫБОР
	|		КОГДА ТопологияСкладовЭтоЦентр.Склад ЕСТЬ NULL
	|			ТОГДА Т.РаспределеноНаСкладе + Т.РаспределеноИзЗаказов
	|		ИНАЧЕ Т.РаспределеноНаСкладе
	|	КОНЕЦ КАК КРезервированию,
	|	
	|	ВЫБОР
	|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА Т.ДатаОтгрузки > &КонецТекущегоДня
	|			ТОГДА Т.ДатаОтгрузки
	//++ НЕ УТКА
	|		КОГДА &ПроверкаЭтапаСУчетомПравПереопределяемый
	|			ТОГДА &ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗаказыРеестра.ДатаДокументаИБ
	|	КОНЕЦ ПорядокСортировки,
	|	ВЫБОР
	|		КОГДА &ПроверкаЭтапаСУчетомПравПереопределяемый
	|			ТОГДА &ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый
	|		КОГДА ИСТИНА
	|			ТОГДА ЗаказыРеестра.ДатаДокументаИБ
	|	КОНЕЦ КАК ДатаДокументаИБ,
	|	ВЫБОР
	|		КОГДА Т.ДатаОтгрузки > &КонецТекущегоДня
	|			ТОГДА Т.ДатаОтгрузки
	//++ НЕ УТКА
	|		КОГДА &ПроверкаЭтапаСУчетомПравПереопределяемый
	|			ТОГДА &ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗаказыРеестра.ДатаДокументаИБ
	|	КОНЕЦ КАК ПорядокПоДатеОтгрузкиПослеДатыДокумента,
	|	ВЫБОР КОГДА Т.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		 И ТоварныеОграничения.МетодОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
	|		 И ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса = ЗНАЧЕНИЕ(Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса.НезависимоОтЗапасов) ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ КАК ОбеспечиватьНезависимоОтЗапасов,
	|	
	// Параметры номенклатуры
	|	&ТекстЗапросаВесНоменклатуры                        КАК Вес,
	|	Т.Номенклатура.ЕдиницаИзмерения                     КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины КАК ТипЕдиницыИзмерения,
	|	Т.Номенклатура.Код                                  КАК Код,
	|	Т.Номенклатура.Артикул                              КАК Артикул,
	|	Т.Номенклатура.ИспользоватьУпаковки                 КАК ИспользоватьУпаковки,
	|
	|	ВЫБОР КОГДА Т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ КАК ЭтоРабота,
	|
	// Способ обеспечения
	|	ЕСТЬNULL(Т.СпособОбеспечения, ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)) КАК СпособОбеспечения,
	|	ЕСТЬNULL(Т.СпособОбеспечения.ТипОбеспечения,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка)) КАК ТипОбеспечения,
	|	ВЫБОР
	|		КОГДА &ФормироватьЗаявкиНаЗакупку
	|			И ЕСТЬNULL(Т.СпособОбеспечения.Ответственный,
	|				ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА &ТекущийПользователь
	|		ИНАЧЕ ЕСТЬNULL(Т.СпособОбеспечения.Ответственный,
	|				ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|	КОНЕЦ КАК Менеджер,
	|	ТаблицаСпособовОбеспечения.КЗаказуТовары КАК КЗаказуТовары,
	|	ВЫБОР
	|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
	|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
	|		КОГДА &ДатаОтгрузкиСУчетомСрокаКонтроляКачества <= ТаблицаСпособовОбеспечения.ДатаПоставки
	|				И ТаблицаСпособовОбеспечения.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
	|		КОГДА НЕ ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
	|			И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|			И &ДатаОтгрузкиСУчетомСрокаКонтроляКачества = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА &НачалоТекущегоДня
	|		КОГДА ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < &НачалоТекущегоДня
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
	|				И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < ТаблицаСпособовОбеспечения.ДатаПоставки
	|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
	|		ИНАЧЕ ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки
	|	КОНЕЦ КАК ДатаПоставки,
	|	ВЫБОР
	|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
	|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
	|		КОГДА &ДатаОтгрузкиСУчетомСрокаКонтроляКачества <= ТаблицаСпособовОбеспечения.ДатаПоставки
	|				И ТаблицаСпособовОбеспечения.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
	|		КОГДА НЕ ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
	|			И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|			И &ДатаОтгрузкиСУчетомСрокаКонтроляКачества = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА &НачалоТекущегоДня
	|		КОГДА ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < &НачалоТекущегоДня
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
	|				И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < ТаблицаСпособовОбеспечения.ДатаПоставки
	|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
	|		ИНАЧЕ ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки
	|	КОНЕЦ КАК ДатаПоставкиРасчетная,
	|	ТаблицаСпособовОбеспечения.ДатаПоставки КАК ДатаПоставкиПоСпособуОбеспечения,
	|	ВЫБОР
	|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
	|				ИЛИ &ДатаОтгрузкиСУчетомСрокаКонтроляКачества <= ТаблицаСпособовОбеспечения.ДатаПоставки
	|					И ТаблицаСпособовОбеспечения.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < &НачалоТекущегоДня
	|				ИЛИ ТаблицаДатПоставкиИДатыЗаказа.ДатаЗаказа < &НачалоТекущегоДня
	|			ТОГДА &НачалоТекущегоДня
	|		ИНАЧЕ ТаблицаДатПоставкиИДатыЗаказа.ДатаЗаказа
	|	КОНЕЦ КАК ДатаЗаказаНеПозднее,
	|	
	|	ЕСТЬNULL(&ФОЗаказыНаПеремещенияВключена И НЕ Т.Склад.ЦеховаяКладовая
	|		ИЛИ &ФОПроизводство2_2Включена И Т.Склад.ЦеховаяКладовая, ЛОЖЬ) КАК ПеремещениеРазрешено,
	|
	// Условия закупок
	|	ЕСТЬNULL(ДанныеЗаполнения.ВидЦеныПоставщика,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Т.СпособОбеспечения.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
	|					<> ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка)
	|				ТОГДА Т.СпособОбеспечения.ВидЦеныПоставщика
	|			ИНАЧЕ ЕСТЬNULL(Т.СпособОбеспечения.Соглашение.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
	|		КОНЕЦ) КАК ВидЦены,
	|	ЕСТЬNULL(ДанныеЗаполнения.Валюта, Т.СпособОбеспечения.Соглашение.Валюта)            КАК ВалютаСоглашения,
	|
	|	ВЫБОР КОГДА НЕ ЕСТЬNULL(ДанныеЗаполнения.Соглашение.ЦенаВключаетНДС, Т.СпособОбеспечения.Соглашение.ЦенаВключаетНДС) ТОГДА
	|		(ВЫБОР
	|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
	|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
	|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
	|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
	|			ИНАЧЕ 0
	|		КОНЕЦ + 100) / 100
	|			ИНАЧЕ
	|				1
	|		КОНЕЦ
	|	* ЦеныПоставщиков.Цена
	|		* ВЫБОР
	|			КОГДА КурсВалютаСоглашения.Коэффициент =0
	|				ТОГДА 0
	|			ИНАЧЕ КурсыВалют.Коэффициент / КурсВалютаСоглашения.Коэффициент
	|		КОНЕЦ
	|	/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)                                          КАК ЦенаВВалютеСоглашения,
	|
	|	ВЫБОР КОГДА НЕ ЕСТЬNULL(ДанныеЗаполнения.Соглашение.ЦенаВключаетНДС, Т.СпособОбеспечения.Соглашение.ЦенаВключаетНДС) ТОГДА
	|		(ВЫБОР
	|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
	|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
	|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
	|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
	|			ИНАЧЕ 0
	|		КОНЕЦ + 100) / 100
	|			ИНАЧЕ
	|				1
	|		КОНЕЦ
	|	* ЦеныПоставщиков.Цена * КурсыВалют.Коэффициент / &КоэффициентВалютыУпрУчета
	|	/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)                                КАК ЦенаВВалютеУправленческогоУчета,
	|
	|	ВЫБОР КОГДА Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.СборкаРазборка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ВЫБОР ЕСТЬNULL(Т.СпособОбеспечения.ИсточникОбеспеченияПотребностей, НЕОПРЕДЕЛЕНО)
	|					КОГДА НЕОПРЕДЕЛЕНО ТОГДА
	|						ЛОЖЬ
	|					КОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ТОГДА
	|						ЛОЖЬ
	|					КОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|						ЛОЖЬ
	|					КОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) ТОГДА
	|						ЛОЖЬ
	|					ИНАЧЕ
	|						ИСТИНА //источник обеспечения устанавливается в способе обеспечения потребностей
	|				КОНЕЦ
	|		КОНЕЦ                                                                      КАК ИсточникОбеспеченияТолькоПросмотр,
	|	ЕСТЬNULL(ДанныеЗаполнения.Партнер,
	|		Т.СпособОбеспечения.ИсточникОбеспеченияПотребностей)        КАК ИсточникОбеспечения,
	|	ВЫБОР КОГДА Т.СпособОбеспечения.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) ТОГДА
	|				Т.СпособОбеспечения.Соглашение
	|			ИНАЧЕ
	|				ДанныеЗаполнения.Соглашение
	|		КОНЕЦ                                                       КАК Соглашение,
	|	СпрУпаковки.Ссылка                                              КАК УпаковкаЗаказа,
	|	
	|	ЕСТЬNULL(СпрУпаковки.Числитель, 1)                   КАК ЧислительУпаковки,
	|	ЕСТЬNULL(СпрУпаковки.Знаменатель, 1)                 КАК ЗнаменательУпаковки,
	|	
	|	ЦеныПоставщиков.УпаковкаЗаказаПоставщика КАК УпаковкаЗаказаПоставщика,
	|	ЦеныПоставщиков.МинимальнаяПартияПоставки КАК МинимальнаяПартияПоставки,
	|	ВЫБОР КОГДА Т.СпособОбеспечения.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) ТОГДА
	|				ЕСТЬNULL(Т.СпособОбеспечения.Соглашение.МинимальнаяСуммаЗаказа,0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ДанныеЗаполнения.Соглашение.МинимальнаяСуммаЗаказа,0)
	|		КОНЕЦ                                                       КАК МинимальнаяСуммаЗаказа
	|ИЗ
	|	ВтТовары КАК Т
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлижайшийЦиклПоСпособамОбеспечения КАК ТаблицаСпособовОбеспечения
	|		ПО Т.СпособОбеспечения = ТаблицаСпособовОбеспечения.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоставокИДатыЗаказов КАК ТаблицаДатПоставкиИДатыЗаказа
	|		ПО ТаблицаДатПоставкиИДатыЗаказа.СпособОбеспечения = Т.СпособОбеспечения
	|		 И ТаблицаДатПоставкиИДатыЗаказа.ДатаОтгрузки = &ДатаОтгрузкиСУчетомСрокаКонтроляКачества
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыВходящиеВРаспределительныеСети КАК СкладыВходящиеВРаспределительныеСети
	|		ПО СкладыВходящиеВРаспределительныеСети.Номенклатура = Т.Номенклатура
	|		 И СкладыВходящиеВРаспределительныеСети.Характеристика = Т.Характеристика
	|		 И СкладыВходящиеВРаспределительныеСети.Склад = Т.Склад
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТопологияСкладов КАК ТопологияСкладовЭтоЦентр
	|		ПО ТопологияСкладовЭтоЦентр.Номенклатура   = Т.Номенклатура
	|		 И ТопологияСкладовЭтоЦентр.Характеристика = Т.Характеристика
	|		 И ТопологияСкладовЭтоЦентр.Склад = Т.Склад
	|		 И ТопологияСкладовЭтоЦентр.Центр = Т.Склад
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтДанныеЗаполненияЗаказаПоставщику КАК ДанныеЗаполнения
	|		ПО Т.Номенклатура    = ДанныеЗаполнения.Номенклатура
	|		 И Т.Характеристика  = ДанныеЗаполнения.Характеристика
	|		 И Т.Склад           = ДанныеЗаполнения.Склад
	|		 И ЕСТЬNULL(Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка), ИСТИНА)
	|		 И Т.СпособОбеспечения.ИсточникОбеспеченияПотребностей.Ссылка ЕСТЬ NULL
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныПоставщиков КАК ЦеныПоставщиков
	|		ПО Т.Номенклатура       = ЦеныПоставщиков.Номенклатура
	|			И Т.Характеристика  = ЦеныПоставщиков.Характеристика
	|			И ЕСТЬNULL(ДанныеЗаполнения.ВидЦеныПоставщика,
	|				ВЫБОР
	|					КОГДА ЕСТЬNULL(Т.СпособОбеспечения.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
	|							<> ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка)
	|						ТОГДА Т.СпособОбеспечения.ВидЦеныПоставщика
	|					ИНАЧЕ ЕСТЬNULL(Т.СпособОбеспечения.Соглашение.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
	|				КОНЕЦ) = ЦеныПоставщиков.ВидЦеныПоставщика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО ЦеныПоставщиков.Валюта = КурсыВалют.Валюта
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютаСоглашения
	|		ПО ЕСТЬNULL(ДанныеЗаполнения.Валюта, Т.СпособОбеспечения.Соглашение.Валюта) = КурсВалютаСоглашения.Валюта
	|
	//++ НЕ УТКА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ДокументЭтап
	|		ПО ДокументЭтап.Ссылка = Т.Заказ
	//-- НЕ УТКА
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	|		ПО &ПодстановкаТоварногоОграничения
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК УпаковкиЗаказа
	|		ПО &ПодстановкаУпаковкиЗаказа
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	|		ПО УпаковкиЗаказа.УпаковкаЗаказа = СпрУпаковки.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК ЗаказыРеестра
	|		ПО ЗаказыРеестра.Ссылка = Т.Заказ
	|		 И НЕ ЗаказыРеестра.ДополнительнаяЗапись
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВариантУпорядочиванияПотребностейПоЗаказамДляОбеспечения КАК УпорядочиваниеПоДатеДокумента
	|		ПО УпорядочиваниеПоДатеДокумента.Значение = ЗНАЧЕНИЕ(Перечисление.ВариантыУпорядочиванияПотребностейПоЗаказамДляОбеспечения.ПриоритетИДатаДокумента)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапретЗакупкиПоАссортименту КАК ЗапретЗакупкиПоАссортименту
	|		ПО ЗапретЗакупкиПоАссортименту.Склад = Т.Склад
	|		 И ЗапретЗакупкиПоАссортименту.Номенклатура = Т.Номенклатура
	|		 И ЗапретЗакупкиПоАссортименту.ДатаВозможнойПоставки = ЕСТЬNULL(ТаблицаСпособовОбеспечения.ДатаПоставки, &НачалоТекущегоДня)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&НачалоТекущегоДня) КАК СтавкиНДСНоменклатурыСтраныРегистрации
	|		ПО Т.Номенклатура = СтавкиНДСНоменклатурыСтраныРегистрации.Номенклатура
	|		 И Т.СпособОбеспечения.Организация.СтранаРегистрации = СтавкиНДСНоменклатурыСтраныРегистрации.Страна
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&НачалоТекущегоДня) КАК ОсновныеСтавкиНДССтраныРегистрации
	|		ПО Т.СпособОбеспечения.Организация.СтранаРегистрации = ОсновныеСтавкиНДССтраныРегистрации.Страна
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&НачалоТекущегоДня, Страна = &ОсновнаяСтрана ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
	|		ПО Т.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&НачалоТекущегоДня, Страна = &ОсновнаяСтрана) КАК ОсновныеСтавкиНДС
	|		ПО (ИСТИНА)
	//++ НЕ УТКА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводствоДляСортировки
	|		ПО ЗаказНаПроизводствоДляСортировки.Ссылка = Т.Заказ
	//-- НЕ УТКА
	|
	|ГДЕ
	|	ВЫБОР
	|		КОГДА Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
	|			ТОГДА
	|				ЕСТЬNULL(&ФОЗаказыНаПеремещенияВключена И НЕ Т.Склад.ЦеховаяКладовая
	|							ИЛИ &ФОПроизводство2_2Включена И Т.Склад.ЦеховаяКладовая, ЛОЖЬ)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|		И ЗапретЗакупкиПоАссортименту.Склад ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование,
	|	ХарактеристикаНаименование,
	|	СкладНаименование,
	|	НазначениеНаименование,
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Назначение,
	|	ПриоритетРеквизитДопУпорядочивания,
	//++ НЕ УТКА
	|	ВЫБОР КОГДА НЕ ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЗаказНаПроизводство2_2) ТОГДА
	|		0
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ,
	|	ВЫБОР КОГДА НЕ ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЗаказНаПроизводство2_2) ТОГДА
	|		0
	|	ИНАЧЕ
	|		ЗаказНаПроизводствоДляСортировки.Подразделение.РеквизитДопУпорядочивания
	|	КОНЕЦ,
	|	ВЫБОР КОГДА НЕ ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЗаказНаПроизводство2_2) ТОГДА
	|		0
	|	ИНАЧЕ
	|		ЗаказНаПроизводствоДляСортировки.Очередь
	|	КОНЕЦ,
	//-- НЕ УТКА
	|	ПорядокСортировки,
	|	ДатаДокументаИБ,
	|	ПорядокПоДатеОтгрузкиПослеДатыДокумента,
	|	Заказ";

	Если ИспользоватьКонтрольКачества Тогда

		Текст = СтрЗаменить(Текст, "ВтТовары", "ВтТоварыСУчетомКонтроляКачества");
		Текст = СтрЗаменить(Текст, "&ДатаОтгрузкиСУчетомСрокаКонтроляКачества", "Т.ДатаОтгрузкиМинусСрокКонтроляКачества");

	Иначе

		Текст = СтрЗаменить(Текст, "&ДатаОтгрузкиСУчетомСрокаКонтроляКачества", "Т.ДатаОтгрузки");

	КонецЕсли;

	Текст = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединение(Текст,
	"ПодстановкаТоварногоОграничения");
	Текст = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединениеДляУпаковкиЗаказа(Текст,
	"ПодстановкаУпаковкиЗаказа");
	Текст = СтрЗаменить(Текст, "&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"Т.Номенклатура.ЕдиницаИзмерения",
	"Т.Номенклатура"));

	Текст = СтрЗаменить(Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныПоставщиков.Упаковка",
	"ЦеныПоставщиков.Номенклатура"));

	ПроверкаЭтапаТекст = "ЛОЖЬ";
	ДатаЗаказаНаПроизводствоТекст = "ДАТАВРЕМЯ(1, 1, 1)";
	//++ НЕ УТКА
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЭтапПроизводства2_2)
		И ПравоДоступа("Чтение", Метаданные.Документы.ЗаказНаПроизводство2_2)
		И Не Параметры.ТипОтбора = "ОтборПоЗначениям" Тогда

		ПроверкаЭтапаТекст = "ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)";
		ДатаЗаказаНаПроизводствоТекст = "ВЫРАЗИТЬ(Т.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение.Дата";

	КонецЕсли;
	//-- НЕ УТКА
	Текст = СтрЗаменить(Текст, "&ПроверкаЭтапаСУчетомПравПереопределяемый", ПроверкаЭтапаТекст);
	Текст = СтрЗаменить(Текст, "&ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый", ДатаЗаказаНаПроизводствоТекст);

	ТекстыЗапросов.Добавить(Текст);
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня);
	Запрос.УстановитьПараметр("ОсновнаяСтрана", ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана());
	Запрос.УстановитьПараметр("КонецТекущегоДня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ФормироватьЗаявкиНаЗакупку", Параметры.ФормироватьЗаявкиНаЗакупку);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	КурсВалютыУпрУчета = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), НачалоДня);
	КоэффициентВалютыУпрУчета = КурсВалютыУпрУчета.КурсЧислитель / КурсВалютыУпрУчета.КурсЗнаменатель;
	Запрос.УстановитьПараметр("КоэффициентВалютыУпрУчета", КоэффициентВалютыУпрУчета);
	Запрос.УстановитьПараметр("ФОЗаказыНаПеремещенияВключена",
	ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение"));
	Запрос.УстановитьПараметр("ФОПроизводство2_2Включена",
	ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));

	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();

	Если Параметры.ТипОтбора = "ОтборПоЗначениям" Тогда
		Таблица.Колонки.Удалить("ОбеспечиваетсяИзРаспределительногоЦентра");
	КонецЕсли;

	Если Параметры.ТипОтбора <> "ОтборПоЗначениям" Тогда

		Поля = "Номенклатура,Характеристика,Склад,КЗаказу";
		ТаблицаЗапасы = Параметры.ТаблицаЗапасы.Скопировать(Новый Структура("Отметка", Истина), Поля);
		Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);

		ТекстыЗапросов = Новый Массив();

		Текст =
		"ВЫБРАТЬ
		|	Запасы.Номенклатура   КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Склад          КАК Склад,
		|	Запасы.КЗаказу        КАК КЗаказу
		|ПОМЕСТИТЬ ВтЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК Запасы
		|ГДЕ
		|	Запасы.КЗаказу > 0";

		ТекстыЗапросов.Добавить(Текст);

		ТекстыЗапросов.Добавить(РегистрыСведений.СхемыОбеспечения.ВременнаяТаблицаРазличныеТоварыИСклады("ТоварыИСкладыПопавшиеВОбработку", Истина));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаПеремещенияВнутриСети("РазличныеТоварыИСклады", Истина));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаСвободныеОстатки(Истина));

		//++ НЕ УТКА

		ТекстыЗапросов.Добавить(ВременнаяТаблицаГрафикПроизводства("ТоварыИСкладыПопавшиеВОбработку"));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаПолуфабрикатыКЗапускуВПроизводство("ТоварыИСкладыПопавшиеВОбработку"));

		//-- НЕ УТКА

		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Товары.Склад) = ТИП(Справочник.Склады)
		|			ТОГДА Товары.Склад
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|	КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Товары.Склад) = ТИП(Справочник.СтруктураПредприятия)
		|			ТОГДА Товары.Склад
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК ПодразделениеПолучатель,
		|	
		|	Товары.Назначение КАК Назначение,
		|	
		|	ВЫБОР
		|		КОГДА НастройкаПоддержанияЗапаса.ОбеспечениеЗаказовПриПоддержанииЗапаса ЕСТЬ NULL
		|				ИЛИ НастройкаПоддержанияЗапаса.ОбеспечениеЗаказовПриПоддержанииЗапаса
		|					= ЗНАЧЕНИЕ(Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов)
		|			ТОГДА ЕСТЬNULL(Запасы.КЗаказу, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ
		//++ НЕ УТКА
		|		+ ЕСТЬNULL(ГрафикПроизводства.Количество, 0)
		|		+ ЕСТЬNULL(ОборотыПолуфабрикатов.Количество, 0)
		//-- НЕ УТКА
		|		+ ЕСТЬNULL(Остатки.РаспределитьНаЗаказы, 0) КАК КРезервированию
		|ИЗ
		|	ТоварыИСкладыПопавшиеВОбработку КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстатки КАК Остатки
		|		ПО Остатки.Номенклатура = Товары.Номенклатура
		|		 И Остатки.Характеристика = Товары.Характеристика
		|		 И Остатки.Склад = Товары.Склад
		|		 И Остатки.Назначение = Товары.Назначение
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗапасы КАК Запасы
		|		ПО Запасы.Номенклатура = Товары.Номенклатура
		|		 И Запасы.Характеристика = Товары.Характеристика
		|		 И Запасы.Склад = Товары.Склад
		|		 И Товары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		

		//++ НЕ УТКА

		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикПроизводства КАК ГрафикПроизводства
		|		ПО ГрафикПроизводства.Номенклатура = Товары.Номенклатура
		|		 И ГрафикПроизводства.Характеристика = Товары.Характеристика
		|		 И ГрафикПроизводства.Склад = Товары.Склад
		|		 И ГрафикПроизводства.Назначение = Товары.Назначение
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПолуфабрикатов КАК ОборотыПолуфабрикатов
		|		ПО ОборотыПолуфабрикатов.Номенклатура = Товары.Номенклатура
		|		 И ОборотыПолуфабрикатов.Характеристика = Товары.Характеристика
		|		 И ОборотыПолуфабрикатов.Склад = Товары.Склад
		|		 И ОборотыПолуфабрикатов.Назначение = Товары.Назначение

		//-- НЕ УТКА

		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаПоддержанияЗапаса
		|		ПО &ПодстановкаТоварногоОграничения";
		ТекстыЗапросов.Добавить(Текст);

		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.Текст = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединение(Запрос.Текст, "ПодстановкаТоварногоОграничения", 
		"Товары.Номенклатура,Товары.Характеристика,Товары.Склад", "НастройкаПоддержанияЗапаса");

		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаОстатки = РезультатЗапроса.Выгрузить();
		ТаблицаОстатки.Индексы.Добавить("Номенклатура, Характеристика, Склад, ПодразделениеПолучатель, Назначение");

		ТаблицаОстатковНаВсехСкладах = Новый ТаблицаЗначений();
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("Номенклатура");
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("Характеристика");
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("Назначение");
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("КРезервированию");

		Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПеремещениемОбособленныхТоваров")
			И Параметры.РасчетОбособленныхПотребностейСУчетомОстатковНаВсехСкладах Тогда

			УстановитьПривилегированныйРежим(Истина);

			Тексты = Новый Массив();

			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Фильтр.Номенклатура КАК Номенклатура,
			|	Фильтр.Характеристика КАК Характеристика,
			|	Фильтр.Назначение КАК Назначение
			|ПОМЕСТИТЬ ОтборТоваров
			|ИЗ
			|	РазличныеТоварыИСклады КАК Фильтр
			|ГДЕ
			|	Фильтр.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Назначение
			|;
			|
			|//////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запасы.Номенклатура КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	НЕОПРЕДЕЛЕНО КАК Склад,
			|	Запасы.Назначение КАК Назначение,
			|	Запасы.ВНаличииОстаток КАК ВНаличииОстаток,
			|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
			|	Запасы.ЗаказаноОстаток КАК ЗаказаноОстаток,
			|	Запасы.ПоступитОстаток КАК ПоступитОстаток,
			|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
			|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
			|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
			|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
			|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
			|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
			|ПОМЕСТИТЬ ЗапасыИПотребностиОстатки
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		(Номенклатура, Характеристика, Назначение) В(
			|			ВЫБРАТЬ
			|				Фильтр.Номенклатура КАК Номенклатура,
			|				Фильтр.Характеристика КАК Характеристика,
			|				Фильтр.Назначение КАК Назначение
			|			ИЗ
			|				ОтборТоваров КАК Фильтр)) КАК Запасы
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|//////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запасы.Номенклатура КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	НЕОПРЕДЕЛЕНО КАК Склад,
			|	Запасы.Назначение КАК Назначение,
			|	Запасы.Заказ КАК Заказ,
			|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
			|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
			|	Запасы.КРазблокировкеОстаток КАК КРазблокировкеОстаток,
			|	Запасы.РезервироватьНаСкладеИзЗаблокированныхОстаток КАК РезервироватьНаСкладеИзЗаблокированныхОстаток,
			|	Запасы.РезервироватьПоМереПоступленияИзЗаблокированныхОстаток КАК РезервироватьПоМереПоступленияИзЗаблокированныхОстаток
			|	
			|ПОМЕСТИТЬ ЗапасыИПотребностиОстаткиКонтролируемыхПартий
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		(Номенклатура, Характеристика, Назначение) В(
			|			ВЫБРАТЬ
			|				Фильтр.Номенклатура КАК Номенклатура,
			|				Фильтр.Характеристика КАК Характеристика,
			|				Фильтр.Назначение КАК Назначение
			|			ИЗ
			|				ОтборТоваров КАК Фильтр)) КАК Запасы
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|//////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Расчет.Номенклатура КАК Номенклатура,
			|	Расчет.Характеристика КАК Характеристика,
			|	Расчет.Назначение КАК Назначение,
			|	Расчет.ВНаличии_Излишек
			|		+ Расчет.ВНаличии_Резервировать
			|		+ Расчет.ВНаличии_РезервироватьПоМере
			|		+ Расчет.ВНаличии_Отложить
			|		+ Расчет.ВНаличии_КОбеспечению
			|		+ Расчет.ВНаличииСБлокировкой_Излишек
			|		+ Расчет.ВНаличииСБлокировкой_РезервироватьПоМере
			|		+ Расчет.ВНаличииСБлокировкой_Отложить
			|		+ Расчет.ВНаличииСБлокировкой_КОбеспечению
			|		+ Расчет.Ожидается
			|		+ Расчет.ОжидаетсяСБлокировкой_Излишек
			|		+ Расчет.ОжидаетсяСБлокировкой_РезервироватьПоМере
			|		+ Расчет.ОжидаетсяСБлокировкой_Отложить
			|		+ Расчет.ОжидаетсяСБлокировкой_КОбеспечению
			|		+ Расчет.НаСогласовании КАК Запас,
			|	Расчет.Резервировать
			|		+ Расчет.РезервироватьПоМере
			|		+ Расчет.КОбеспечению КАК Потребность
			|ПОМЕСТИТЬ ЗапасыИПотребности
			|ИЗ
			|	РасчетРаспределенияЗапасов КАК Расчет
			|;
			|
			|////////////////////////////////////
			|УНИЧТОЖИТЬ ЗапасыИПотребностиОстатки
			|;
			|
			|////////////////////////////////////
			|УНИЧТОЖИТЬ ЗапасыИПотребностиОстаткиКонтролируемыхПартий";

			ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРаспределенияЗапасов();
			ИменаТаблиц.Остатки = "ЗапасыИПотребностиОстатки"; // @query-part-1
			ИменаТаблиц.ОстаткиКонтролируемыхПартий = "ЗапасыИПотребностиОстаткиКонтролируемыхПартий"; // @query-part-1
			ИменаТаблиц.Результат = "РасчетРаспределенияЗапасов"; // @query-part-1

			ОбеспечениеВДокументахСервер.РаспределениеЗапасов(ТекстЗапроса, ИменаТаблиц);

			Тексты.Добавить(ТекстЗапроса);

			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Запасы.Номенклатура КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	Запасы.Склад КАК Склад,
			|	Запасы.Назначение КАК Назначение,
			|	Запасы.ВНаличииОстаток КАК ВНаличииОстаток,
			|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
			|	Запасы.ЗаказаноОстаток КАК ЗаказаноОстаток,
			|	Запасы.ПоступитОстаток КАК ПоступитОстаток,
			|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
			|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
			|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
			|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
			|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
			|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
			|ПОМЕСТИТЬ ЗапасыИПотребностиОстатки
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		(Номенклатура, Характеристика, Склад, Назначение) В(
			|			ВЫБРАТЬ
			|				Фильтр.Номенклатура КАК Номенклатура,
			|				Фильтр.Характеристика КАК Характеристика,
			|				Фильтр.Склад КАК Склад,
			|				Фильтр.Назначение КАК Назначение
			|			ИЗ
			|				РазличныеТоварыИСклады КАК Фильтр
			|			ГДЕ
			|				Фильтр.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))) КАК Запасы
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|//////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запасы.Номенклатура КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	Запасы.Склад КАК Склад,
			|	Запасы.Назначение КАК Назначение,
			|	Запасы.Заказ КАК Заказ,
			|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
			|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
			|	Запасы.КРазблокировкеОстаток КАК КРазблокировкеОстаток,
			|	Запасы.РезервироватьНаСкладеИзЗаблокированныхОстаток КАК РезервироватьНаСкладеИзЗаблокированныхОстаток,
			|	Запасы.РезервироватьПоМереПоступленияИзЗаблокированныхОстаток КАК РезервироватьПоМереПоступленияИзЗаблокированныхОстаток
			|	
			|ПОМЕСТИТЬ ЗапасыИПотребностиОстаткиКонтролируемыхПартий
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		(Номенклатура, Характеристика, Склад, Назначение) В(
			|			ВЫБРАТЬ
			|				Фильтр.Номенклатура КАК Номенклатура,
			|				Фильтр.Характеристика КАК Характеристика,
			|				Фильтр.Склад КАК Склад,
			|				Фильтр.Назначение КАК Назначение
			|			ИЗ
			|				РазличныеТоварыИСклады КАК Фильтр
			|			ГДЕ
			|				Фильтр.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))) КАК Запасы
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|//////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Расчет.Номенклатура КАК Номенклатура,
			|	Расчет.Характеристика КАК Характеристика,
			|	Расчет.Склад КАК Склад,
			|	Расчет.Назначение КАК Назначение,
			|	Расчет.Резервировать КАК РезервироватьНаСкладе,
			|	Расчет.Резервировать
			|		+ Расчет.РезервироватьПоМере
			|		+ Расчет.КОбеспечению КАК Потребность
			|ПОМЕСТИТЬ ПотребностиПопавшиеВОбработку
			|ИЗ
			|	РасчетРаспределенияЗапасов КАК Расчет
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Назначение, Склад
			|;
			|
			|/////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ЗапасыИПотребностиОстатки
			|;
			|
			|/////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ЗапасыИПотребностиОстаткиКонтролируемыхПартий";

			ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРаспределенияЗапасов();
			ИменаТаблиц.Остатки = "ЗапасыИПотребностиОстатки"; // @query-part-1
			ИменаТаблиц.ОстаткиКонтролируемыхПартий = "ЗапасыИПотребностиОстаткиКонтролируемыхПартий"; // @query-part-1
			ИменаТаблиц.Сторно = "ПеремещенияВнутриСети"; // @query-part-1
			ИменаТаблиц.Результат = "РасчетРаспределенияЗапасов"; // @query-part-1

			ОбеспечениеВДокументахСервер.РаспределениеЗапасов(ТекстЗапроса, ИменаТаблиц);

			Тексты.Добавить(ТекстЗапроса);

			//++ НЕ УТКА
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	СУММА(Набор.Запас) КАК Запас,
			|	СУММА(Набор.Потребность) КАК Потребность
			|ПОМЕСТИТЬ ЗапасыИПотребностиДинамические
			|ИЗ(
			|	ВЫБРАТЬ
			|		Движения.Номенклатура КАК Номенклатура,
			|		Движения.Характеристика КАК Характеристика,
			|		Движения.Склад КАК Склад,
			|		Движения.Назначение КАК Назначение,
			|		Движения.Запланировано КАК Запас,
			|		0 КАК Потребность
			|	ИЗ
			|		РегистрСведений.СтруктураЗаказа КАК Движения
			|	ГДЕ
			|		Движения.ВидСтроки <> ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции)
			|			И ИСТИНА В(
			|				ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА КАК ЕстьЗаписи
			|				ИЗ
			|					РазличныеТоварыИСклады КАК Фильтр
			|				ГДЕ
			|					Фильтр.Номенклатура = Движения.Номенклатура
			|					И Фильтр.Характеристика = Движения.Характеристика
			|					И Фильтр.Назначение = Движения.Назначение)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Движения.Номенклатура КАК Номенклатура,
			|		Движения.Характеристика КАК Характеристика,
			|		Движения.Склад КАК Склад,
			|		Движения.Назначение КАК Назначение,
			|		0 КАК Запас,
			|		Движения.КОбеспечению - Движения.Заменено - Движения.РаспределеноИзЗапасовОбособленно - Движения.РаспределеноИзПартийОбособленно КАК Потребность
			|	ИЗ
			|		РегистрСведений.СтруктураЗаказа КАК Движения
			|	ГДЕ
			|		Движения.ВидСтроки НЕ В(
			|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
			|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
			|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
			|			И ИСТИНА В(
			|				ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА КАК ЕстьЗаписи
			|				ИЗ
			|					РазличныеТоварыИСклады КАК Фильтр
			|				ГДЕ
			|					Фильтр.Номенклатура = Движения.Номенклатура
			|					И Фильтр.Характеристика = Движения.Характеристика
			|					И Фильтр.Назначение = Движения.Назначение)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Движения.Номенклатура КАК Номенклатура,
			|		Движения.Характеристика КАК Характеристика,
			|		Движения.Склад КАК Склад,
			|		Движения.НазначениеСтруктуры КАК Назначение,
			|		0 КАК Запас,
			|		Движения.РаспределеноИзЗапасовОбособленно + Движения.РаспределеноИзПартийОбособленно КАК Потребность
			|	ИЗ
			|		РегистрСведений.СтруктураЗаказа КАК Движения
			|	ГДЕ
			|		Движения.ВидСтроки НЕ В(
			|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
			|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
			|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
			|			И ИСТИНА В(
			|				ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА КАК ЕстьЗаписи
			|				ИЗ
			|					РазличныеТоварыИСклады КАК Фильтр
			|				ГДЕ
			|					Фильтр.Номенклатура = Движения.Номенклатура
			|					И Фильтр.Характеристика = Движения.Характеристика
			|					И Фильтр.Назначение = Движения.Назначение)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение
			|ИМЕЮЩИЕ
			|	СУММА(Набор.Запас) > 0 ИЛИ СУММА(Набор.Потребность) > 0
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
			Тексты.Добавить(ТекстЗапроса);
			//-- НЕ УТКА

			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Назначение КАК Назначение,
			|	СУММА(Набор.Запас) КАК КРезервированию
			|ИЗ(
			// Излишки.
			|	ВЫБРАТЬ
			|		Запасы.Номенклатура КАК Номенклатура,
			|		Запасы.Характеристика КАК Характеристика,
			|		Запасы.Назначение КАК Назначение,
			|		Запасы.Запас - Запасы.Потребность КАК Запас
			|	ИЗ
			|		ЗапасыИПотребности КАК Запасы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			// Сторно потребностей попавших в обработку.
			|	ВЫБРАТЬ
			|		Запасы.Номенклатура КАК Номенклатура,
			|		Запасы.Характеристика КАК Характеристика,
			|		Запасы.Назначение КАК Назначение,
			|		Запасы.Потребность
			// Потребности, склад которых попал в обработку и обеспечивается в том числе за счет излишка,
			// но считается обеспеченным автоматически, так как сама потребность в обработке не отображается.
			|			- Запасы.РезервироватьНаСкладе КАК Запас
			|	ИЗ
			|		ПотребностиПопавшиеВОбработку КАК Запасы
			// Если в обработку попал удаленный склад, но не попал распрепделительный центр, то
			// для задачи излишка такая потребность не сторнируется в запасе,
			// так как запас должен распределиться на центр, который в обработке не отображатся
			|	ГДЕ
			|		НЕ ИСТИНА В(
			|			ВЫБРАТЬ ПЕРВЫЕ 1
			|				ИСТИНА КАК ЕстьЗаписи
			|			ИЗ
			|				ТопологияСкладов КАК Фильтр
			|					
			|					ЛЕВОЕ СОЕДИНЕНИЕ РазличныеТоварыИСклады КАК Центры
			|					ПО Центры.Номенклатура = Фильтр.Номенклатура
			|					 И Центры.Характеристика = Фильтр.Характеристика
			|					 И Центры.Склад = Фильтр.Центр
			|					 И Центры.Назначение = Запасы.Назначение
			|			ГДЕ
			|				Фильтр.Номенклатура = Запасы.Номенклатура
			|					И Фильтр.Характеристика = Запасы.Характеристика
			|					И Фильтр.Склад = Запасы.Склад
			|					И Фильтр.Центр <> Запасы.Склад
			|					И Центры.Склад ЕСТЬ NULL)
			|	

			//++ НЕ УТКА

			|	ОБЪЕДИНИТЬ ВСЕ
			|
			// Излишки динамической структуры заказа.
			|	ВЫБРАТЬ
			|		Запасы.Номенклатура КАК Номенклатура,
			|		Запасы.Характеристика КАК Характеристика,
			|		Запасы.Назначение КАК Назначение,
			|		Запасы.Запас - Запасы.Потребность КАК Запас
			|	ИЗ
			|		ЗапасыИПотребностиДинамические КАК Запасы
			|		
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			// Сторно потребностей динамической структуры попавших в обработку.
			|	ВЫБРАТЬ
			|		Запасы.Номенклатура КАК Номенклатура,
			|		Запасы.Характеристика КАК Характеристика,
			|		Запасы.Назначение КАК Назначение,
			|		Запасы.Потребность КАК Запас
			|	ИЗ
			|		ЗапасыИПотребностиДинамические КАК Запасы
			|	ГДЕ
			|		ИСТИНА В(
			|			ВЫБРАТЬ ПЕРВЫЕ 1
			|				ИСТИНА КАК ЕстьЗаписи
			|			ИЗ
			|				РазличныеТоварыИСклады КАК Фильтр
			|			ГДЕ
			|				Фильтр.Номенклатура = Запасы.Номенклатура
			|					И Фильтр.Характеристика = Запасы.Характеристика
			|					И Фильтр.Склад = Запасы.Склад
			|					И Фильтр.Назначение = Запасы.Назначение)
			// Если в обработку попал удаленный склад, но не попал распрепделительный центр, то
			// для задачи излишка такая потребность не сторнируется в запасе,
			// так как запас должен распределиться на центр, который в обработке не отображатся
			|		И НЕ ИСТИНА В(
			|			ВЫБРАТЬ ПЕРВЫЕ 1
			|				ИСТИНА КАК ЕстьЗаписи
			|			ИЗ
			|				ТопологияСкладов КАК Фильтр
			|					
			|					ЛЕВОЕ СОЕДИНЕНИЕ РазличныеТоварыИСклады КАК Центры
			|					ПО Центры.Номенклатура = Фильтр.Номенклатура
			|					 И Центры.Характеристика = Фильтр.Характеристика
			|					 И Центры.Склад = Фильтр.Центр
			|					 И Центры.Назначение = Запасы.Назначение
			|			ГДЕ
			|				Фильтр.Номенклатура = Запасы.Номенклатура
			|					И Фильтр.Характеристика = Запасы.Характеристика
			|					И Фильтр.Склад = Запасы.Склад
			|					И Фильтр.Центр <> Запасы.Склад
			|					И Центры.Склад ЕСТЬ NULL)

			//-- НЕ УТКА

			|) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Назначение
			|ИМЕЮЩИЕ
			|	СУММА(Набор.Запас) > 0";
			Тексты.Добавить(ТекстЗапроса);
			Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
			ТаблицаОстатковНаВсехСкладах = Запрос.Выполнить().Выгрузить();
			ТаблицаОстатковНаВсехСкладах.Индексы.Добавить("Номенклатура, Характеристика, Назначение");

		КонецЕсли;

		// Расчет количества к резервированию с текущего склада.
		Отбор = Новый Структура("Номенклатура, Характеристика, Склад, Назначение, ПодразделениеПолучатель");
		ОтборОстатковВсехСкладов = Новый Структура("Номенклатура, Характеристика, Назначение");

		Для Каждого СтрокаЗаказы Из Таблица Цикл

			ЗаполнитьЗначенияСвойств(Отбор, СтрокаЗаказы);
			ЗаполнитьЗначенияСвойств(ОтборОстатковВсехСкладов, СтрокаЗаказы);
			СтрокиОстатков = ТаблицаОстатки.НайтиСтроки(Отбор);

			Если СтрокиОстатков.Количество() > 0 Тогда
				НайденнаяСтрока = СтрокиОстатков[0];
				НайденнаяСтрока.КРезервированию = Макс(0, НайденнаяСтрока.КРезервированию - СтрокаЗаказы.КРезервированию);
			КонецЕсли;

			Если ЗначениеЗаполнено(СтрокаЗаказы.Назначение)
				И Не СтрокаЗаказы.ЭтоРабота
				И Не СтрокаЗаказы.ОбеспечиваетсяИзРаспределительногоЦентра Тогда // истина, только для удаленного склада

				НайденныеСтроки = ТаблицаОстатковНаВсехСкладах.НайтиСтроки(ОтборОстатковВсехСкладов);
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденныеСтроки[0].КРезервированию = Макс(0, НайденныеСтроки[0].КРезервированию - СтрокаЗаказы.КРезервированию);
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		Для Каждого СтрокаЗаказы Из Таблица Цикл

			ЗаполнитьЗначенияСвойств(Отбор, СтрокаЗаказы);
			ЗаполнитьЗначенияСвойств(ОтборОстатковВсехСкладов, СтрокаЗаказы);
			СтрокиОстатков = ТаблицаОстатки.НайтиСтроки(Отбор);

			КРезервированию = 0;
			Если СтрокиОстатков.Количество() > 0 Тогда

				НайденнаяСтрока = СтрокиОстатков[0];
				КРезервированию = Макс(0, Мин(НайденнаяСтрока.КРезервированию, СтрокаЗаказы.Требуется - СтрокаЗаказы.КРезервированию));
				СтрокаЗаказы.КРезервированию = СтрокаЗаказы.КРезервированию + КРезервированию;
				НайденнаяСтрока.КРезервированию = НайденнаяСтрока.КРезервированию - КРезервированию;

			КонецЕсли;

			Если ЗначениеЗаполнено(СтрокаЗаказы.Назначение)
				И Не СтрокаЗаказы.ЭтоРабота
				И Не СтрокаЗаказы.ОбеспечиваетсяИзРаспределительногоЦентра Тогда

				НайденныеСтроки = ТаблицаОстатковНаВсехСкладах.НайтиСтроки(ОтборОстатковВсехСкладов);
				Если НайденныеСтроки.Количество() > 0 Тогда
					КРезервированиюПоТовару = Мин(НайденныеСтроки[0].КРезервированию, КРезервированию);
					НайденныеСтроки[0].КРезервированию = НайденныеСтроки[0].КРезервированию - КРезервированиюПоТовару;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		// Дообеспечение товарами с других складов.
		Для Каждого СтрокаЗаказы Из Таблица Цикл

			Если ЗначениеЗаполнено(СтрокаЗаказы.Назначение)

				И Не СтрокаЗаказы.ЭтоРабота
				И Не СтрокаЗаказы.ОбеспечиваетсяИзРаспределительногоЦентра Тогда

				ЗаполнитьЗначенияСвойств(ОтборОстатковВсехСкладов, СтрокаЗаказы);
				НайденныеСтроки = ТаблицаОстатковНаВсехСкладах.НайтиСтроки(ОтборОстатковВсехСкладов);
				Если НайденныеСтроки.Количество() > 0 Тогда
					КРезервированию = Макс(0, Мин(НайденныеСтроки[0].КРезервированию, СтрокаЗаказы.Требуется - СтрокаЗаказы.КРезервированию));
					НайденныеСтроки[0].КРезервированию = НайденныеСтроки[0].КРезервированию - КРезервированию;
					СтрокаЗаказы.КРезервированию = СтрокаЗаказы.КРезервированию + КРезервированию;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(Таблица, АдресРезультата);

КонецПроцедуры

&ИзменениеИКонтроль("ТаблицаСпособовОбеспечения")
Процедура юум_ТаблицаСпособовОбеспечения(Параметры, АдресРезультата)

	Если Параметры.СпособОбеспечения = Неопределено Тогда
		СхемаКомпоновкиДанных = Обработки.ОбеспечениеПотребностей.ПолучитьМакет("МакетКомпоновкиДляСерверныхОтборов");
		#Вставка
		// #юум {
		// #ЧТЗ 03.01 Управление закупками
		// Галфинд Садомцев 2026/09/18        	
		// Проверяем флажок ""Включать материалы по требованию""
		юум_ВключатьМатериалыПоТребованию = Неопределено;
		Параметры.Свойство("юум_ВключатьМатериалыПоТребованию", юум_ВключатьМатериалыПоТребованию);
		Если ТипЗнч(юум_ВключатьМатериалыПоТребованию) = Тип("Булево")
			И юум_ВключатьМатериалыПоТребованию Тогда
			// здесь надо дополнить текст запроса номенклатурой " по требованию"
			СхемаКомпоновкиДанных.НаборыДанных.Набор.Запрос = юум_ВременнаяТаблицаСпособовОбеспеченияПоТребованию(
				Параметры.ТоварыПоддерживаемогоЗапаса,
				Параметры.КлючНазначенияИспользования);
		Иначе
		// здесь типовой код
		// } #юум
		#КонецВставки
		СхемаКомпоновкиДанных.НаборыДанных.Набор.Запрос = ВременнаяТаблицаСпособовОбеспечения(
		Параметры.ТоварыПоддерживаемогоЗапаса,
		Параметры.КлючНазначенияИспользования);
		#Вставка
		КонецЕсли;
		#КонецВставки
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);

		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);

		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

		Запрос = ПолучитьЗапросСОтборамиКомпоновкиДанных(АдресСхемыКомпоновкиДанных, КомпоновщикНастроек, "Набор");
		УдалитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		НачалоДня = НачалоДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня);
		Запрос.УстановитьПараметр("ДоступныеТипыОбеспечения", 
		ДоступныеТипыОбеспечения(Параметры.КлючНазначенияИспользования));
		Запрос.УстановитьПараметр("ФОЗаказыНаПеремещенияВключена",
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение"));
		Запрос.УстановитьПараметр("ФОПроизводство2_2Включена",
		ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));
		Запрос.УстановитьПараметр("ОптимизироватьЗапасыРаспределительногоЦентра",
		Константы.ОптимизироватьЗапасыРаспределительногоЦентра.Получить());

		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

		// Отделим часть запроса, которую необходимо выполнить привилегированно
		ПозицияУдаления = СтрНайти(Запрос.Текст, "УНИЧТОЖИТЬ ВтФорматыСкладов");
		Позиция = СтрНайти(Запрос.Текст, ";", НаправлениеПоиска.СНачала, ПозицияУдаления) + 1;
		ТекстЗапросаПривилегированно = Сред(Запрос.Текст, Позиция);
		Запрос.Текст = Лев(Запрос.Текст, ПозицияУдаления - 1);
		Запрос.Выполнить();

		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ РазличнаяНоменклатура
		|ИЗ
		|	ВтПотребности КАК Таблица
		|ГДЕ
		|	&ОптимизироватьЗапасыРаспределительногоЦентра
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,Характеристика";
		Запрос.Выполнить();
		РегистрыСведений.СхемыОбеспечения.ВременнаяТаблицаТопологияСкладов(Запрос, "РазличнаяНоменклатура");

		УстановитьПривилегированныйРежим(Истина);
		Запрос.Текст = ТекстЗапросаПривилегированно;
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);

	Иначе

		НачалоДня = НачалоДня(ТекущаяДатаСеанса());
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("СпособОбеспечения", Параметры.СпособОбеспечения);
		Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня);
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&СпособОбеспечения КАК СпособОбеспечения
		|ПОМЕСТИТЬ СпособыОбеспечения";
		Запрос.Выполнить();

	КонецЕсли;
	ОбеспечениеВДокументахСервер.ВременнаяТаблицаБлижайшийЦиклПоСпособамОбеспечения(
	Запрос.МенеджерВременныхТаблиц,
	"Справочник.СпособыОбеспеченияПотребностей",
	"ТаблицаВременный");

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК СпособОбеспечения,
	|	Таблица.КЗаказуТовары КАК КЗаказуТовары,
	|	Таблица.ДатаПоставки КАК ДатаПоставки,
	|	Таблица.ГраницаПериодаОбеспечения КАК ГраницаПериодаОбеспечения,
	|	Таблица.ФормироватьЗаказыПоРасписанию КАК ФормироватьЗаказыПоРасписанию,
	|	Таблица.ДатаПоставкиПоГрафику КАК ДатаПоставкиПоГрафику,
	|	Таблица.ГраницаПериодаОбеспеченияПоГрафику КАК ГраницаПериодаОбеспеченияПоГрафику,
	|	Таблица.ДнейДоПлановогоЗаказа КАК ДнейДоПлановогоЗаказа,
	|	Таблица.ПлановаяДатаЗаказа КАК ПлановаяДатаЗаказа,
	|	Таблица.ФормироватьЗаказыПоТочкеЗаказа КАК ФормироватьЗаказыПоТочкеЗаказа,
	|	Таблица.ДатаПоставкиПоТочкеЗаказа КАК ДатаПоставкиПоТочкеЗаказа,
	|	Таблица.ГраницаПериодаОбеспеченияПоТочкеЗаказа КАК ГраницаПериодаОбеспеченияПоТочкеЗаказа,
	|	Таблица.ГрафикПоставок КАК ГрафикПоставок,
	|	Таблица.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
	// Далее поля для интерактивной работы пользователя на втором шаге.
	|	ИСТИНА КАК Отметка,
	|	ВЫРАЗИТЬ(Таблица.Ссылка КАК Справочник.СпособыОбеспеченияПотребностей).Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица.Ссылка) КАК СпособОбеспеченияПредставление,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	ТаблицаВременный КАК Таблица
	|УПОРЯДОЧИТЬ ПО
	|	Порядок, Наименование";
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("ДнейДоЗаказаПоГрафикуПредставление");

	Для Каждого СтрокаТаблицы Из Результат Цикл

		Если Не СтрокаТаблицы.ФормироватьЗаказыПоРасписанию Тогда
			СтрокаТаблицы.ДнейДоЗаказаПоГрафикуПредставление = НСтр("ru = '<только для заказа по графику>';
			|en = '<only for reorder schedule>'");
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы.ПлановаяДатаЗаказа) Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.ГрафикПоставок) Тогда
				СтрокаТаблицы.ДнейДоЗаказаПоГрафикуПредставление = НСтр("ru = '<не заполнен график поставок>';
				|en = '<delivery schedule is not filled in>'");
			Иначе
				СтрокаТаблицы.ДнейДоЗаказаПоГрафикуПредставление = НСтр("ru = '<не заполнен график работы предприятия>';
				|en = '<enterprise schedule is not filled in>'");
			КонецЕсли;
		ИначеЕсли СтрокаТаблицы.ДнейДоПлановогоЗаказа >= 0 Тогда

			СтрокаТаблицы.ДнейДоЗаказаПоГрафикуПредставление =
			СтрШаблон(НСтр("ru = '%1 дн';
			|en = '%1 days'"), СтрокаТаблицы.ДнейДоПлановогоЗаказа);
		Иначе

			СтрокаТаблицы.ДнейДоЗаказаПоГрафикуПредставление =
			СтрШаблон(НСтр("ru = 'просрочен на %1 дн';
			|en = '%1 days overdue'"), - СтрокаТаблицы.ДнейДоПлановогоЗаказа);

		КонецЕсли;

	КонецЦикла;

	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

#КонецОбласти

#КонецЕсли