//#Область ОбработчикиСобытийФормы
//&НаСервере
//Процедура юум_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
//	//юум_ИзменитьТекстЗапроса();
//КонецПроцедуры

//&НаСервере
//Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//    юум_ИзменитьТекстЗапроса();
//КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//Процедура юум_ИзменитьТекстЗапроса()   
//	//ТекстЗапроса = Список.ТекстЗапроса;
//	//ШаблонЗамены = "ПРЕДСТАВЛЕНИЕ(%1)";
//	//МассивЗаменяемых = Новый Массив;
//	//МассивЗаменяемых.Добавить("Движения.КлючПартия");
//	//
//	//Для каждого ТекстПоля Из МассивЗаменяемых Цикл
//	//	НаЧто = СтрШаблон(ШаблонЗамены, ТекстПоля);
//	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоля, НаЧто);
//	//КонецЦикла;  
//	//Список.ТекстЗапроса = ТекстЗапроса;
//	
//	СхемаЗапроса = Новый СхемаЗапроса;
//	СхемаЗапроса.УстановитьТекстЗапроса(Список.ТекстЗапроса);
//	
//	//ТекущийЗапрос = СхемаЗапроса.ПакетЗапросов[0];
//	//
//	//ОператорВыбрать = ТекущийЗапрос.Операторы[0];  
//	НомерОператора = 0;
//	СписокНовыхПолей = Новый СписокЗначений;
//	СписокНовыхПолей.Добавить("ПРЕДСТАВЛЕНИЕ(Движения.КлючПартия)", "КлючПартияСтрокой");
//	юум_СхемыЗапросов.ДобавитьПоляЗапроса(СхемаЗапроса, "", СписокНовыхПолей, , НомерОператора);

//	
//	//
//	//СоответствиеТекстПсевдоним = Новый Соответствие();
//	//СоответствиеТекстПсевдоним.Вставить("ПРЕДСТАВЛЕНИЕ(Движения.КлючПартия)", "КлючПартияСтрокой");
//	//СоответствиеТекстПсевдоним.Вставить("ПРЕДСТАВЛЕНИЕ(Движения.КлючНоменклатура)", "КлючНоменклатураСтрокой");
//	//СоответствиеТекстПсевдоним.Вставить("ПРЕДСТАВЛЕНИЕ(Движения.КлючНабор)", "КлючНаборСтрокой");
//	//
//	//СоздатьПоляЗапроса(ТекущийЗапрос, ОператорВыбрать, СоответствиеТекстПсевдоним); 
//	
//	//МассивЗаменыПолей = Новый Массив();
//	//СтруктураЗаменыПолей = юум_СхемыЗапросов.СтруктураЗаменыПолей("КлючПартия", "Движения.КлючПартия",
//	//"ПРЕДСТАВЛЕНИЕ(Движения.КлючПартия)");
//	//МассивЗаменыПолей.Добавить(СтруктураЗаменыПолей);
//	//СтруктураЗаменыПолей = юум_СхемыЗапросов.СтруктураЗаменыПолей("КлючНоменклатура", "Движения.КлючНоменклатура",
//	//"ПРЕДСТАВЛЕНИЕ(Движения.КлючНоменклатура)");
//	//МассивЗаменыПолей.Добавить(СтруктураЗаменыПолей);
//	//
//	//юум_СхемыЗапросов.ЗаменитьПоляЗапроса(СхемаЗапроса, МассивЗаменыПолей);

//	Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса(); 
//	ШаблонПуть = "Список.%1";
//	Родитель = Элементы.Список;  
//	Для Каждого элСписка Из СписокНовыхПолей Цикл  
//		ИмяПоля = элСписка.Представление;
//		Путь = СтрШаблон(ШаблонПуть, ИмяПоля);
//		ПолеСписка = Список.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//		ПолеСписка.ПутьКДанным = ИмяПоля; 
//		ПолеСписка.Поле = ИмяПоля;
//		Список.УстановитьОбязательноеИспользование(ИмяПоля, Истина);
//		юум_РаботаСФормой.СоздатьПолеФормы(Элементы, ИмяПоля, , Путь,
//			ВидПоляФормы.ПолеВвода, Родитель);
//	КонецЦикла;
//	//Для Каждого элСоответствия Из СоответствиеТекстПсевдоним Цикл  
//	//	ИмяПоля = элСоответствия.Значение;
//	//	Путь = СтрШаблон(ШаблонПуть, ИмяПоля);
//	//	Список.УстановитьОбязательноеИспользование(ИмяПоля, Истина);
//	//	ПолеСписка = Список.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//	//	//ПолеСписка.ПутьКДанным = СтрШаблон("%1.%2", Оператор.Источники[0].Источник.Псевдоним, ИмяПоля);
//	//	ПолеСписка.ПутьКДанным = Путь; 
//	//	ПолеСписка.Поле = ИмяПоля;

//	//	ПараметрыЭлемента = юум_РаботаСФормой.КонструкторПараметрыПоляФормы(ИмяПоля, Путь, ЭтотОбъект);
//	//	ПараметрыЭлемента.Родитель = Родитель;
//	//	ПараметрыЭлемента.Вид = ВидПоляФормы.ПолеНадписи;
//	//	юум_РаботаСФормой.СоздатьПолеФормыПоПараметрам(ЭтотОбъект, ПараметрыЭлемента);
//	//КонецЦикла;
//	//
//	//
//КонецПроцедуры

//Процедура СоздатьПоляЗапроса(ЗапросВыбора, ОператорВыбрать, СоответствиеТекстПсевдоним)
//	Если СоответствиеТекстПсевдоним <> Неопределено Тогда
//		Для Каждого элСоответствия Из СоответствиеТекстПсевдоним Цикл
//			юум_СхемыЗапросов.ДобавитьПолеВЗапрос(ЗапросВыбора, ОператорВыбрать, элСоответствия.Значение, элСоответствия.Ключ);
//		//Путь = СтрШаблон(ШаблонПуть, элСоответствия.Значение);

//		//	ПараметрыЭлемента = юум_РаботаСФормой.КонструкторПараметрыПоляФормы(элСоответствия.Значение, Путь, ЭтотОбъект);
//		//	ПараметрыЭлемента.Родитель = Родитель;
//		//	ПараметрыЭлемента.Вид = ВидПоляФормы.ПолеНадписи;
//		//	юум_РаботаСФормой.СоздатьПолеФормыПоПараметрам(ЭтотОбъект, ПараметрыЭлемента);
//		КонецЦикла;
//	КонецЕсли;

//КонецПроцедуры

//#КонецОбласти
