#Область ОбработчикиСобытийФормы

// #юум {
// #04.02.01.02.01
// Добавление новых реквизитов на форму
// Галфинд Домнышева 2026/10/27
&НаСервере
&После("ПриСозданииНаСервере")
Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	юум_РаботаСФормой.СоздатьПолеФормы(Элементы, "юум_ОсновноеИзделие", "Основное изделие", "Объект.юум_ОсновноеИзделие",
						ВидПоляФормы.ПолеВвода, Элементы["ГруппаШапкаПраво"]);
						
	юум_РаботаСФормой.СоздатьПолеФормы(Элементы, "юум_СпецификацияПроработана", "Спецификация проработана", 
						"Объект.Товары.юум_СпецификацияПроработана", ВидПоляФормы.ПолеФлажка, Элементы["Товары"]);					
						
КонецПроцедуры
// } #юум 

#КонецОбласти