
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() и не ПустаяСтрока(Запись.ВидОбъекта) Тогда
		Если не ТолькоПросмотр Тогда
			вЗаполнитьСписокОбъетков();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если не ТолькоПросмотр Тогда
		вЗаполнитьСписокОбъетков();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	Элементы.ИмяОбъекта.СписокВыбора.Очистить();
	вЗаполнитьСписокОбъетков();
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСписокОбъетков()
	Список = Элементы.ИмяОбъекта.СписокВыбора;
	
	Если Запись.ВидОбъекта = "Справочник" Тогда
		РазделМД = Метаданные.Справочники;
	ИначеЕсли Запись.ВидОбъекта = "Документ" Тогда
		РазделМД = Метаданные.Документы;
	Иначе
		Список.Очистить();
		Возврат;
	КонецЕсли;
	
	Список.Очистить();
	
	Для каждого Элем из РазделМД Цикл
		Список.Добавить(Элем.Имя);
	КонецЦикла;
	
	Список.СортироватьПоЗначению();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ВидНоменклатуры.Видимость = (Запись.ИмяОбъекта = "Номенклатура");

КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры
