// Формирует дерево изделий заданного заказа на производство.
// В дерево выводятся изделия заказа и ПФ первого уровня.
//
// Параметры:
//	Параметры - Структура - параметры чтения данных. Содержит:
//		* Заказ - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ.
//		* ПоказыватьЭтапы - Булево - выводить/не выводить в структуру этапы.
//
// Возвращаемое значение:
//   ДеревоЗначений   - дерево заказа
//
Функция юум_ПостроитьДеревоЗаказа(Параметры) Экспорт
	ДеревоЗаказа = ДеревоЗаказа(Параметры);
	Возврат ДеревоЗаказа;
КонецФункции

&ИзменениеИКонтроль("КоличествоСтрок") 
// Вызывается только из РазвернутьВсеСтроки().
// Не будем учитывать материалы
Функция уюм_КоличествоСтрок(СтрокиДерева)
	
	Результат = 0;
	
	Очередь = Новый Массив;
	Для каждого Строка Из СтрокиДерева Цикл
		#Удаление 
		Если Строка.ТипСтроки <> ТипСтрокиСлужебный() Тогда
		#КонецУдаления
		#Вставка 
		Если Строка.ТипСтроки <> ТипСтрокиСлужебный() И
			 Строка.ТипСтроки <> ТипСтрокиМатериал()  Тогда
		#КонецВставки
			Очередь.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Пока Очередь.ВГраница() <> -1 Цикл
		Результат = Результат + 1;
		Для каждого СтрокаПотомок Из Очередь[0].Строки Цикл
			#Удаление 
			Если СтрокаПотомок.ТипСтроки <> ТипСтрокиСлужебный() Тогда
			#КонецУдаления
			#Вставка 
			Если СтрокаПотомок.ТипСтроки <> ТипСтрокиСлужебный() И
				 СтрокаПотомок.ТипСтроки <> ТипСтрокиМатериал()  Тогда
			#КонецВставки
				Очередь.Добавить(СтрокаПотомок);
			КонецЕсли;
		КонецЦикла;
		Очередь.Удалить(0);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("РазвернутьВсеУровни") 
Процедура уюм_РазвернутьВсеУровни(Параметры, АдресХранилища) Экспорт
	
	Узлы = Новый Соответствие;
	
	СтрокиДерева = Новый Массив;
	КоличествоСтрок = 0;
	
	Для каждого Узел Из Параметры.Узлы Цикл
		
		Дерево = НовыйДерево();
		
		ЗаполнитьДеревоРекурсивно(
			Дерево.Строки,
			ДеревоПолуфабрикатов(Параметры.Заказ, Узел.Значение.КлючиПартий, Узел.Значение.Этап, Параметры, Параметры.Назначение).Строки,
			СтрокиДерева);
		
		Узлы.Вставить(Узел.Ключ, Дерево);
		
		Если Параметры.ПорционнаяВыборка Тогда
			КоличествоСтрок = КоличествоСтрок + КоличествоСтрок(Дерево.Строки);
			Если КоличествоСтрок >= РазмерПорцииВыборки() Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	КлючиПартий = Новый Массив;
	
	Пока СтрокиДерева.ВГраница() <> -1 Цикл
		
		Если Параметры.ПорционнаяВыборка
			И КоличествоСтрок >= РазмерПорцииВыборки() Тогда
			Прервать;
		КонецЕсли;
		
		Для Индекс = -СтрокиДерева.ВГраница() По 0 Цикл
			
			СтрокаДерева = СтрокиДерева[-Индекс];
			
			КлючиПартий.Очистить();
			
			Для ИндексПотомок = -СтрокаДерева.Строки.Количество()+1 По 0 Цикл
				СтрокаПотомок = СтрокаДерева.Строки[-ИндексПотомок];
				Если СтрокаПотомок.ТипСтроки = ТипСтрокиСлужебный() Тогда
					КлючиПартий.Добавить(СтрокаПотомок.КлючПартия);
					СтрокаДерева.Строки.Удалить(-ИндексПотомок);
				КонецЕсли;
			КонецЦикла;
			
			ЗаполнитьДеревоРекурсивно(
				СтрокаДерева.Строки,
				ДеревоПолуфабрикатов(Параметры.Заказ, КлючиПартий, СтрокаДерева.ЭтапСсылка, Параметры, Параметры.Назначение).Строки,
				СтрокиДерева);
			
			СтрокаДерева.ДостроитьДерево = Ложь;
			
			СтрокиДерева.Удалить(-Индекс);
			
			Если Параметры.ПорционнаяВыборка Тогда
				КоличествоСтрок = КоличествоСтрок + КоличествоСтрок(СтрокаДерева.Строки);
				Если КоличествоСтрок >= РазмерПорцииВыборки() Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ВсеДанныеВыбраны = Узлы.Количество() = Параметры.Узлы.Количество()
		И СтрокиДерева.ВГраница() = -1;
	
	ПоместитьВоВременноеХранилище(
		Новый Структура("Узлы, ВсеДанныеВыбраны", Узлы, ВсеДанныеВыбраны),
		АдресХранилища);
	
	#Вставка
	Параметры.Вставить("уюм_Узлы", Узлы);
	Параметры.Вставить("уюм_ВсеДанныеВыбраны", ВсеДанныеВыбраны);
	#КонецВставки
КонецПроцедуры
