
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	ОграничениеУровня = 2;
	
	ЗагрузитьНастройкиФормы();
	
	ПравоДоступаСостояниеОбеспечения = ПравоДоступа("Использование", Метаданные.Обработки.СостояниеОбеспеченияЗаказов);
	
	#Область МобильныйКлиент
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Если ЭтоМобильныйКлиент Тогда
		Состояния = Новый СписокЗначений();
		Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповНаВнутрицеховомУровне.Начат"));
		Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповНаВнутрицеховомУровне.МожноВыполнять"));
		ОтборСостояние = Состояния;
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборыСтрока", Новый ОписаниеТипов("Строка")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборЗаказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборИзделие", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборПартия", Новый ОписаниеТипов("СправочникСсылка.ПартииПроизводства")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборЭтап", Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2")));
		
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		СбросОтборов        = Команды.Добавить("СбросОтборов");
		Отгрузить           = Команды.Добавить("Отгрузить");
		СканироватьШтрихКод = Команды.Добавить("СканироватьШтрихКод");
		
		СбросОтборов.Действие = "СбросОтборов";
		СбросОтборов.Картинка = БиблиотекаКартинок.Очистить;
		
		Отгрузить.Действие = "Отгрузить";
		
		СканироватьШтрихКод.Действие = "СканироватьШтрихКод";
		СканироватьШтрихКод.Картинка = БиблиотекаКартинок["Штрихкод"];
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область УниверсальныеМеханизмы
	
	// ПодключаемоеОборудование
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	СписокТипов = Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2");
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = СписокТипов;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	#КонецОбласти
	
	НастроитьЭлементыФормы();
	
	НастроитьЗависимыеЭлементыФормы(ЭтаФорма);  
	
	ЗаполнитьДеревоЭтапов();   
	
	АдресНастроек = ЭтотОбъект.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;
	ТаблицаКоманд = ПолучитьИзВременногоХранилища(АдресНастроек); 
	СписокКомандОдиночныйВыбор.Очистить();
	СтрокиМножественныйВыбор = ТаблицаКоманд.НайтиСтроки(Новый Структура("МножественныйВыбор", Ложь)); 
	Для каждого СтрокаКоманды Из СтрокиМножественныйВыбор Цикл
	     СписокКомандОдиночныйВыбор.Добавить(СтрокаКоманды.ИмяВФорме, СтрокаКоманды.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ЗакрытиеЗаказов" Тогда
		ЗаполнитьДеревоЭтаповНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДеревоЭтаповНаКлиенте();
	СохранитьНастройкиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодПриИзменении(Элемент)
	
	ЗаполнитьДеревоЭтаповНаКлиенте();
	СохранитьНастройкиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборСостояниеНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыбранныеЗначения", ОтборСостояние);
	
	ОткрытьФорму("Обработка.ВыполнениеЭтаповПроизводства.Форма.ОтборСостояния",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	ЗаполнитьДеревоЭтаповНаКлиенте();
	СохранитьНастройкиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОбеспечениеПриИзменении(Элемент)
	
	ЗаполнитьДеревоЭтаповНаКлиенте();
	СохранитьНастройкиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеУровняПриИзменении(Элемент)
	ЗаполнитьДеревоЭтаповНаКлиенте();
	СохранитьНастройкиФормыКлиент();
КонецПроцедуры


&НаКлиенте
Процедура ОтборЗаказПриИзменении(Элемент)
	ЗаполнитьДеревоЭтаповНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзделиеПриИзменении(Элемент)
	ЗаполнитьДеревоЭтаповНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПартияПриИзменении(Элемент)
	ЗаполнитьДеревоЭтаповНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭтапПриИзменении(Элемент)
	ЗаполнитьДеревоЭтаповНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Поле.Имя = "ОжидаетсяОбеспечение" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТекущиеДанные.СостояниеОбеспечения = ПредопределенноеЗначение("Перечисление.СостоянияОбеспеченияЭтапаПроизводства.ОжидаетсяОбеспечение") Тогда
			
			Если ТекущиеДанные.ДинамическаяСтруктура
				И ПравоДоступаСостояниеОбеспечения Тогда
				МассивДокументов = Новый Массив;
				МассивДокументов.Добавить(ВыбраннаяСтрока);
				ОткрытьСостояниеОбеспеченияДляЭтаповДинамическойСтруктуры(МассивДокументов);
			ИначеЕсли Не ТекущиеДанные.ДинамическаяСтруктура
				И ПравоДоступаСостояниеОбеспечения Тогда
				ОткрытьСостояниеОбеспечения(ВыбраннаяСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "КодСостоянияОпераций" Тогда
		
		Если Не ТекущиеДанные.СостояниеОпераций.Пустая()
			И Не ТекущиеДанные.ТребуетсяЗаполнитьПоОперациям Тогда
			
			СтандартнаяОбработка = Ложь;
			
			УправлениеПроизводствомКлиент.РасшифроватьСостояниеОперацийЭтапа(
				ТекущиеДанные.Ссылка,
				ТекущиеДанные.СостояниеОпераций,
				ЭтаФорма);
			
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ПредставлениеЭтапа" Тогда 
		Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
			ПоказатьЗначение(, ТекущиеДанные.Ссылка);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СтрокаДереваЗаказа" Тогда 
		ОсновноеЗначениеСтроки = ПолучитьОсновноеЗначениеСтроки(ТекущиеДанные.СтрокаДереваЗаказа);
		Если ЗначениеЗаполнено(ОсновноеЗначениеСтроки) Тогда
			ПоказатьЗначение(, ОсновноеЗначениеСтроки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыОбеспечения");
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыОбеспечения", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьНачалоВыполнения(Команда)
	
	ВыделенныеСтроки = ВыбранныеЭтапы(); 
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияИзВыделенныхСтрок = Новый Структура("Подразделение,Организация");
	
	МассивСсылок = ЭтапыДляИзмененияСтатуса("Начат", ВыделенныеСтроки, ЗначенияИзВыделенныхСтрок);
	
	Если МассивСсылок.Количество() > 0 Тогда
		
		ДополнительныеПараметры = Новый Структура("ВыделенныеСтроки", МассивСсылок);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтметитьНачалоВыполненияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Подразделение", ЗначенияИзВыделенныхСтрок.Подразделение);
		ПараметрыФормы.Вставить("Организация", ЗначенияИзВыделенныхСтрок.Организация);
		ОткрытьФорму(
			"Документ.ЭтапПроизводства2_2.Форма.ПараметрыУстановкиСтатуса",
			ПараметрыФормы,
			ЭтотОбъект,,,,
			ОписаниеОповещения, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ТекстПредупреждения = НСтр("ru = 'Не требуется изменять статус выбранных этапов.';
									|en = 'Do not change status of the selected stages.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьНачалоВыполненияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	ОчиститьСообщения();
	КоличествоОбработанных = ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(ВыделенныеСтроки, "Начат", РезультатВопроса);
	ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(Элементы.Список, КоличествоОбработанных, ВыделенныеСтроки.Количество(), НСтр("ru = 'Начат';
																																					|en = 'Started'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыполненным(Команда)
	
	ВыделенныеСтроки = ВыбранныеЭтапы();
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = ЭтапыДляИзмененияСтатуса("Завершен", ВыделенныеСтроки);
	
	Если МассивСсылок.Количество() > 0 Тогда
		
		СписокЗаказов = Новый СписокЗначений;
		СписокЗаказов.ЗагрузитьЗначения(ВыделенныеСтроки);
		
		СтруктураЗакрытия = Новый Структура;
		СтруктураЗакрытия.Вставить("Заказы",                       СписокЗаказов);
		СтруктураЗакрытия.Вставить("ОтменитьНеотработанныеСтроки", Истина);
		СтруктураЗакрытия.Вставить("ЗакрыватьЗаказы",              Истина);
		
		ОткрытьФорму("Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия", СтруктураЗакрытия,
						ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ТекстПредупреждения = НСтр("ru = 'Не требуется изменять статус выбранных этапов.';
									|en = 'Do not change status of the selected stages.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОформитьВыработкуСотрудников(Команда)
	
	ВыделенныеСтроки = ВыбранныеЭтапы();
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = ЭтапыДляОформленияВыработки(ВыделенныеСтроки);
	Если МассивСсылок.Количество() > 0 Тогда
		ОперативныйУчетПроизводстваКлиент.ОформитьВыработкуСотрудниковПоРаспоряжениям(МассивСсылок);
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Не требуется оформлять выработку сотрудников для выбранных этапов.';
									|en = 'It is not required to register timesheets charge for the selected stages.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций(Команда)
	
	ВыбранныеСтроки = ВыбранныеЭтапы();
	
	Если ВыбранныеСтроки.Количество() > 0 Тогда
		УправлениеПроизводствомКлиент.ОткрытьВыполнениеОпераций(ВыбранныеСтроки, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ЗаполнитьДеревоЭтаповНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	ЭлементыДерева = Список.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		ИДСтроки = ЭлементДерева.ПолучитьИдентификатор();
		Элементы.Список.Развернуть(ИДСтроки, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
	ЭлементыДерева = Список.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		ИДСтроки = ЭлементДерева.ПолучитьИдентификатор();
		Элементы.Список.Свернуть(ИДСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОбеспеченияДинамическаяСтруктура(Команда)
	
	МассивДокументов = СобратьМассивДокументовПоДереву(ЭтотОбъект);  
	
	Если МассивДокументов.Количество() > 0 Тогда
		
		ОткрытьСостояниеОбеспеченияДляЭтаповДинамическойСтруктуры(МассивДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

#Если МобильныйКлиент Тогда

&НаКлиенте
Процедура Отгрузить(Команда)
	
	ОбеспечениеВДокументахКлиент.ВыполнитьДействиеВСпискеЗаказовРазныхТипов(
		"ДЕЙСТВИЕ_ОТГРУЗИТЬ",
		Элементы.Список,
		ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка"),
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтборыСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ОтборСостояние",ОтборСостояние);
	ПараметрыФормы.Вставить("ОтборОбеспечение",ОтборОбеспечение);
	ПараметрыФормы.Вставить("Подразделение",ОтборПодразделение);
	ПараметрыФормы.Вставить("Заказ", ЭтаФорма["ОтборЗаказ"]);
	ПараметрыФормы.Вставить("Изделие", ЭтаФорма["ОтборИзделие"]);
	ПараметрыФормы.Вставить("Партия", ЭтаФорма["ОтборПартия"]);
	ПараметрыФормы.Вставить("Этап", ЭтаФорма["ОтборЭтап"]);
	ПараметрыФормы.Вставить("Период",ОтборПериод);
	
	ОткрытьФорму("Обработка.ВыполнениеЭтаповПроизводства.Форма.МобильноеПриложениеУстановкаОтборов",
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		Новый ОписаниеОповещения("ОтборыСтрокаНажатиеЗавершение",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыСтрокаНажатиеЗавершение(ПараметрыОтбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ПараметрыОтбора) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокОтбора = Новый Массив();
	
	Если ПараметрыОтбора.Свойство("МожноВыполнять") И ПараметрыОтбора.Свойство("Начат") Тогда
		
		Состояния = Новый СписокЗначений();
		
		Если ПараметрыОтбора.МожноВыполнять Тогда
			Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповНаВнутрицеховомУровне.Начат"));
			Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповНаВнутрицеховомУровне.МожноВыполнять"));
		КонецЕсли;
		
		Если ПараметрыОтбора.Начат Тогда
			Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповНаВнутрицеховомУровне.Начат"));
		КонецЕсли;
		
		ОтборСостояние = Состояния;
		
	КонецЕсли;
	
	УстановитьОтборПоСостоянию(ЭтаФорма);
	
	Если ПараметрыОтбора.Свойство("ТолькоОбеспеченные") И ПараметрыОтбора.ТолькоОбеспеченные Тогда
		ОтборОбеспечение= "МатериалыОбеспечены";
		МассивСтрокОтбора.Добавить("Только обеспеченные");
	Иначе
		ОтборОбеспечение = "";
	КонецЕсли;
	
	УстановитьОтборПоОбеспечению(ЭтаФорма);
	
	Для Каждого КлючИЗначение Из ПараметрыОтбора Цикл
		
		Если СтрНайти(КлючИЗначение.Ключ, "Отбор") > 0 Тогда
			ЭтаФорма[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
			Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				МассивСтрокОтбора.Добавить(КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	УстановитьОтборПоЗаказу();
	
	УстановитьОтборПоИзделию();
	
	УстановитьОтборПоПартии();
	
	УстановитьОтборПоЭтапу();
	
	УстановитьОтборПоПериоду(ЭтаФорма);
	
	Если МассивСтрокОтбора.Количество() > 0 Тогда
		ЭтаФорма["ОтборыСтрока"] = СтрСоединить(МассивСтрокОтбора, ", ");
	Иначе
		ЭтаФорма["ОтборыСтрока"] = НСтр("ru = 'Установить отборы';
										|en = 'Set filters'") + ?(ОтборСостояние.Количество() > 0, "*", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбросОтборов(Команда)
	
	ОтборОбеспечение   = Неопределено;
	ОтборПериод        = Неопределено;
	ОтборПодразделение = Неопределено;
	
	ОтборСостояние = Новый СписокЗначений();
	
	ЭтаФорма["ОтборЗаказ"]   = Неопределено;
	ЭтаФорма["ОтборИзделие"] = Неопределено;
	ЭтаФорма["ОтборПартия"]  = Неопределено;
	ЭтаФорма["ОтборЭтап"]    = Неопределено;

	ЭтаФорма["ОтборыСтрока"] = НСтр("ru = 'Установить отборы';
									|en = 'Set filters'");
	
	УстановитьОтборПоПодразделению(ЭтаФорма);
	УстановитьОтборПоПериоду(ЭтаФорма);
	УстановитьОтборПоСостоянию(ЭтаФорма);
	УстановитьОтборПоОбеспечению(ЭтаФорма);
	
	УстановитьОтборПоЗаказу();
	УстановитьОтборПоИзделию();
	УстановитьОтборПоПартии();
	УстановитьОтборПоЭтапу();
	
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШтрихКод(Команда)
	
	Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
		
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);
		
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(НСтр("ru = 'Наведите камеру на штрихкод';
																|en = 'Point the camera at the barcode'"),
			ОбработчикСканирования,
			,
			ТипШтрихКода.Линейный);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(ЗвуковоеОповещение.ПоУмолчанию,Истина);
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		
		ЗаполнитьОтбор(Штрихкод);
	Иначе
		
		Сообщение = НСтр("ru = 'Ошибка обработки штрих кода';
						|en = 'Barcode processing error'");
		
	КонецЕсли;
КонецПроцедуры

#КонецЕсли

#Область Универсальные

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МассивДокументов = СобратьМассивДокументовПоДереву(ЭтотОбъект);
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, МассивДокументов);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список); 
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиФормы

&НаСервере
Процедура ЗагрузитьНастройкиФормы()
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючФормы(),
		КлючНастроекФормы());
	
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиФормыКлиент()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ОтборПодразделение", ОтборПодразделение);
	Настройки.Вставить("ОтборСостояние", ОтборСостояние);
	Настройки.Вставить("ОтборОбеспечение", ОтборОбеспечение);
	Настройки.Вставить("ОтборПериод", ОтборПериод);
	Настройки.Вставить("ОграничениеУровня", ОграничениеУровня);
	
	СохранитьНастройкиФормыСервер(Настройки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормыСервер(Настройки)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючФормы(),
		КлючНастроекФормы(),
		Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючФормы()
	
	Возврат "Обработка.ВыполнениеЭтаповПроизводства.юум_Форма";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючНастроекФормы()
	
	Возврат "Основные";
	
КонецФункции

#КонецОбласти

#Область Обеспечение

&НаКлиенте
Процедура ВыполнитьДействиеВСпискеЗаказовРазныхТиповЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		
	Иначе
		
		ЗаказыДляПроверкиЗаданияРаспределенияЗапасов.ЗагрузитьЗначения(ДополнительныеПараметры.Заказы);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам", 1, Истина);
		РезультатВыполненияДействий = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ОбеспечениеВДокументахКлиент.СообщитьОРезультатахВыполненияДействийВСпискеЗаказов(РезультатВыполненияДействий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам()
	ОбеспечениеВДокументахКлиент.ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыОбеспечения()
	
	ВыделенныхСтрок = Элементы.Список.ВыделенныеСтроки.Количество();
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные; 
	ЕстьЭтап = ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Ссылка);
	ДоступностьОдиночных = (ВыделенныхСтрок = 1 и ЕстьЭтап);
	
	Для каждого ЭлементСписка Из СписокКомандОдиночныйВыбор Цикл
	     ИмяКоманды = ЭлементСписка.Значение;
		 Элементы[ИмяКоманды].Доступность = ДоступностьОдиночных;
	КонецЦикла;
	
	ВыделенаСтрокаСписка = ТекущиеДанные <> Неопределено
		И ТипЗнч(Элементы.Список.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка");
	
	Элементы.СписокСостояниеОбеспеченияДинамическаяСтруктура.Видимость = ВыделенаСтрокаСписка
		И ПравоДоступаСостояниеОбеспечения;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСостояниеОбеспечения(ВыбраннаяСтрока)
	
	ПараметрыФормы = ОбеспечениеВДокументахКлиент.ПараметрыФормыСостояниеОбеспеченияЗаказов("СПИСОКЗАКАЗОВ");
	ПараметрыФормы.Заказы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбраннаяСтрока);
	
	ОткрытьФорму("Обработка.СостояниеОбеспеченияЗаказов.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	#Область ДатыГрафика
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Начало.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Окончание.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НачалоСледующегоЭтапа.Имя);
	
	Элемент.Оформление.УстановитьЗначениеПараметра(
		"Формат",
		УправлениеПроизводством.ФорматнаяСтрокаДляДатыГрафикаПроизводства());
	
	#КонецОбласти
	
	#Область НеЗавершеныПредшественники
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.ОжиданиеПредшествующих);
	СписокЗначений.Добавить(Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.НачатыПредшествующие);
	
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СерыйЦветТекста1);
	
	#КонецОбласти
	
	#Область ЭтапПросрочен
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Окончание.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Просрочен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста",
		ЦветаСтиля.ЦветТекстаПроблема);
	
	#КонецОбласти
	
	#Область МобильныйКлиент
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.Завершен;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(
			"ЦветТекста",
			ЦветаСтиля.СерыйЦветТекста1);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.ОжиданиеПредшествующих);
		СписокЗначений.Добавить(Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.НачатыПредшествующие);
		
		ОтборЭлемента.ПравоеЗначение = СписокЗначений;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(
			"ЦветТекста",
			ЦветаСтиля.СерыйЦветТекста2);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.МожноВыполнять;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(
			"ЦветТекста",
			ЦветаСтиля.ЦветТекстаУспех);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Состояние");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЭтаповНаВнутрицеховомУровне.Завершен;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(
			"Текст",
			"");
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = Неопределено Тогда
		
		ОтборСостояние = РезультатЗакрытия;
		ЗаполнитьДеревоЭтаповНаКлиенте();
		СохранитьНастройкиФормыКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ГрафикИспользуется = УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства();
	
	Элементы.ОтборПериод.Видимость = ГрафикИспользуется;
	Элементы.Начало.Видимость = ГрафикИспользуется;
	Элементы.Окончание.Видимость = ГрафикИспользуется;
	Элементы.НачалоСледующегоЭтапа.Видимость = ГрафикИспользуется;
	Элементы.ТребуетсяРасчет.Видимость = ГрафикИспользуется;
	
	ИспользуютсяОперации = ПолучитьФункциональнуюОпцию("ИспользоватьПооперационноеУправление") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьПооперационноеПланирование");
	
	Элементы.СостояниеОпераций.Видимость = ИспользуютсяОперации;
	Элементы.КодСостоянияОпераций.Видимость = ИспользуютсяОперации;
	Элементы.ФормаВыполнениеОпераций.Видимость = ИспользуютсяОперации;
	
КонецПроцедуры

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения
// 	СписокРеквизитов - Строка
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЗависимыеЭлементыФормы(Форма, СписокРеквизитов = "")

	Элементы = Форма.Элементы;
	
	Инициализация = ПустаяСтрока(СписокРеквизитов);
	
	Если Инициализация И Форма.ЭтоМобильныйКлиент Тогда
		
		//Команды списка
		Элементы.ОтметитьНачалоВыполнения.Заголовок = НСтр("ru = 'Начать';
															|en = 'Start'");
		Элементы.ОтметитьВыполненным.Заголовок = НСтр("ru = 'Завершить';
														|en = 'Finish'");
		
		ЭлементНачать = Элементы.Добавить("Начать",Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
		ЭлементНачать.Заголовок = НСтр("ru = 'Начать';
										|en = 'Start'");
		ЭлементНачать.ИмяКоманды = "ОтметитьНачалоВыполнения";
		
		ЭлементЗавершить = Элементы.Добавить("Завершить",Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
		ЭлементЗавершить.Заголовок = НСтр("ru = 'Завершить';
											|en = 'Finish'");
		ЭлементЗавершить.ИмяКоманды = "ОтметитьВыполненным";
		
		ЭлементОтгрузить = Элементы.Добавить("Отгрузить",Тип("КнопкаФормы"));
		ЭлементОтгрузить.ИмяКоманды = "Отгрузить";
		
		ЭлементОтгрузитьКоманднаяПанель = Элементы.Добавить("ОтгрузитьКоманднаяПанель",Тип("КнопкаФормы"), Элементы.ОсновныеДействия);
		ЭлементОтгрузитьКоманднаяПанель.Заголовок = НСтр("ru = 'Отгрузить';
														|en = 'Ship'");
		ЭлементОтгрузитьКоманднаяПанель.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		ЭлементОтгрузитьКоманднаяПанель.ИмяКоманды = "Отгрузить";
		
		МассивЭлементов = Новый Массив();
		МассивЭлементов.Добавить(ЭлементОтгрузить);
		МассивЭлементов.Добавить(ЭлементНачать);
		МассивЭлементов.Добавить(ЭлементЗавершить);
		МассивЭлементов.Добавить(Элементы.ДействияПрочие);
		МассивЭлементов.Добавить(Элементы.ПодменюСоздатьНаОсновании);
		МассивЭлементов.Добавить(Элементы.ПодменюПечать);
		МассивЭлементов.Добавить(Элементы.ПодменюОтчеты);
		МассивЭлементов.Добавить(Элементы.ФормаВыполнениеОпераций);
		
		Для Каждого Элемент Из МассивЭлементов Цикл
			Элементы.Переместить(Элемент,Элементы.Список.КонтекстноеМеню, Элементы.СписокКонтекстноеМенюИзменить);
		КонецЦикла;
		
		//Поля списка
		Элементы.ОформитьВыработку.Видимость     = Ложь;
		Элементы.ТребуетсяРасчет.Видимость       = Ложь;
		Элементы.КодСостоянияОпераций.Видимость  = Ложь;
		Элементы.ОжидаетсяОбеспечение.Видимость  = Ложь;
		Элементы.Окончание.Видимость             = Ложь;
		Элементы.НачалоСледующегоЭтапа.Видимость = Ложь;
		
		Элементы.Состояние.ОтображатьВШапке               = Ложь;
		Элементы.ИзделиеЕдиницаИзмерения.ОтображатьВШапке = Ложь;
		
		Элементы.Переместить(Элементы.Начало, Элементы.Список);
		Элементы.Переместить(Элементы.Состояние, Элементы.Список, Элементы.Начало);
		
		Элементы.Изделий.Заголовок = НСтр("ru = 'Количество';
											|en = 'Quantity'");
		
		Номенклатура = Элементы.Добавить("Номенклатура", Тип("ПолеФормы"), Элементы.Список);
		Номенклатура.ПутьКДанным = "Список.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура";
		Номенклатура.Заголовок = НСтр("ru = 'Номенклатура';
										|en = 'Products'");
		Элементы.Переместить(Номенклатура, Элементы.Список, Элементы.Изделий);
		
		Характеристика = Элементы.Добавить("Характеристика", Тип("ПолеФормы"), Элементы.Список);
		Характеристика.ПутьКДанным = "Список.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика";
		Характеристика.Заголовок = НСтр("ru = 'Характеристика';
										|en = 'Variant'");
		Элементы.Переместить(Характеристика, Элементы.Список, Элементы.Изделий);
		
		//отборы
		Для каждого Отбор Из Элементы.ГруппаОтборы.ПодчиненныеЭлементы Цикл
			Отбор.Видимость = Ложь;
		КонецЦикла; 
		
		Элементы.ГруппаОтборы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Форма["ОтборыСтрока"] = НСтр("ru = 'Установить отборы';
									|en = 'Set filters'") + ?(Форма.ОтборСостояние.Количество() > 0, "*", "");
		ОтборыСтрока = Элементы.Добавить("ОтборыСтрока",Тип("ПолеФормы"),Элементы.ГруппаОтборы);
		ОтборыСтрока.Вид = ВидПоляФормы.ПолеНадписи;
		ОтборыСтрока.ПутьКДанным = "ОтборыСтрока";
		ОтборыСтрока.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ОтборыСтрока.Гиперссылка = Истина;
		ОтборыСтрока.ЦветТекста = WebЦвета.Зеленый;
		ОтборыСтрока.УстановитьДействие("Нажатие", "Подключаемый_ОтборыСтрокаНажатие");
		
		ЭлементСбросОтборов = Элементы.Добавить("СбросОтборов",Тип("КнопкаФормы"),Элементы.ГруппаОтборы);
		ЭлементСбросОтборов.ИмяКоманды = "СбросОтборов";
		ЭлементСбросОтборов.Отображение = ОтображениеКнопки.Картинка;
		
		ЭлементСканироватьШтрихКод = Элементы.Добавить("СканироватьШтрихКод",Тип("КнопкаФормы"),Элементы.ГруппаОтборы);
		ЭлементСканироватьШтрихКод.ИмяКоманды = "СканироватьШтрихКод";
		ЭлементСканироватьШтрихКод.Отображение = ОтображениеКнопки.Картинка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтапыДляОформленияВыработки(ВыделенныеСтроки)
	
	Результат = Новый Массив;
	
	Для каждого Строка Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
		
		Если ДанныеСтроки.ОформитьВыработку Тогда
			
			Результат.Добавить(ДанныеСтроки.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыбранныеЭтапы()
    Возврат СобратьМассивДокументовПоДереву(ЭтотОбъект);
КонецФункции

&НаКлиенте
Функция ЭтапыДляИзмененияСтатуса(НовыйСтатус, ВыделенныеСтроки, ЗначенияИзВыделенныхСтрок = Неопределено)
	
	КлючиЗначений = Новый Массив();
	КлючиИнициализированы = Ложь;
	
	Результат = Новый Массив;
	ЗначениеНовогоСтатуса = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2." + НовыйСтатус);
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
		
		Если Не УправлениеПроизводствомКлиентСервер.СравнениеСтатусовЭтапа(ЗначениеНовогоСтатуса, ДанныеСтроки.Статус) > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ДанныеСтроки.Ссылка); 
		
		Если Не ЗначенияИзВыделенныхСтрок = Неопределено Тогда
			Если Не КлючиИнициализированы Тогда
				Для Каждого КлючИЗначение Из ЗначенияИзВыделенныхСтрок Цикл
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, КлючИЗначение.Ключ) Тогда
						ЗначенияИзВыделенныхСтрок[КлючИЗначение.Ключ] = ДанныеСтроки[КлючИЗначение.Ключ];
						КлючиЗначений.Добавить(КлючИЗначение.Ключ);
					КонецЕсли; 
				КонецЦикла;
				КлючиИнициализированы = Истина;
			Иначе
				Для Сч = -КлючиЗначений.ВГраница() По 0 Цикл
					Ключ = КлючиЗначений[-Сч];
					Если ДанныеСтроки[Ключ] = ЗначенияИзВыделенныхСтрок[Ключ] Тогда
						Продолжить;
					КонецЕсли;
					ЗначенияИзВыделенныхСтрок[Ключ] = Неопределено;
					КлючиЗначений.Удалить(-Сч);
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	Ссылка = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если Ссылка <> Неопределено Тогда
		Элементы.Список.ТекущаяСтрока = Ссылка;
		Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
			ПоказатьЗначение(Неопределено, Ссылка);
		КонецЕсли;
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Возврат УправлениеПроизводствомКлиент.СсылкаНаЭтапПроизводстваПоШтрихкоду(Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОтбор(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказНаПроизводство2_2.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.ПартииПроизводства.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
	
	Ссылки = ШтрихкодированиеПечатныхФормВызовСервера.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
	Ссылка = Неопределено;
	Если Ссылки.Количество() > 0 Тогда
		Ссылка = Ссылки[0];
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		
		ОтборПодразделение = Ссылка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство2_2") Тогда
		
		ЭтаФорма["ОтборЗаказ"] = Ссылка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ЭтаФорма["ОтборИзделие"] = Ссылка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПартииПроизводства") Тогда
		
		ЭтаФорма["ОтборПартия"] = Ссылка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
		
		ЭтаФорма["ОтборЭтап"] = Ссылка;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'Штрих-код не найден';
								|en = 'Barcode is not found'");
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	ЗаполнитьДеревоЭтаповНаКлиенте();
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресТаблицыДвижений(МассивДокументов, УникальныйИдентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЭтапПроизводства2_2.ДинамическаяСтруктура) КАК ДинамическаяСтруктураМакс,
		|	МИНИМУМ(ЭтапПроизводства2_2.ДинамическаяСтруктура) КАК ДинамическаяСтруктураМин
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|ГДЕ
		|	ЭтапПроизводства2_2.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Выборка.ДинамическаяСтруктураМакс <> Выборка.ДинамическаяСтруктураМин Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Документы.ЭтапПроизводства2_2.АдресТаблицыДвиженийДляВызоваСостоянияОбеспечения(МассивДокументов, УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура ОткрытьСостояниеОбеспеченияДляЭтаповДинамическойСтруктуры(МассивДокументов)
	
	ОчиститьСообщения();
	АдресТаблицыДвижений = АдресТаблицыДвижений(МассивДокументов, УникальныйИдентификатор);
	
	Если АдресТаблицыДвижений = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Среди выделенных строк присутствуют этапы производства по статической и динамической структуре заказа.
		|Для данных этапов одновременно не поддерживается работа формы ""Состояние обеспечения"".';
		|en = 'The selected lines contain production stages with static and dynamic order structure.
		|These stages do not simultaneously support the ""Supply forecast"" form.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ОбеспечениеВДокументахКлиент.ПараметрыФормыСостояниеОбеспеченияЗаказов("ТАБЛИЦА");
	ПараметрыФормы.АдресТаблицыДвижений = АдресТаблицыДвижений;
	ПараметрыФормы.ЗаказыРегистраторыДвижений = МассивДокументов;
	ПараметрыФормы.ЭтапДинамическойСтруктурыЗаказа = Истина;
	ПараметрыФормы.ДопустимыеВариантыОбеспечения = Новый Соответствие;
		
	ПараметрыФормы.Заказы = МассивДокументов;
	ОткрытьФорму("Обработка.СостояниеОбеспеченияЗаказов.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоЭтаповНаКлиенте()
    ЗаполнитьДеревоЭтапов();
	РазвернутьДерево(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЭтапов()  
	Запрос = Новый Запрос;
	
    ТекстЗапроса = ПолучитьТекстОсновногоЗапроса();
	
	УстановитьПараметрыОтборыЗапроса(Запрос, ТекстЗапроса);
	
	Запрос.Текст  = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	//ДеревоРезультат = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	//ОбработатьДеревоПослеФормирования(ДеревоРезультат);
	//ЗначениеВРеквизитФормы(ДеревоРезультат, "Список");
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	ОбработатьТаблицуПослеФормирования(ТаблицаРезультат);
	ДеревоРезультат = ПолучитьДеревоИзТаблицы(ТаблицаРезультат);
	ЗначениеВРеквизитФормы(ДеревоРезультат, "Список");
КонецПроцедуры  

&НаСервере
Процедура УстановитьПараметрыОтборыЗапроса(Запрос, ТекстЗапроса)
	МассивТекстовОтборов = Новый Массив;
	Если ЗначениеЗаполнено(ОтборПодразделение)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.Подразделение = &ОтборПодразделение");
		Запрос.УстановитьПараметр("ОтборПодразделение", ОтборПодразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборСостояние)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.Состояние В (&ОтборСостояние)");
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборОбеспечение)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.СостояниеОбеспечения = &ОтборОбеспечение");
		Запрос.УстановитьПараметр("ОтборОбеспечение", ОтборОбеспечение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборЗаказ)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.ЗаказНаПроизводство = &ОтборЗаказ");
		Запрос.УстановитьПараметр("ОтборЗаказ", ОтборЗаказ);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборИзделие)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.Номенклатура = &ОтборИзделие");
		Запрос.УстановитьПараметр("ОтборИзделие", ОтборИзделие);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборПартия)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.Ссылка.ПартияПроизводства = &ОтборПартия");
		Запрос.УстановитьПараметр("ОтборПартия", ОтборПартия);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборЭтап)  Тогда
		МассивТекстовОтборов.Добавить("СписокЭтаповРазбор.Ссылка = &ОтборЭтап");
		Запрос.УстановитьПараметр("ОтборЭтап", ОтборЭтап);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборПериод.ДатаНачала) Тогда
		МассивТекстовОтборов.Добавить("(СписокЭтаповРазбор.Начало >= &ОтборДатаНачала ИЛИ СписокЭтаповРазбор.Начало = ДАТАВРЕМЯ(1, 1, 1))");
		Запрос.УстановитьПараметр("ОтборДатаНачала", ОтборПериод.ДатаНачала);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПериод.ДатаОкончания) Тогда
		МассивТекстовОтборов.Добавить("(СписокЭтаповРазбор.Окончание <= &ОтборДатаОкончания ИЛИ СписокЭтаповРазбор.Окончание = ДАТАВРЕМЯ(1, 1, 1))");
		Запрос.УстановитьПараметр("ОтборДатаОкончания", ОтборПериод.ДатаОкончания);
	КонецЕсли;
	
	Если МассивТекстовОтборов.Количество() = 0  Тогда
		ТекстОтборов = "ИСТИНА";
	Иначе
		ТекстОтборов = СтрСоединить(МассивТекстовОтборов, " И ");
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтборов", ТекстОтборов);  
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтатусГрафика", РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик());
	Запрос.УстановитьПараметр("ОграничениеУровня", ОграничениеУровня);   
	Запрос.УстановитьПараметр("СтатусЭтапаЗавершен", Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);   
	Запрос.УстановитьПараметр("ПустойРодитель", Справочники.юум_ДеревоЗаказаСлужебный.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойИдентификатор", ПустойИдентификатор);
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстОсновногоЗапроса()
    ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЭтапыПереопределяемый.Ссылка КАК Ссылка,
	|	ЭтапыПереопределяемый.Дата КАК Дата,
	|	ЭтапыПереопределяемый.Подразделение КАК Подразделение,
	|	ЭтапыПереопределяемый.Статус КАК Статус,
	|	ЭтапыПереопределяемый.Назначение КАК Назначение,
	|	ЭтапыПереопределяемый.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	ЭтапыПереопределяемый.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
	|	ЭтапыПереопределяемый.ПланированиеРабот КАК ПланированиеРабот,
	|	ЭтапыПереопределяемый.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|	ЭтапыПереопределяемый.КоличествоУпаковокПлан КАК Изделий,
	|	ВЫБОР
	|		КОГДА ЭтапыПереопределяемый.УпаковкаПлан = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЭтапыПереопределяемый.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЭтапыПереопределяемый.УпаковкаПлан
	|	КОНЕЦ КАК ИзделиеЕдиницаИзмерения,
	|	ЭтапыПереопределяемый.Номер + "", "" + ЭтапыПереопределяемый.НаименованиеЭтапа КАК ПредставлениеЭтапа,
	|	ГрафикПереопределяемый.Начало КАК Начало,
	|	ГрафикПереопределяемый.Окончание КАК Окончание,
	|	ГрафикПереопределяемый.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГрафикПереопределяемый.Окончание, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				И КОНЕЦПЕРИОДА(ГрафикПереопределяемый.Окончание, ДЕНЬ) < &ТекущаяДата
	|				И ЭтапыПереопределяемый.Статус <> &СтатусЭтапаЗавершен
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрСведений.ЗаданияКРасчетуГрафикаПроизводства КАК ЗаданияПереопределяемый
	|		ГДЕ
	|			НЕ ЭтапыПереопределяемый.ДинамическаяСтруктура
	|			И ЗаданияПереопределяемый.ЭтапПроизводства = ЭтапыПереопределяемый.Ссылка
	|	
	|		ОБЪЕДИНИТЬ ВСЕ
	|	
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства КАК ЗаданияПереопределяемый
	|		ГДЕ
	|			ЭтапыПереопределяемый.ДинамическаяСтруктура
	|			И ЗаданияПереопределяемый.ЭтапПроизводства = ЭтапыПереопределяемый.Ссылка) КАК ТребуетсяРасчет,
	|	ЕСТЬNULL(СостоянияЭтаповПроизводстваПереопределяемый.ТребуетОформленияВыработки, ЛОЖЬ) КАК ОформитьВыработку,
	|	ЭтапыПереопределяемый.ТребуетсяЗаполнитьПоОперациям КАК ТребуетсяЗаполнитьПоОперациям,
	|	СостоянияЭтаповПроизводстваПереопределяемый.СостояниеОпераций КАК СостояниеОпераций,
	|	ВЫБОР
	|		КОГДА ЭтапыПереопределяемый.ТребуетсяЗаполнитьПоОперациям
	|			ТОГДА 3
	|		КОГДА СостоянияЭтаповПроизводстваПереопределяемый.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.ОжидаетНазначения)
	|			ТОГДА 0
	|		КОГДА СостоянияЭтаповПроизводстваПереопределяемый.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.ОжидаетЗавершения)
	|			ТОГДА 1
	|		КОГДА СостоянияЭтаповПроизводстваПереопределяемый.СостояниеОпераций = ЗНАЧЕНИЕ(Перечисление.СостоянияОперацийЭтапаПроизводства.Выполнено)
	|			ТОГДА 2
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК КодСостоянияОпераций,
	|	ВЫБОР
	|		КОГДА ЭтапыПереопределяемый.Статус = &СтатусЭтапаЗавершен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаВнутрицеховомУровне.Завершен)
	|		ИНАЧЕ СостоянияЭтаповПроизводстваПереопределяемый.СостояниеНаВнутрицеховомУровне
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР
	|		КОГДА ЭтапыПереопределяемый.Статус = &СтатусЭтапаЗавершен
	|			ТОГДА 5
	|		ИНАЧЕ СостоянияЭтаповПроизводстваПереопределяемый.КодСостоянияНаВнутрицеховомУровне
	|	КОНЕЦ КАК КодСостояния,
	|	ЕСТЬNULL(СостоянияЭтаповПроизводстваПереопределяемый.СостояниеОбеспечения, НЕОПРЕДЕЛЕНО) КАК СостояниеОбеспечения,
	|	ЕСТЬNULL(СостоянияЭтаповПроизводстваПереопределяемый.СостояниеОбеспечения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СостоянияОбеспеченияЭтапаПроизводства.ОжидаетсяОбеспечение) КАК ОжидаетсяОбеспечение,
	|	ЕСТЬNULL(НормативныйГрафикЭтаповПроизводстваПереопределяемый.ДлительностьДоВыпуска, ЭтапыПереопределяемый.ДлительностьДоВыпуска) КАК ДлительностьДоВыпуска,
	|	ЭтапыПереопределяемый.Распоряжение.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетРаспоряжения,
	|	ЭтапыПереопределяемый.Распоряжение.Подразделение.РеквизитДопУпорядочивания КАК ПриоритетПодразделения,
	|	ЭтапыПереопределяемый.Распоряжение.Очередь КАК ОчередьРаспоряжения,
	|	ЭтапыПереопределяемый.Распоряжение КАК ЗаказНаПроизводство,
	|	ЭтапыПереопределяемый.Спецификация КАК Спецификация,
	|	ЭтапыПереопределяемый.Спецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	|	ЭтапыПереопределяемый.КоличествоУпаковокФакт КАК ИзделийФакт,
	|	ВЫБОР
	|		КОГДА ЭтапыПереопределяемый.УпаковкаФакт = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЭтапыПереопределяемый.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЭтапыПереопределяемый.УпаковкаФакт
	|	КОНЕЦ КАК ИзделиеЕдиницаИзмеренияФакт
	|ПОМЕСТИТЬ СписокЭтапов
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапыПереопределяемый
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикПереопределяемый
	|		ПО ЭтапыПереопределяемый.Распоряжение = ГрафикПереопределяемый.ЗаказНаПроизводство
	|			И ЭтапыПереопределяемый.Ссылка = ГрафикПереопределяемый.Этап
	|			И (ГрафикПереопределяемый.СтатусГрафика = &СтатусГрафика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативныйГрафикЭтаповПроизводства КАК НормативныйГрафикЭтаповПроизводстваПереопределяемый
	|		ПО ЭтапыПереопределяемый.Ссылка = НормативныйГрафикЭтаповПроизводстваПереопределяемый.ЭтапПроизводства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭтаповПроизводства КАК СостоянияЭтаповПроизводстваПереопределяемый
	|		ПО ЭтапыПереопределяемый.Ссылка = СостоянияЭтаповПроизводстваПереопределяемый.Этап
	|ГДЕ
	|	ЭтапыПереопределяемый.Проведен = ИСТИНА
	|	И НЕ ЭтапыПереопределяемый.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Формируется), ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Сформирован))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	юум_ДеревоЗаказаСлужебный.Ссылка КАК СтрокаДерева,
	|	юум_ДеревоЗаказаСлужебный.Родитель КАК Родитель,
	|	юум_ДеревоЗаказаСлужебный.Код КАК Код,
	|	юум_ДеревоЗаказаСлужебный.Наименование КАК Наименование,
	|	юум_ДеревоЗаказаСлужебный.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	юум_ДеревоЗаказаСлужебный.Номенклатура КАК Номенклатура,
	|	юум_ДеревоЗаказаСлужебный.Характеристика КАК Характеристика,
	|	юум_ДеревоЗаказаСлужебный.Назначение КАК Назначение,
	|	юум_ДеревоЗаказаСлужебный.КлючНоменклатура КАК КлючНоменклатура,
	|	юум_ДеревоЗаказаСлужебный.КлючПартия КАК КлючПартия,
	|	юум_ДеревоЗаказаСлужебный.КлючНабор КАК КлючНабор,
	|	юум_ДеревоЗаказаСлужебный.Разделитель КАК Разделитель,
	|	юум_ДеревоЗаказаСлужебный.Уровень КАК Уровень,
	|	юум_ДеревоЗаказаСлужебный.Спецификация КАК Спецификация,
	|	юум_ДеревоЗаказаСлужебный.Доля КАК Доля,
	|	юум_ДеревоЗаказаСлужебный.ИдСтроки КАК ИдСтроки,
	|	юум_ДеревоЗаказаСлужебный.Требуется КАК Требуется,
	|	юум_ДеревоЗаказаСлужебный.СчетчикСтрок КАК СчетчикСтрок,
	|	юум_ДеревоЗаказаСлужебный.СтрокаДереваУровень1 КАК РодительУровень1,
	|	юум_ДеревоЗаказаСлужебный.СтрокаДереваУровень2 КАК РодительУровень2,
	|	юум_ДеревоЗаказаСлужебный.СтрокаДереваУровень3 КАК РодительУровень3,
	|	юум_ДеревоЗаказаСлужебный.СтрокаДереваУровень4 КАК РодительУровень4,
	|	юум_ДеревоЗаказаСлужебный.СтрокаДереваУровень5 КАК РодительУровень5,
	|	юум_ДеревоЗаказаСлужебный.ТребуетсяВсего КАК ТребуетсяВсего
	|ПОМЕСТИТЬ ДеревоЗаказа
	|ИЗ
	|	Справочник.юум_ДеревоЗаказаСлужебный КАК юум_ДеревоЗаказаСлужебный
	|ГДЕ
	|	юум_ДеревоЗаказаСлужебный.ЗаказНаПроизводство В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СписокЭтапов.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|			ИЗ
	|				СписокЭтапов КАК СписокЭтапов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокЭтапов.Ссылка КАК Ссылка,
	|	СписокЭтапов.Дата КАК Дата,
	|	СписокЭтапов.Подразделение КАК Подразделение,
	|	СписокЭтапов.Статус КАК Статус,
	|	СписокЭтапов.Назначение КАК Назначение,
	|	СписокЭтапов.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	СписокЭтапов.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
	|	СписокЭтапов.ПланированиеРабот КАК ПланированиеРабот,
	|	СписокЭтапов.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|	СписокЭтапов.Изделий КАК Изделий,
	|	СписокЭтапов.ИзделиеЕдиницаИзмерения КАК ИзделиеЕдиницаИзмерения,
	|	СписокЭтапов.ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	|	СписокЭтапов.Начало КАК Начало,
	|	СписокЭтапов.Окончание КАК Окончание,
	|	СписокЭтапов.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
	|	СписокЭтапов.Просрочен КАК Просрочен,
	|	СписокЭтапов.ТребуетсяРасчет КАК ТребуетсяРасчет,
	|	СписокЭтапов.ОформитьВыработку КАК ОформитьВыработку,
	|	СписокЭтапов.ТребуетсяЗаполнитьПоОперациям КАК ТребуетсяЗаполнитьПоОперациям,
	|	СписокЭтапов.СостояниеОпераций КАК СостояниеОпераций,
	|	СписокЭтапов.КодСостоянияОпераций КАК КодСостоянияОпераций,
	|	СписокЭтапов.Состояние КАК Состояние,
	|	СписокЭтапов.КодСостояния КАК КодСостояния,
	|	СписокЭтапов.СостояниеОбеспечения КАК СостояниеОбеспечения,
	|	СписокЭтапов.ОжидаетсяОбеспечение КАК ОжидаетсяОбеспечение,
	|	СписокЭтапов.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|	СписокЭтапов.ПриоритетРаспоряжения КАК ПриоритетРаспоряжения,
	|	СписокЭтапов.ПриоритетПодразделения КАК ПриоритетПодразделения,
	|	СписокЭтапов.ОчередьРаспоряжения КАК ОчередьРаспоряжения,
	|	СписокЭтапов.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДеревоЗаказа.СтрокаДерева КАК СтрокаДерева,
	|	ДеревоЗаказа.Уровень КАК Уровень,
	|	СписокЭтапов.Изделий * ВЫБОР
	|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) <> 0
	|				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) КАК ЧИСЛО(27, 11))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИзделий,
	|	СписокЭтапов.Номенклатура КАК Номенклатура,
	|	СписокЭтапов.Спецификация КАК Спецификация,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ДеревоЗаказа.СтрокаДерева ЕСТЬ NULL
	|				ТОГДА ДеревоЗаказа_ТолькоЗаказы.СтрокаДерева
	|			КОГДА &ОграничениеУровня = 0
	|				ТОГДА ДеревоЗаказа.СтрокаДерева
	|			КОГДА &ОграничениеУровня = 1
	|				ТОГДА ДеревоЗаказа.РодительУровень1
	|			КОГДА &ОграничениеУровня = 2
	|				ТОГДА ДеревоЗаказа.РодительУровень2
	|			КОГДА &ОграничениеУровня = 3
	|				ТОГДА ДеревоЗаказа.РодительУровень3
	|			КОГДА &ОграничениеУровня = 4
	|				ТОГДА ДеревоЗаказа.РодительУровень4
	|			КОГДА &ОграничениеУровня = 5
	|				ТОГДА ДеревоЗаказа.РодительУровень5
	|			ИНАЧЕ ДеревоЗаказа_ТолькоЗаказы.СтрокаДерева
	|		КОНЕЦ, &ПустойРодитель) КАК ОсновноеИзделие,
	|	СписокЭтапов.ИзделийФакт КАК ИзделийФакт,
	|	СписокЭтапов.ИзделиеЕдиницаИзмеренияФакт КАК ИзделиеЕдиницаИзмеренияФакт,
	|	СписокЭтапов.ИзделийФакт * ВЫБОР
	|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмеренияФакт.Знаменатель, 1) <> 0
	|				И ЕСТЬNULL(УпаковкиЕдиницыИзмеренияФакт.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмеренияФакт.Числитель, 1) / ЕСТЬNULL(УпаковкиЕдиницыИзмеренияФакт.Знаменатель, 1) КАК ЧИСЛО(27, 11))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИзделийФакт,
	|	ЕСТЬNULL(ДеревоЗаказа.Требуется, 0) КАК ТребуетсяПоСтрокеЗаказа
	|ПОМЕСТИТЬ СписокЭтаповРазбор
	|ИЗ
	|	СписокЭтапов КАК СписокЭтапов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО СписокЭтапов.ИзделиеЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеревоЗаказа КАК ДеревоЗаказа
	|		ПО СписокЭтапов.ЗаказНаПроизводство = ДеревоЗаказа.ЗаказНаПроизводство
	|			И СписокЭтапов.Номенклатура = ДеревоЗаказа.Номенклатура
	|			И СписокЭтапов.Спецификация = ДеревоЗаказа.Спецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеревоЗаказа КАК ДеревоЗаказа_ТолькоЗаказы
	|		ПО СписокЭтапов.ЗаказНаПроизводство = ДеревоЗаказа_ТолькоЗаказы.ЗаказНаПроизводство
	|			И (ДеревоЗаказа_ТолькоЗаказы.Уровень = 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмеренияФакт
	|		ПО СписокЭтапов.ИзделиеЕдиницаИзмерения = УпаковкиЕдиницыИзмеренияФакт.Ссылка
	|			И СписокЭтапов.ИзделиеЕдиницаИзмеренияФакт = УпаковкиЕдиницыИзмеренияФакт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПлановыеДанные.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВТ_ПлановыеДанные.Подразделение КАК Подразделение,
	|	ВТ_ПлановыеДанные.Этап КАК Этап,
	|	ВТ_ПлановыеДанные.ВидРабот КАК ВидРабот,
	|	СУММА(ВТ_ПлановыеДанные.ПлановоеВремя) КАК ПлановоеВремя,
	|	ВТ_ПлановыеДанные.Изделие КАК Изделие,
	|	ВТ_ПлановыеДанные.ПартияПроизводства КАК ПартияПроизводства
	|ПОМЕСТИТЬ ВТ_ПлановыеДанныеСгруппированные
	|{ВЫБРАТЬ
	|	ЗаказНаПроизводство.*,
	|	Подразделение.*,
	|	Этап.*,
	|	ВидРабот.*,
	|	Изделие.*,
	|	ПартияПроизводства.*,
	|	ПлановоеВремя}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТрудозатратыСтруктурыЗаказа.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		ТрудозатратыСтруктурыЗаказа.Подразделение КАК Подразделение,
	|		ТрудозатратыСтруктурыЗаказа.Этап КАК Этап,
	|		ТрудозатратыСтруктурыЗаказа.ВидРабот КАК ВидРабот,
	|		СУММА(ВЫБОР
	|				КОГДА ТрудозатратыСтруктурыЗаказа.ВидРабот.КратностьТрудоемкости = 0
	|					ТОГДА 0
	|				ИНАЧЕ ТрудозатратыСтруктурыЗаказа.Количество * ТрудозатратыСтруктурыЗаказа.ВидРабот.Трудоемкость / ТрудозатратыСтруктурыЗаказа.ВидРабот.КратностьТрудоемкости
	|			КОНЕЦ) КАК ПлановоеВремя,
	|		ВЫБОР
	|			КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|				ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства.ОсновноеИзделиеНоменклатура
	|			КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Справочник.ЭтапыПроизводства
	|				ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Справочник.ЭтапыПроизводства).Владелец.ОсновноеИзделиеНоменклатура
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Изделие,
	|		ВЫБОР
	|			КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|				ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		КОНЕЦ КАК ПартияПроизводства
	|	{ВЫБРАТЬ
	|		ЗаказНаПроизводство.*,
	|		Подразделение.*,
	|		Этап.*,
	|		ВидРабот.*,
	|		Изделие.*,
	|		ПартияПроизводства.*,
	|		ПлановоеВремя КАК План}
	|	ИЗ
	|		РегистрСведений.ТрудозатратыСтруктурыЗаказа КАК ТрудозатратыСтруктурыЗаказа
	|	ГДЕ
	|		ТрудозатратыСтруктурыЗаказа.ЗаказНаПроизводство В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СписокЭтапов.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|				ИЗ
	|					СписокЭтапов КАК СписокЭтапов)
	|	{ГДЕ
	|		ТрудозатратыСтруктурыЗаказа.ЗаказНаПроизводство.*,
	|		ТрудозатратыСтруктурыЗаказа.Подразделение.*,
	|		ТрудозатратыСтруктурыЗаказа.Этап.*,
	|		ТрудозатратыСтруктурыЗаказа.ВидРабот.*,
	|		(ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства.ОсновноеИзделиеНоменклатура).* КАК Изделие,
	|		(ВЫБОР
	|				КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|					ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			КОНЕЦ).* КАК ПартияПроизводства,
	|		(ВЫБОР
	|				КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|					ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).Статус
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.ПустаяСсылка)
	|			КОНЕЦ В (&СтатусыЭтапа)) КАК Поле2}
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТрудозатратыСтруктурыЗаказа.ЗаказНаПроизводство,
	|		ТрудозатратыСтруктурыЗаказа.Подразделение,
	|		ТрудозатратыСтруктурыЗаказа.Этап,
	|		ТрудозатратыСтруктурыЗаказа.ВидРабот,
	|		ВЫБОР
	|			КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|				ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства.ОсновноеИзделиеНоменклатура
	|			КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Справочник.ЭтапыПроизводства
	|				ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Справочник.ЭтапыПроизводства).Владелец.ОсновноеИзделиеНоменклатура
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ТрудозатратыСтруктурыЗаказа.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|				ТОГДА ВЫРАЗИТЬ(ТрудозатратыСтруктурыЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.Распоряжение,
	|		ЭтапПроизводства2_2Трудозатраты.Подразделение,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка,
	|		ЭтапПроизводства2_2Трудозатраты.ВидРабот,
	|		СУММА(ВЫБОР
	|				КОГДА ЭтапПроизводства2_2Трудозатраты.ВидРабот.КратностьТрудоемкости = 0
	|					ТОГДА 0
	|				ИНАЧЕ ЭтапПроизводства2_2Трудозатраты.Количество * ЭтапПроизводства2_2Трудозатраты.ВидРабот.Трудоемкость / ЭтапПроизводства2_2Трудозатраты.ВидРабот.КратностьТрудоемкости
	|			КОНЕЦ),
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.ПартияПроизводства
	|	ИЗ
	|		Документ.ЭтапПроизводства2_2.Трудозатраты КАК ЭтапПроизводства2_2Трудозатраты
	|	ГДЕ
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.Проведен
	|		И ЭтапПроизводства2_2Трудозатраты.Ссылка.ДинамическаяСтруктура
	|		И НЕ ЭтапПроизводства2_2Трудозатраты.Отменено
	|		И (ЭтапПроизводства2_2Трудозатраты.Выполнено
	|				ИЛИ ЭтапПроизводства2_2Трудозатраты.Ссылка.Статус = &СтатусЭтапаЗавершен)
	|		И ЭтапПроизводства2_2Трудозатраты.Ссылка.Распоряжение В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СписокЭтапов.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|				ИЗ
	|					СписокЭтапов КАК СписокЭтапов)
	|	{ГДЕ
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.Распоряжение.* КАК ЗаказНаПроизводство,
	|		ЭтапПроизводства2_2Трудозатраты.Подразделение.*,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.* КАК Этап,
	|		ЭтапПроизводства2_2Трудозатраты.ВидРабот.*,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.* КАК Изделие,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.ПартияПроизводства.*,
	|		(ЭтапПроизводства2_2Трудозатраты.Ссылка.Статус В (&СтатусыЭтапа)) КАК Поле2}
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЭтапПроизводства2_2Трудозатраты.Подразделение,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка,
	|		ЭтапПроизводства2_2Трудозатраты.ВидРабот,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.ПартияПроизводства,
	|		ЭтапПроизводства2_2Трудозатраты.Ссылка.Распоряжение) КАК ВТ_ПлановыеДанные
	|{ГДЕ
	|	ВТ_ПлановыеДанные.ЗаказНаПроизводство.*,
	|	ВТ_ПлановыеДанные.Подразделение.*,
	|	ВТ_ПлановыеДанные.Этап.*,
	|	ВТ_ПлановыеДанные.ВидРабот.*,
	|	ВТ_ПлановыеДанные.Изделие.*,
	|	ВТ_ПлановыеДанные.ПартияПроизводства.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлановыеДанные.ПартияПроизводства,
	|	ВТ_ПлановыеДанные.Изделие,
	|	ВТ_ПлановыеДанные.ВидРабот,
	|	ВТ_ПлановыеДанные.ЗаказНаПроизводство,
	|	ВТ_ПлановыеДанные.Подразделение,
	|	ВТ_ПлановыеДанные.Этап
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРабот,
	|	ПартияПроизводства,
	|	Подразделение,
	|	Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТрудозатратыКОформлениюОбороты.ПартияПроизводства КАК ПартияПроизводства,
	|	ТрудозатратыКОформлениюОбороты.Подразделение КАК Подразделение,
	|	ТрудозатратыКОформлениюОбороты.ВидРабот КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА ТрудозатратыКОформлениюОбороты.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2
	|			ТОГДА ТрудозатратыКОформлениюОбороты.Распоряжение
	|		КОГДА ТрудозатратыКОформлениюОбороты.Распоряжение ССЫЛКА Документ.ПроизводственнаяОперация2_2
	|			ТОГДА ВЫРАЗИТЬ(ТрудозатратыКОформлениюОбороты.Распоряжение КАК Документ.ПроизводственнаяОперация2_2).Этап
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)
	|	КОНЕЦ КАК Этап,
	|	СУММА(ВЫБОР
	|			КОГДА ТрудозатратыКОформлениюОбороты.ВидРабот.КратностьТрудоемкости = 0
	|				ТОГДА 0
	|			ИНАЧЕ ТрудозатратыКОформлениюОбороты.КоличествоПриход * ТрудозатратыКОформлениюОбороты.ВидРабот.Трудоемкость / ТрудозатратыКОформлениюОбороты.ВидРабот.КратностьТрудоемкости
	|		КОНЕЦ) КАК ФактическоеВремя
	|ПОМЕСТИТЬ ВТ_Трудозатраты
	|ИЗ
	|	РегистрНакопления.ТрудозатратыКОформлению.Обороты(
	|			{(&НачалоПериода)},
	|			{(&КонецПериода)},
	|			,
	|			(ВидРабот, ПартияПроизводства) В
	|				(ВЫБРАТЬ
	|					ВТ_ПлановыеДанныеСгруппированные.ВидРабот КАК ВидРабот,
	|					ВТ_ПлановыеДанныеСгруппированные.ПартияПроизводства КАК ПартияПроизводства
	|				ИЗ
	|					ВТ_ПлановыеДанныеСгруппированные КАК ВТ_ПлановыеДанныеСгруппированные)) КАК ТрудозатратыКОформлениюОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыКОформлениюОбороты.ПартияПроизводства,
	|	ТрудозатратыКОформлениюОбороты.ВидРабот,
	|	ВЫБОР
	|		КОГДА ТрудозатратыКОформлениюОбороты.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2
	|			ТОГДА ТрудозатратыКОформлениюОбороты.Распоряжение
	|		КОГДА ТрудозатратыКОформлениюОбороты.Распоряжение ССЫЛКА Документ.ПроизводственнаяОперация2_2
	|			ТОГДА ВЫРАЗИТЬ(ТрудозатратыКОформлениюОбороты.Распоряжение КАК Документ.ПроизводственнаяОперация2_2).Этап
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТрудозатратыКОформлениюОбороты.Подразделение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства,
	|	ВидРабот,
	|	Подразделение,
	|	Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПлановыеДанныеСгруппированные.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВТ_ПлановыеДанныеСгруппированные.Этап КАК Этап,
	|	СУММА(ВТ_ПлановыеДанныеСгруппированные.ПлановоеВремя) КАК ТрудозатратыПлан,
	|	СУММА(ЕСТЬNULL(ВТ_Трудозатраты.ФактическоеВремя, 0)) КАК ТрудозатратыФакт,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Трудозатраты.ФактическоеВремя, 0) = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(ВТ_ПлановыеДанныеСгруппированные.Этап КАК Документ.ЭтапПроизводства2_2).Статус = &СтатусЭтапаЗавершен
	|							ТОГДА ВТ_ПлановыеДанныеСгруппированные.ПлановоеВремя
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ВТ_ПлановыеДанныеСгруппированные.Этап КАК Документ.ЭтапПроизводства2_2).Статус = &СтатусЭтапаЗавершен
	|						ТОГДА ВТ_ПлановыеДанныеСгруппированные.ПлановоеВремя
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ВТ_Трудозатраты.ФактическоеВремя, 0) >= ВТ_ПлановыеДанныеСгруппированные.ПлановоеВремя
	|								ТОГДА ВТ_ПлановыеДанныеСгруппированные.ПлановоеВремя
	|							ИНАЧЕ ЕСТЬNULL(ВТ_Трудозатраты.ФактическоеВремя, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ТрудозатратыИспользованноеПлановоеВремя
	|ПОМЕСТИТЬ ПлановыеИФактическиеТрудозатраты
	|{ВЫБРАТЬ
	|	ЗаказНаПроизводство.*,
	|	Этап.*,
	|	ТрудозатратыПлан,
	|	ТрудозатратыИспользованноеПлановоеВремя,
	|	ТрудозатратыФакт}
	|ИЗ
	|	ВТ_ПлановыеДанныеСгруппированные КАК ВТ_ПлановыеДанныеСгруппированные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Трудозатраты КАК ВТ_Трудозатраты
	|		ПО ВТ_ПлановыеДанныеСгруппированные.ПартияПроизводства = ВТ_Трудозатраты.ПартияПроизводства
	|			И ВТ_ПлановыеДанныеСгруппированные.ВидРабот = ВТ_Трудозатраты.ВидРабот
	|			И ВТ_ПлановыеДанныеСгруппированные.Этап = ВТ_Трудозатраты.Этап
	|			И ВТ_ПлановыеДанныеСгруппированные.Подразделение = ВТ_Трудозатраты.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлановыеДанныеСгруппированные.Этап,
	|	ВТ_ПлановыеДанныеСгруппированные.ЗаказНаПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокЭтаповРазбор.ОсновноеИзделие КАК СтрокаДереваЗаказа,
	|	СписокЭтаповРазбор.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	СписокЭтаповРазбор.Ссылка КАК Ссылка,
	|	СписокЭтаповРазбор.СтрокаДерева КАК СтрокаДерева,
	|	СписокЭтаповРазбор.Изделий КАК ИзделийВЭтапе,
	|	СписокЭтаповРазбор.Уровень КАК Уровень,
	|	СписокЭтаповРазбор.Номенклатура КАК Номенклатура,
	|	СписокЭтаповРазбор.Номенклатура.Код КАК НоменклатураКод,
	|	СписокЭтаповРазбор.Дата КАК Дата,
	|	СписокЭтаповРазбор.Подразделение КАК Подразделение,
	|	СписокЭтаповРазбор.Статус КАК Статус,
	|	СписокЭтаповРазбор.Назначение КАК Назначение,
	|	СписокЭтаповРазбор.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	СписокЭтаповРазбор.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
	|	СписокЭтаповРазбор.ПланированиеРабот КАК ПланированиеРабот,
	|	СписокЭтаповРазбор.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|	СписокЭтаповРазбор.ИзделиеЕдиницаИзмерения КАК ИзделиеЕдиницаИзмерения,
	|	СписокЭтаповРазбор.ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	|	СписокЭтаповРазбор.Начало КАК Начало,
	|	СписокЭтаповРазбор.Окончание КАК Окончание,
	|	СписокЭтаповРазбор.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
	|	СписокЭтаповРазбор.Просрочен КАК Просрочен,
	|	СписокЭтаповРазбор.ТребуетсяРасчет КАК ТребуетсяРасчет,
	|	СписокЭтаповРазбор.ОформитьВыработку КАК ОформитьВыработку,
	|	СписокЭтаповРазбор.ТребуетсяЗаполнитьПоОперациям КАК ТребуетсяЗаполнитьПоОперациям,
	|	СписокЭтаповРазбор.СостояниеОпераций КАК СостояниеОпераций,
	|	СписокЭтаповРазбор.КодСостоянияОпераций КАК КодСостоянияОпераций,
	|	СписокЭтаповРазбор.Состояние КАК Состояние,
	|	СписокЭтаповРазбор.КодСостояния КАК КодСостояния,
	|	СписокЭтаповРазбор.СостояниеОбеспечения КАК СостояниеОбеспечения,
	|	СписокЭтаповРазбор.ОжидаетсяОбеспечение КАК ОжидаетсяОбеспечение,
	|	СписокЭтаповРазбор.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|	СписокЭтаповРазбор.ПриоритетРаспоряжения КАК ПриоритетРаспоряжения,
	|	СписокЭтаповРазбор.ПриоритетПодразделения КАК ПриоритетПодразделения,
	|	СписокЭтаповРазбор.ОчередьРаспоряжения КАК ОчередьРаспоряжения,
	|	СписокЭтаповРазбор.КоличествоИзделий КАК КоличествоИзделий,
	|	СписокЭтаповРазбор.Спецификация КАК Спецификация,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеИФактическиеТрудозатраты.ТрудозатратыПлан, 0) * ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.Доля, 1) КАК ЧИСЛО(15, 3)) КАК ТрудозатратыПлан,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеИФактическиеТрудозатраты.ТрудозатратыФакт, 0) * ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.Доля, 1) КАК ЧИСЛО(15, 3)) КАК ТрудозатратыФакт,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеИФактическиеТрудозатраты.ТрудозатратыИспользованноеПлановоеВремя, 0) * ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.Доля, 1) КАК ЧИСЛО(15, 3)) КАК ТрудозатратыИспользованноеПлановоеВремя,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СписокЭтаповРазбор.Изделий, 0) * ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.Доля, 1) КАК ЧИСЛО(15, 3)) КАК Изделий,
	|	СписокЭтаповРазбор.ИзделийФакт КАК ИзделийВЭтапеФакт,
	|	НЕ ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.Доля, 1) = 1 КАК Распределять,
	|	ВЫБОР
	|		КОГДА СписокЭтаповРазбор.ИзделиеЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|			ТОГДА 0
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ОкруглятьДо,
	|	ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.ТребуетсяВсего, СписокЭтаповРазбор.Изделий) КАК ТребуетсяВсегоНаИзделие,
	|	ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.Доля, 1) КАК Доля,
	|	ЕСТЬNULL(СписокЭтаповРазбор.СтрокаДерева.ИдСтроки, &ПустойИдентификатор) КАК ИдСтроки,
	|	СписокЭтаповРазбор.ТребуетсяПоСтрокеЗаказа КАК ТребуетсяПоСтрокеЗаказа
	|ИЗ
	|	СписокЭтаповРазбор КАК СписокЭтаповРазбор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеИФактическиеТрудозатраты КАК ПлановыеИФактическиеТрудозатраты
	|		ПО СписокЭтаповРазбор.ЗаказНаПроизводство = ПлановыеИФактическиеТрудозатраты.ЗаказНаПроизводство
	|			И СписокЭтаповРазбор.Ссылка = ПлановыеИФактическиеТрудозатраты.Этап
	|ГДЕ
	|	&ТекстОтборов
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСостояния,
	|	Начало,
	|	НачалоСледующегоЭтапа";
	//|ИТОГИ
	//|	МИНИМУМ(КодСостоянияОпераций),
	//|	СУММА(ТрудозатратыПлан),
	//|	СУММА(ТрудозатратыФакт),
	//|	СУММА(ТрудозатратыИспользованноеПлановоеВремя),
	//|	СУММА(Изделий)
	//|ПО
	//|	СтрокаДереваЗаказа ИЕРАРХИЯ";
	
    Возврат ТекстЗапроса;
КонецФункции // ()

&НаСервере
Функция ПолучитьОсновноеЗначениеСтроки(СтрокаДереваЗаказа)
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДереваЗаказа, "ЗаказНаПроизводство, Номенклатура");
    Если ЗначениеЗаполнено(Реквизиты.Номенклатура) Тогда
	     ОсновноеЗначениеСтроки = Реквизиты.Номенклатура;
	Иначе	
	     ОсновноеЗначениеСтроки = Реквизиты.ЗаказНаПроизводство;
	КонецЕсли;
	
    Возврат ОсновноеЗначениеСтроки;
КонецФункции // ()

&НаКлиентеНаСервереБезКонтекста
Функция СобратьМассивДокументовПоДереву(Форма) 
	ВыделенныеСтроки = Форма.Элементы.Список.ВыделенныеСтроки; 
	Список = Форма.Список;
	МассивДокументов = Новый Массив;
	Для каждого ИдСтроки Из ВыделенныеСтроки Цикл
		СтрокаДерева = Список.НайтиПоИдентификатору(ИдСтроки);   
		СобратьДокументыПоДеревуРекурсивно(Список, МассивДокументов, СтрокаДерева);
	КонецЦикла;
	
    Возврат МассивДокументов;
КонецФункции // ()

&НаКлиентеНаСервереБезКонтекста
Процедура СобратьДокументыПоДеревуРекурсивно(Список, МассивДокументов, ИсходныйУзел)
	Если ЗначениеЗаполнено(ИсходныйУзел.Ссылка) Тогда
		Если МассивДокументов.Найти(ИсходныйУзел.Ссылка) = Неопределено Тогда
			МассивДокументов.Добавить(ИсходныйУзел.Ссылка);
		КонецЕсли;
	Иначе
		СтрокиДерева = ИсходныйУзел.ПолучитьЭлементы();
		Для Каждого ДочерняяСтрока Из СтрокиДерева Цикл
			СобратьДокументыПоДеревуРекурсивно(Список, МассивДокументов, ДочерняяСтрока);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьТаблицуПослеФормирования(ТаблицаРезультат)
	ТаблицаРезультат.Колонки.Добавить("Распределено", Новый ОписаниеТипов("Булево"));
	МассивЗаказов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаРезультат.ВыгрузитьКолонку("ЗаказНаПроизводство"));
	Для каждого Заказ Из МассивЗаказов Цикл
		СтруктураОтбора = Новый Структура("Распределять, ЗаказНаПроизводство", Истина, Заказ);
		СтрокиКРаспределению = ТаблицаРезультат.НайтиСтроки(СтруктураОтбора);
		МассивЭтапов = Новый Массив;
		Для каждого Строка Из СтрокиКРаспределению Цикл 
			Если МассивЭтапов.Найти(Строка.Ссылка) = Неопределено Тогда
			     МассивЭтапов.Добавить(Строка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		Для каждого Этап Из МассивЭтапов Цикл
			СтруктураОтбора.Вставить("Ссылка", Этап); 
			СтруктураОтбора.Вставить("Распределено", ЛОжь); 
			СтрокиКРаспределению = ТаблицаРезультат.НайтиСтроки(СтруктураОтбора);
			Если СтрокиКРаспределению.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПараметров = СтрокиКРаспределению[0]; 
			ИзделийВЭтапе = СтрокаПараметров.ИзделийВЭтапе;
			ОкруглятьДо = СтрокаПараметров.ОкруглятьДо;
			МассивДоли = Новый Массив;
			Для каждого СтрокаКРаспределению Из СтрокиКРаспределению Цикл
				МассивДоли.Добавить(СтрокаКРаспределению.ТребуетсяПоСтрокеЗаказа);
			КонецЦикла;
			МассивКоличество = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(ИзделийВЭтапе,
				МассивДоли, ОкруглятьДо); 
			
			Для Индекс = 0 По СтрокиКРаспределению.Количество() - 1 Цикл 
				Количество = МассивКоличество[Индекс];
				Если ЗначениеЗаполнено(МассивКоличество) Тогда
		    		СтрокиКРаспределению[Индекс].Изделий = Количество;
		    		СтрокиКРаспределению[Индекс].ТребуетсяПоСтрокеЗаказа = СтрокиКРаспределению[Индекс].ТребуетсяПоСтрокеЗаказа - Количество;
					СтрокиКРаспределению[Индекс].Распределено = (СтрокиКРаспределению[Индекс].ТребуетсяПоСтрокеЗаказа = 0);
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьДеревоПослеФормирования(ДеревоРезультат) 
	//ДеревоЗаказа.Колонки.Добавить("Остаток", Новый ОписаниеТипов("Число"));
	ДеревоРезультат.Колонки.Добавить("Распределено", Новый ОписаниеТипов("Булево"));
	СтрокиЗаказов = ДеревоРезультат.Строки;    // уровень 0
	Для каждого СтрокаЗаказа Из СтрокиЗаказов Цикл
		Заказ = СтрокаЗаказа.СтрокаДереваЗаказа.ЗаказНаПроизводство;  
		СтрокиТекущегоЗаказа = СтрокаЗаказа.Строки;
		СтруктураОтбора = Новый Структура("Распределять, ЗаказНаПроизводство", Заказ, Истина);
		СтрокиКРаспределению = СтрокиТекущегоЗаказа.НайтиСтроки(СтруктураОтбора, Истина);
		МассивЭтапов = Новый Массив;
		Для каждого Строка Из СтрокиКРаспределению Цикл 
			Если МассивЭтапов.Найти(Строка.Ссылка) = Неопределено Тогда
			     МассивЭтапов.Добавить(Строка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		Для каждого Этап Из МассивЭтапов Цикл
			СтруктураОтбора.Вставить("Ссылка", Этап); 
			СтруктураОтбора.Вставить("Распределено", ЛОжь); 
			СтрокиКРаспределению = СтрокиТекущегоЗаказа.НайтиСтроки(СтруктураОтбора, Истина);
			Если СтрокиКРаспределению.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПараметров = СтрокиКРаспределению[0]; 
			ИзделийВЭтапе = СтрокаПараметров.ИзделийВЭтапе;
			ОкруглятьДо = СтрокаПараметров.ОкруглятьДо;
			МассивДоли = Новый Массив;
			Для каждого СтрокаКРаспределению Из СтрокиКРаспределению Цикл
				МассивДоли.Добавить(СтрокаКРаспределению.ТребуетсяПоСтрокеЗаказа);
			КонецЦикла;
			МассивКоличество = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(ИзделийВЭтапе,
				МассивДоли, ОкруглятьДо); 
			
			Для Индекс = 0 По СтрокиКРаспределению.Количество() - 1 Цикл 
				Количество = МассивКоличество[Индекс];
				Если ЗначениеЗаполнено(МассивКоличество) Тогда
		    		СтрокиКРаспределению[Индекс].Изделий = Количество;
		    		СтрокиКРаспределению[Индекс].ТребуетсяПоСтрокеЗаказа = СтрокиКРаспределению[Индекс].ТребуетсяПоСтрокеЗаказа - Количество;
					СтрокиКРаспределению[Индекс].Распределено = (СтрокиКРаспределению[Индекс].ТребуетсяПоСтрокеЗаказа = 0);
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
	//	СоответствиеНоменклатур =  Новый Соответствие;
	//	Для каждого Строка Из  СтрокиКРаспределению Цикл
	//		РеквизитыТекущейСтрокиДереваЗаказа = ОбщегоНазначения.
	//		КлючНоменклатура_Этап = ПолучитьКлючНоменклатура_Этап(Строка); 
	//		
	//		ДанныеПоНоменклатуре = СоответствиеНоменклатур[КлючНоменклатура_Этап];
	//		Если ДанныеПоНоменклатуре = Неопределено Тогда
	//		    СтруктураДанныхРасчета = ПолучитьСтруктуруДанныхДляРасчетаПоСтрокеДерева(Строка);	
	//		Иначе	
	//		    СтруктураДанныхРасчета = ДанныеПоНоменклатуре.СтруктураДанныхРасчета;
	//		КонецЕсли;
	//		СтруктураДанныхРасчета.МассивДоли.Добавить(Строка.Доля);
	//		СтруктураДанныхРасчета.МассивТребуетсяПоСтрокеЗаказа.Добавить(Строка.ТребуетсяПоСтрокеЗаказа);
	//		
	//		СоответствиеНоменклатур.Вставить(Строка.Номенклатура, Строка.ТребуетсяВсегоНаИзделие); 
	//	КонецЦикла;  
	//	
	//	МассивНоменклат
	//
	//КонецЦикла;                                 
	
	ДеревоРезультат.Колонки.Удалить("ТребуетсяПоСтрокеЗаказа");
	ДеревоРезультат.Колонки.Удалить("Распределено");

КонецПроцедуры 

Функция ПолучитьДеревоИзТаблицы(ТаблицаРезультат)
	Запрос = Новый Запрос;
    Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРезультат.СтрокаДереваЗаказа КАК СтрокаДереваЗаказа,
	|	ТаблицаРезультат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаРезультат.Ссылка КАК Ссылка,
	|	ТаблицаРезультат.СтрокаДерева КАК СтрокаДерева,
	|	ТаблицаРезультат.ИзделийВЭтапе КАК ИзделийВЭтапе,
	|	ТаблицаРезультат.Уровень КАК Уровень,
	|	ТаблицаРезультат.Номенклатура КАК Номенклатура,
	|	ТаблицаРезультат.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаРезультат.Дата КАК Дата,
	|	ТаблицаРезультат.Подразделение КАК Подразделение,
	|	ТаблицаРезультат.Статус КАК Статус,
	|	ТаблицаРезультат.Назначение КАК Назначение,
	|	ТаблицаРезультат.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	ТаблицаРезультат.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
	|	ТаблицаРезультат.ПланированиеРабот КАК ПланированиеРабот,
	|	ТаблицаРезультат.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|	ТаблицаРезультат.ИзделиеЕдиницаИзмерения КАК ИзделиеЕдиницаИзмерения,
	|	ТаблицаРезультат.ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	|	ТаблицаРезультат.Начало КАК Начало,
	|	ТаблицаРезультат.Окончание КАК Окончание,
	|	ТаблицаРезультат.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
	|	ТаблицаРезультат.Просрочен КАК Просрочен,
	|	ТаблицаРезультат.ТребуетсяРасчет КАК ТребуетсяРасчет,
	|	ТаблицаРезультат.ОформитьВыработку КАК ОформитьВыработку,
	|	ТаблицаРезультат.ТребуетсяЗаполнитьПоОперациям КАК ТребуетсяЗаполнитьПоОперациям,
	|	ТаблицаРезультат.СостояниеОпераций КАК СостояниеОпераций,
	|	ТаблицаРезультат.КодСостоянияОпераций КАК КодСостоянияОпераций,
	|	ТаблицаРезультат.Состояние КАК Состояние,
	|	ТаблицаРезультат.КодСостояния КАК КодСостояния,
	|	ТаблицаРезультат.СостояниеОбеспечения КАК СостояниеОбеспечения,
	|	ТаблицаРезультат.ОжидаетсяОбеспечение КАК ОжидаетсяОбеспечение,
	|	ТаблицаРезультат.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|	ТаблицаРезультат.ПриоритетРаспоряжения КАК ПриоритетРаспоряжения,
	|	ТаблицаРезультат.ПриоритетПодразделения КАК ПриоритетПодразделения,
	|	ТаблицаРезультат.ОчередьРаспоряжения КАК ОчередьРаспоряжения,
	|	ТаблицаРезультат.КоличествоИзделий КАК КоличествоИзделий,
	|	ТаблицаРезультат.Спецификация КАК Спецификация,
	|	ТаблицаРезультат.ТрудозатратыПлан КАК ТрудозатратыПлан,
	|	ТаблицаРезультат.ТрудозатратыФакт КАК ТрудозатратыФакт,
	|	ТаблицаРезультат.ТрудозатратыИспользованноеПлановоеВремя КАК ТрудозатратыИспользованноеПлановоеВремя,
	|	ТаблицаРезультат.Изделий КАК Изделий,
	|	ТаблицаРезультат.ИзделийВЭтапеФакт КАК ИзделийВЭтапеФакт,
	|	ТаблицаРезультат.Доля КАК Доля,
	|	ТаблицаРезультат.Распределять КАК Распределять,
	|	ТаблицаРезультат.ОкруглятьДо КАК ОкруглятьДо,
	|	ТаблицаРезультат.ТребуетсяВсегоНаИзделие КАК ТребуетсяВсегоНаИзделие,
	|	ТаблицаРезультат.ИдСтроки КАК ИдСтроки,
	|	ТаблицаРезультат.ТребуетсяПоСтрокеЗаказа КАК ТребуетсяПоСтрокеЗаказа
	|ПОМЕСТИТЬ ТаблицаРезультат
	|ИЗ
	|	&ТаблицаРезультат КАК ТаблицаРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезультат.СтрокаДереваЗаказа КАК СтрокаДереваЗаказа,
	|	ТаблицаРезультат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаРезультат.Ссылка КАК Ссылка,
	|	ТаблицаРезультат.СтрокаДерева КАК СтрокаДерева,
	|	ТаблицаРезультат.ИзделийВЭтапе КАК ИзделийВЭтапе,
	|	ТаблицаРезультат.Уровень КАК Уровень,
	|	ТаблицаРезультат.Номенклатура КАК Номенклатура,
	|	ТаблицаРезультат.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаРезультат.Дата КАК Дата,
	|	ТаблицаРезультат.Подразделение КАК Подразделение,
	|	ТаблицаРезультат.Статус КАК Статус,
	|	ТаблицаРезультат.Назначение КАК Назначение,
	|	ТаблицаРезультат.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	ТаблицаРезультат.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
	|	ТаблицаРезультат.ПланированиеРабот КАК ПланированиеРабот,
	|	ТаблицаРезультат.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|	ТаблицаРезультат.ИзделиеЕдиницаИзмерения КАК ИзделиеЕдиницаИзмерения,
	|	ТаблицаРезультат.ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	|	ТаблицаРезультат.Начало КАК Начало,
	|	ТаблицаРезультат.Окончание КАК Окончание,
	|	ТаблицаРезультат.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
	|	ТаблицаРезультат.Просрочен КАК Просрочен,
	|	ТаблицаРезультат.ТребуетсяРасчет КАК ТребуетсяРасчет,
	|	ТаблицаРезультат.ОформитьВыработку КАК ОформитьВыработку,
	|	ТаблицаРезультат.ТребуетсяЗаполнитьПоОперациям КАК ТребуетсяЗаполнитьПоОперациям,
	|	ТаблицаРезультат.СостояниеОпераций КАК СостояниеОпераций,
	|	ТаблицаРезультат.КодСостоянияОпераций КАК КодСостоянияОпераций,
	|	ТаблицаРезультат.Состояние КАК Состояние,
	|	ТаблицаРезультат.КодСостояния КАК КодСостояния,
	|	ТаблицаРезультат.СостояниеОбеспечения КАК СостояниеОбеспечения,
	|	ТаблицаРезультат.ОжидаетсяОбеспечение КАК ОжидаетсяОбеспечение,
	|	ТаблицаРезультат.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|	ТаблицаРезультат.ПриоритетРаспоряжения КАК ПриоритетРаспоряжения,
	|	ТаблицаРезультат.ПриоритетПодразделения КАК ПриоритетПодразделения,
	|	ТаблицаРезультат.ОчередьРаспоряжения КАК ОчередьРаспоряжения,
	|	ТаблицаРезультат.КоличествоИзделий КАК КоличествоИзделий,
	|	ТаблицаРезультат.Спецификация КАК Спецификация,
	|	ТаблицаРезультат.ТрудозатратыПлан КАК ТрудозатратыПлан,
	|	ТаблицаРезультат.ТрудозатратыФакт КАК ТрудозатратыФакт,
	|	ТаблицаРезультат.ТрудозатратыИспользованноеПлановоеВремя КАК ТрудозатратыИспользованноеПлановоеВремя,
	|	ТаблицаРезультат.Изделий КАК Изделий,
	|	ТаблицаРезультат.ИзделийВЭтапеФакт КАК ИзделийВЭтапеФакт,
	|	ТаблицаРезультат.Доля КАК Доля,
	|	ТаблицаРезультат.Распределять КАК Распределять,
	|	ТаблицаРезультат.ОкруглятьДо КАК ОкруглятьДо,
	|	ТаблицаРезультат.ТребуетсяВсегоНаИзделие КАК ТребуетсяВсегоНаИзделие,
	|	ТаблицаРезультат.ИдСтроки КАК ИдСтроки,
	|	ТаблицаРезультат.ТребуетсяПоСтрокеЗаказа КАК ТребуетсяПоСтрокеЗаказа
	|ИЗ
	|	ТаблицаРезультат КАК ТаблицаРезультат
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСостояния,
	|	Начало,
	|	НачалоСледующегоЭтапа
	|ИТОГИ
	|	МИНИМУМ(КодСостоянияОпераций),
	|	СУММА(ТрудозатратыПлан),
	|	СУММА(ТрудозатратыФакт),
	|	СУММА(ТрудозатратыИспользованноеПлановоеВремя),
	|	СУММА(Изделий)
	|ПО
	|	СтрокаДереваЗаказа ИЕРАРХИЯ";
	
    Запрос.УстановитьПараметр("ТаблицаРезультат", ТаблицаРезультат);  
	ДеревоРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Возврат ДеревоРезультат;
КонецФункции // ()
#КонецОбласти

#КонецОбласти
