#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   КлючВарианта - Строка - Ключ варианта
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - из:
//    *Менеджер - Строка -
//    *Представление - Строка -
//    *МножественныйВыбор - Булево - 
//    *Важность - Строка -
//    *КлючВарианта - Строка -
Функция ДобавитьКомандуОтчета(КомандыОтчетов, КлючВарианта = "") Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.юум_ТрудоемкостьЗаказаНаПроизводствоПоИзделиям) 
			И ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.юум_ТрудоемкостьЗаказаНаПроизводствоПоИзделиям.ПолноеИмя();
		
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Обычное";
		Если ЗначениеЗаполнено(КлючВарианта) Тогда
			КомандаОтчет.КлючВарианта = КлючВарианта;
		КонецЕсли;
		
		Если КлючВарианта = "юум_ТрудоемкостьЗаказаНаПроизводствоПоИзделиям" Тогда
			
			КомандаОтчет.Представление = НСтр("ru = 'Трудоемкость заказа по изделиям (юум)';
												|en = 'Order labor input by items'");
			
		КонецЕсли;
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.юум_ТрудоемкостьЗаказаНаПроизводствоПоИзделиям);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "юум_ТрудоемкостьЗаказаНаПроизводствоПоИзделиям");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Трудоемкость заказа на производство по изделиям';
										|en = 'Order labor input by items'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка состояния заказа на производство, его изделий, узлов и деталей по плановым и фактическим трудозатратам.';
									|en = 'Evaluate the state of production orders, its products, assemblies, and parts by planned and actual labor costs.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
		
#КонецЕсли