
#Область ПрограммныйИнтерфейс

// Процедура корректно снимает АвтоОтметкуНезаполненного для элемента формы 
// Параметры:
//  Элемент - ЭлементФормы - элемент формы, для которого проихводится действие
//  ОбязательноеЗаполнение - Булево - признак обязательного заполнения
Процедура УстановитьАвтоОтметкуЗаполненияЭлемента(Элемент, ОбязательноеЗаполнение) Экспорт
	
	СтараяАвтоОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного;
	
	Элемент.АвтоОтметкаНезаполненного = ОбязательноеЗаполнение;
	
	// Выключение свойства АвтоОтметкаНезаполненного, т.е. перевод его значения из Истина в Ложь, 
	// не приводит к изменению текущего значения свойства ОтметкаНезаполненного.
	Если СтараяАвтоОтметкаНезаполненного = Истина И Элемент.АвтоОтметкаНезаполненного <> Истина Тогда
		Элемент.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 