
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = ПолучитьТекстЗапроса();
	
	ЭлементСписок = Элементы.Список;
	
	юум_РаботаСФормой.СоздатьПолеФормы(Элементы, "Спецификация", НСтр("ru = 'Спецификация'"), "Список.Спецификация",
		ВидПоляФормы.ПолеВвода, ЭлементСписок);
	
	юум_РаботаСФормой.СоздатьПолеФормы(Элементы, "Изделие", НСтр("ru = 'Изделие'"), "Список.Изделие",
		ВидПоляФормы.ПолеВвода, ЭлементСписок);
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьТекстЗапроса()
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДоступностьВидовРабочихЦентров.Период КАК Период,
	|	ДоступностьВидовРабочихЦентров.Регистратор КАК Регистратор,
	|	ДоступностьВидовРабочихЦентров.НомерСтроки КАК НомерСтроки,
	|	ДоступностьВидовРабочихЦентров.Активность КАК Активность,
	|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ДоступностьВидовРабочихЦентров.ДатаИнтервала КАК ДатаИнтервала,
	|	ДоступностьВидовРабочихЦентров.Занято КАК Занято,
	|	ДоступностьВидовРабочихЦентров.ДоступностьПоВидуРЦ КАК ДоступностьПоВидуРЦ,
	|	ДоступностьВидовРабочихЦентров.ДоступностьПоРЦ КАК ДоступностьПоРЦ,
	|	ДоступностьВидовРабочихЦентров.МаксимальнаяДоступность КАК МаксимальнаяДоступность,
	|	ДоступностьВидовРабочихЦентров.МаксимальнаяДоступностьПоВидуРЦ КАК МаксимальнаяДоступностьПоВидуРЦ,
	|	ДоступностьВидовРабочихЦентров.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ДоступностьВидовРабочихЦентров.КодСтрокиЭтапыГрафик КАК КодСтрокиЭтапыГрафик,
	|	ДоступностьВидовРабочихЦентров.ВариантНаладки КАК ВариантНаладки,
	|	ДоступностьВидовРабочихЦентров.ЭтоДвижениеВводаДоступности КАК ЭтоДвижениеВводаДоступности,
	|	ДоступностьВидовРабочихЦентров.ЭтоДвижениеЗаказаНаПроизводство КАК ЭтоДвижениеЗаказаНаПроизводство,
	|	ДоступностьВидовРабочихЦентров.ЭтоДвижениеМаршрутногоЛиста КАК ЭтоДвижениеМаршрутногоЛиста,
	|	ДоступностьВидовРабочихЦентров.Распоряжение КАК Распоряжение,
	|	ДоступностьВидовРабочихЦентров.Подразделение КАК Подразделение,
	|	ДоступностьВидовРабочихЦентров.Смена КАК Смена,
	|	ДоступностьВидовРабочихЦентров.КлючПартия КАК КлючПартия,
	|	ДоступностьВидовРабочихЦентров.Этап КАК Этап,
	|	ВЫБОР
	|		КОГДА ДоступностьВидовРабочихЦентров.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|			ТОГДА ДоступностьВидовРабочихЦентров.Этап.Спецификация
	|		КОГДА ДоступностьВидовРабочихЦентров.Этап ССЫЛКА Справочник.ЭтапыПроизводства
	|			ТОГДА ДоступностьВидовРабочихЦентров.Этап.Владелец
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|	КОНЕЦ КАК Спецификация,
	|	ВЫБОР
	|		КОГДА ДоступностьВидовРабочихЦентров.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|			ТОГДА ДоступностьВидовРабочихЦентров.Этап.Спецификация.ОсновноеИзделиеНоменклатура
	|		КОГДА ДоступностьВидовРабочихЦентров.Этап ССЫЛКА Справочник.ЭтапыПроизводства
	|			ТОГДА ДоступностьВидовРабочихЦентров.Этап.Владелец.ОсновноеИзделиеНоменклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Изделие
	|ИЗ
	|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров";	
	Возврат  ТекстЗапроса;
КонецФункции // ()
#КонецОбласти