#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.3.548");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия = "001";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	//Команда = ПараметрыРегистрации.Команды.Добавить();
	//Команда.Представление = НСтр("ru = 'Загрузить данные из Интермех по расписанию'");
	//Команда.Идентификатор = "ЗагрузитьОраРЗ";
	//Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	//Команда.ПоказыватьОповещение = Ложь;
	
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = 'Загрузить номенклатуру из Интермех интерактивно'");
    Команда.Идентификатор = "ЗагрузитьОраИнтерактивно";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;

	Возврат ПараметрыРегистрации; 
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения) Экспорт
	
	ЗагрузитьНоменклатуру();
		
КонецПроцедуры

Функция Подключение() Экспорт 

	Connection = Новый COMОбъект("ADODB.Connection");
	сс = СформироватьСтрокуСоединения();
	Connection.ConnectionString = сс;

	Попытка
		Connection.Open();
		//Команда = 
		//"BEGIN 
		//| execute immediate 'ALTER SESSION SET current_schema = XXSI'; 
		//|END;";
		//Connection.Execute(Команда);
	Исключение
		Сообщить ("Проблемы с подключением к SQL !" );
		текст = ОписаниеОшибки();
		Сообщить(текст);
		Connection = Неопределено;
		Возврат Ложь;	
	КонецПопытки;

	Возврат Истина;
	
КонецФункции 

Процедура Отключение(Сообщить = Истина) Экспорт 

	Если Connection <> Неопределено Тогда
		Connection.Close();	
		Connection = Неопределено;	
	КонецЕсли;	
	
КонецПроцедуры 

Функция СформироватьСтрокуСоединения() Экспорт
	
	Возврат юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("СтрокаСоединенияIntermech");
	//Струк = _омОбщегоНазначения.ПолучитьГлобальноеЗначениеСАвторизацией("СтрокаСоединенияИнтермех");
	//
	//Если Струк.ЕстьДанные Тогда
	//	Значение = СтрЗаменить(Струк.Значение, "%usr%", Струк.Логин);
	//	Значение = СтрЗаменить(Значение, "%psw%", Струк.Пароль);
	//Иначе
	//	Значение = "";
	//КонецЕсли;
	//
	//Возврат Значение;
	
КонецФункции

Функция НайтиНоменклатуру(ИД)

	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("гф_КодИнтермех", ИД);

КонецФункции

Функция ЕстьИзменения(ном1, ном2)
	
	#Если Призрак Тогда
	ном1 = Справочники.Номенклатура.НайтиПоКоду(1);	
	#КонецЕсли	
	
	Если ном1.Наименование <> ном2.Наименование 
		ИЛИ ном1.НаименованиеПолное <> ном2.НаименованиеПолное 
		ИЛИ ном1.ЕдиницаИзмерения <> ном2.ЕдиницаИзмерения 
		ИЛИ ном1.ВесЧислитель <> ном2.ВесЧислитель
		ИЛИ ном1.ВидНоменклатуры <> ном2.ВидНоменклатуры
		ИЛИ ном1.Родитель <> ном2.Родитель
		ИЛИ ном1.ВесЕдиницаИзмерения <> ном2.ВесЕдиницаИзмерения
		//ИЛИ ном1. <> ном2.
		
	Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Процедура ЗагрузитьНоменклатуру(Орск = Истина, ЗаписыватьНеИзмененные = Ложь) Экспорт 

	Подключение();
	КЭШ = Новый Структура;
	юум_Интеграция.ЗаполнитьКЭШНоменклатуры(КЭШ);
	
	RS = Новый COMОбъект("ADODB.Recordset");
	
	ТекстЗапроса = 
	"SELECT * FROM intr..USER1C.NMK_SEARCH_NIGHT_ORSK ORDER BY DESIGNATIO";
	Попытка
		RS.Open(ТекстЗапроса, Connection);
	Исключение
		Сообщить ("Проблемы с выполнением запроса к SQL !");
		Сообщить (ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	сч = 0;
	КоличествоНоменклатур = 100;
	Пока RS.EOF() = 0 Цикл
		
		сч = сч + 1;
		//Если сч > КоличествоНоменклатур Тогда ПРЕРВАТЬ;	КонецЕсли;
		
		ИД = Поле(RS, "DESIGNATIO");
		Если СтрДлина(ИД) > 19 Тогда
			ИД = Лев(ИД, 19);		
		КонецЕсли;
		
		ТекОб = Неопределено;
		сс = Справочники.Номенклатура.НайтиПоКоду(ИД);
		Если НЕ сс.Пустая() Тогда
			ТекОб = сс.ПолучитьОбъект();
		КонецЕсли;
		об = юум_Интеграция.ОбъектНоменклатуры(КЭШ, RS, Истина, ТекОб);
		
		Если НЕ сс.Пустая() И НЕ ЗаписыватьНеИзмененные Тогда
			
			Если НЕ ЕстьИзменения(сс, об) Тогда
		  		Перейти ~Дальше;		
			КонецЕсли;
				
		КонецЕсли;
		
		об.Записать();		
		
		~Дальше:
		RS.MoveNext();

	КонецЦикла;
	
	RS.Close();
	Отключение();
	
КонецПроцедуры

Функция Поле(RS, Имя)

	п = RS.Fields(Имя);	
	Если п.Type = 200 ИЛИ п.Type = 202 Тогда
		//строка
		Возврат СокрЛП(п.Value);		
	ИначеЕсли п.Type = 139 Тогда		
		// число
		Возврат Формат(п.Value, "ЧГ=0");	
	КонецЕсли;
	
КонецФункции 

#КонецЕсли	