
#Область СлужебныйПрограммныйИнтерфейс

#Область ДобавлениеЭлементовФормы

#Область КнопкиИКомандыФормы

// Создает новую кнопку формы с одновремнным создаением одноименной команды для нее
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания элемента
//  Имя - Строка - Имя добавляемой кнопки
//  Родитель - ЭлементФормы - Родитель размещения кнопки
//  Картинка - Картинка - Картинка действия кнопки
//  Отображение - ОтображениеКнопки - Отображение текста и картинки кнопки
//  Заголовок - Строка - Заголовок 
//  Вид - ВидКнопкиФормы - Вид создаваемой кнопки
//  ДополнительныеПараметры - Структура - Дополнительные параметры создаваемого элемента
// 
// Возвращаемое значение:
//  КнопкаФормы - Созданный элемент формы
Функция ДобавитьКнопкуФормы(Форма,
							Имя,
							Родитель = Неопределено,
							Картинка = Неопределено,
							Отображение = Неопределено,
							Заголовок = "",
							Вид = Неопределено,
							ДополнительныеПараметры = Неопределено) Экспорт

	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("Имя", Имя);
	ПараметрыЭлемента.Вставить("Действие", Имя);
	ПараметрыЭлемента.Вставить("Картинка", Картинка);
	ПараметрыЭлемента.Вставить("Отображение", Отображение);
	Команда = СоздатьКоманду(Форма, ПараметрыЭлемента.Имя, "", ПараметрыЭлемента.Действие, ПараметрыЭлемента.Картинка, ПараметрыЭлемента.Отображение);
	
	Если Команда = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("Подсказка") Тогда
		Команда.Подсказка = ДополнительныеПараметры.Подсказка;
	КонецЕсли;
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("Родитель", Родитель);
	ПараметрыЭлемента.Вставить("Имя", Имя);
	ПараметрыЭлемента.Вставить("ИмяКоманды", Имя);
	ПараметрыЭлемента.Вставить("Заголовок", Заголовок);
	ПараметрыЭлемента.Вставить("Вид", Вид);
	ПараметрыЭлемента.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Возврат СоздатьКнопкуФормы(Форма.Элементы, 
		ПараметрыЭлемента.Имя, 
		ПараметрыЭлемента.Заголовок, 
		ПараметрыЭлемента.ИмяКоманды, 
		ПараметрыЭлемента.Вид, 
		ПараметрыЭлемента.Родитель,,
		ПараметрыЭлемента.ДополнительныеПараметры);

КонецФункции

// Создает новую команду формы в случае ее отсутствия, иначе возвращается существующий на форме элемент
// Альтернативный вариант сигнатуры См. СоздатьКоманду
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания команды
//  Имя - Строка - Имя создаваемой команды
//  Заголовок - Строка - Заголовок создаваемой команды
//  Действие - Строка - Имя действия команды
//  Картинка - Картинка - Картинка, отображающаяся на кнопках, привязанных к команде
//  Отображение - ОтображениеКнопки - Указывает вид отображения связанной кнопки
// 
// Возвращаемое значение:
//  КомандаФормы - Созданная команда
Функция ДобавитьКоманду(Форма,
						Имя,
						Заголовок,
						Действие,
						Картинка = Неопределено,
						Отображение = Неопределено) Экспорт

	Возврат СоздатьКоманду(Форма, Имя, Заголовок, Действие, Картинка, Отображение);
		
КонецФункции

#КонецОбласти

#Область РеквизитыФормы

// Проверяет существование реквизита формы, и если он отсутствует, создает
//  и добавляет его в массив ДобавляемыеРеквизиты.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания элемента
//  ДобавляемыеРеквизиты - Массив - массив реквизитов формы, в который будет добавлен реквизит.
//  ПараметрыРеквизита - Структура - Параметры для создания реквизита
//
Процедура СоздатьРеквизитФормы(Форма, ДобавляемыеРеквизиты, ПараметрыРеквизита) Экспорт
	
	Если НЕ ПроверитьПараметрыДляСозданияЭлемента(ПараметрыРеквизита) Тогда
		Возврат;
	КонецЕсли;

	Параметры = КонструкторПараметрыРеквизитФормы();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыРеквизита);

	СоздатьДобавитьРеквизитФормы(
		Форма,
		ДобавляемыеРеквизиты,
		Параметры.Имя,
		Параметры.ТипРеквизита,
		Параметры.Путь,
		Параметры.Заголовок,
		Параметры.СохраняемыеДанные
	);
	
КонецПроцедуры

// Проверяет существование реквизита формы, и если он отсутствует, создает
//  и добавляет его в массив ДобавляемыеРеквизиты.
// Альтернативная сигнатура см. СоздатьРеквизитФормы
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания элемента
//  ДобавляемыеРеквизиты - Массив - массив реквизитов формы, в который будет добавлен реквизит.
//  ИмяРеквизита - Строка - Имя добавляемого реквизита
//  ТипРеквизита - Строка - Имя типа создаваемого реквизита
//  Путь - Строка - Путь к данным
//  Заголовок - Строка - Заголовок реквизита
//  СохраняемыеДанные - Булево - Признак Сохраняемые данные
Процедура ДобавитьРеквизитФормы(Форма,
								ДобавляемыеРеквизиты,
								ИмяРеквизита,
								ТипРеквизита = Неопределено,
								Путь = "",
								Заголовок = "",
								СохраняемыеДанные = Ложь) Экспорт
	
	ПараметрыРеквизита = Новый Структура;
	ПараметрыРеквизита.Вставить("Имя", ИмяРеквизита);
	ПараметрыРеквизита.Вставить("ТипРеквизита", ТипРеквизита);
	ПараметрыРеквизита.Вставить("Путь", Путь);
	ПараметрыРеквизита.Вставить("Заголовок", Заголовок);
	ПараметрыРеквизита.Вставить("СохраняемыеДанные", СохраняемыеДанные);
	СоздатьРеквизитФормы(Форма, ДобавляемыеРеквизиты, ПараметрыРеквизита);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КонструкторыПараметровНовыхЭлементов

// Формирует параметры для создания группы формы.
// 
// Параметры:
//  Имя - Строка - Имя создаваемой группы
//  Заголовок - Строка - Заголовок
//  Родитель - ГруппаФормы, ФормаКлиентскогоПриложения - Родитель нового элемента
// 
// Возвращаемое значение:
//  Структура - Параметры для создания группы формы:
// * Имя - Строка - Имя
// * Родитель - ГруппаФормы, ФормаКлиентскогоПриложения - Родитель нового элемента
// * Вид - ВидГруппыФормы - Вид группы формы
// * Заголовок - Строка - Заголовок
// * ВставитьПередЭлементом - ЭлементФормы - Элемент формы, перед которым разместить новый элемент
// * ДополнительныеПараметры - Структура - ДополнительныеПараметры
// * События - Массив - Массив событий
Функция КонструкторПараметрыГруппаФормы(Имя = "", Заголовок = "", Родитель = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	// Обязательные параметры к заполнению
	Параметры.Вставить("Имя", Имя);
	
	// Не обязательные параметры к заполнению
	Параметры.Вставить("Родитель", Родитель);
	Параметры.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	Параметры.Вставить("Заголовок", Заголовок);
	Параметры.Вставить("ВставитьПередЭлементом", Неопределено);
	Параметры.Вставить("ДополнительныеПараметры", Новый Структура);
	Параметры.Вставить("События", Неопределено);
	
	Возврат Параметры;
	
КонецФункции

// Формирует параметры для создания поля формы.
// 
// Параметры:
//  Имя - Строка - Имя создаваемого элемента
//  ПутьКДанным - Строка - Путь к данным
//  Родитель - ГруппаФормы, ФормаКлиентскогоПриложения - Родитель нового элемента
// 
// Возвращаемое значение:
//  Структура - Конструктор параметры поля формы:
// * Имя - Строка - Имя
// * ПутьКДанным - Строка - Путь к данным
// * Родитель - ГруппаФормы - Родитель нового элемента
// * Вид - ВидПоляФормы - Вид группы формы
// * Заголовок - Строка - Заголовок
// * ВставитьПередЭлементом - ЭлементФормы - Элемент формы, перед которым разместить новый элемент
// * ДополнительныеПараметры - Структура - ДополнительныеПараметры
// * События - Структура - События элемента:
// ** Ключ - Строка - Имя события
// ** Значение - Строка - Имя метода действия
// * Подсказка - Строка - Подсказка
Функция КонструкторПараметрыПоляФормы(Имя = "", ПутьКДанным = "", Родитель = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	// Обязательные параметры к заполнению
	Параметры.Вставить("Имя", 						Имя);
	Параметры.Вставить("ПутьКДанным", 				ПутьКДанным);
	
	// Не обязательные параметры к заполнению
	Параметры.Вставить("Родитель", 					Родитель);
	Параметры.Вставить("Вид", 						ВидПоляФормы.ПолеВвода);
	Параметры.Вставить("Заголовок", 				"");
	Параметры.Вставить("ВставитьПередЭлементом", 	Неопределено);
	Параметры.Вставить("ДополнительныеПараметры", 	Новый Структура);
	Параметры.Вставить("События", 					Новый Структура);
	Параметры.Вставить("Подсказка", 				"");
	
	Возврат Параметры;
	
КонецФункции

// Формирует параметры для создания команды формы.
// 
// Параметры:
//  Имя - Строка - Имя создаваемого элемента
//  Действие - Строка - Имя действия
//  Заголовок - Строка - Заголовок команды
// 
// Возвращаемое значение:
//  Структура - Конструктор параметры команды формы:
// * Имя - Строка - Имя
// * Действие - Строка - Действие
// * Заголовок - Строка - Заголовок
// * Картинка - ОбщаяКартинка - Картинка
// * Отображение - ОтображениеКнопки - Вариант отображения кнопки
Функция КонструкторПараметрыКомандаФормы(Имя = "", Действие = "", Заголовок = "") Экспорт
	
	Параметры = Новый Структура;
	
	// Обязательные параметры к заполнению
	Параметры.Вставить("Имя", Имя);
	Параметры.Вставить("Действие", Действие);
	
	// Не обязательные параметры к заполнению
	Параметры.Вставить("Заголовок", Заголовок);
	Параметры.Вставить("Картинка", Неопределено);
	Параметры.Вставить("Отображение", Неопределено);
	
	Возврат Параметры;
КонецФункции

// Формирует параметры для создания кнопки формы.
// 
// Параметры:
//  Имя - Строка - Имя создаваемого элемента
//  ИмяКоманды - Строка - Имя команды
//  Родитель - ГруппаФормы, ФормаКлиентскогоПриложения - Родитель нового элемента
// 
// Возвращаемое значение:
//  Структура - Конструктор параметры команды формы:
// * Имя - Строка - Имя
// * ИмяКоманды - Строка - Имя команды
// * Родитель - ГруппаФормы - Родитель нового элемента
// * Вид - ВидКнопкиФормы - Вид кнопки
// * Заголовок - Строка - Заголовок
// * ВставитьПередЭлементом - ЭлементФормы - Элемент формы, перед которым разместить новый элемент
// * ДополнительныеПараметры - Структура - ДополнительныеПараметр
Функция КонструкторПараметрыКнопкаФормы(Имя = "", ИмяКоманды = "", Родитель = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	// Обязательные параметры к заполнению
	Параметры.Вставить("Имя", Имя);
	Параметры.Вставить("ИмяКоманды", ИмяКоманды);
	
	// Не обязательные параметры к заполнению  
	Параметры.Вставить("Родитель", Родитель);
	Параметры.Вставить("Вид", ВидКнопкиФормы.КнопкаКоманднойПанели);
	Параметры.Вставить("Заголовок", "");
	Параметры.Вставить("ВставитьПередЭлементом", Неопределено);
	Параметры.Вставить("ДополнительныеПараметры", Неопределено);
	Параметры.Вставить("События", Неопределено);
	
	Возврат Параметры;
	
КонецФункции

// Формирует параметры для создания реквизита формы.
// 
// Параметры:
//  Имя - Строка - Имя создаваемого реквизита
// 
// Возвращаемое значение:
//  Структура - Конструктор параметры команды формы:
// * Имя - Строка - Имя
// * ТипРеквизита - Строка - Тип реквизита
// * Путь - Строка - Путь
// * Заголовок - Строка - Заголовок
// * СохраняемыеДанные - Булево - Сохраняемые данные
Функция КонструкторПараметрыРеквизитФормы(Имя = "") Экспорт
	
	Параметры = Новый Структура;
		
	// Обязательные параметры к заполнению	
	Параметры.Вставить("Имя", Имя);
	
	// Не обязательные параметры к заполнению 
	Параметры.Вставить("ТипРеквизита", Неопределено);
	Параметры.Вставить("Путь", "");
	Параметры.Вставить("Заголовок", "");
	Параметры.Вставить("СохраняемыеДанные", Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Формирует параметры для создания декорации формы.
// 
// Параметры:
//  Имя - Строка - Имя создаваемого элемента
//  Родитель - ГруппаФормы, ФормаКлиентскогоПриложения - Родитель нового элемента
// 
// Возвращаемое значение:
//  Структура - Конструктор параметры поля формы:
// * Имя - Строка - Имя
// * Родитель - ГруппаФормы - Родитель нового элемента
// * Вид - ВидДекорацииФормы - Вид декорации формы
// * Заголовок - Строка - Заголовок
// * ВставитьПередЭлементом - ЭлементФормы - Элемент формы, перед которым разместить новый элемент
// * ДополнительныеПараметры - Структура - ДополнительныеПараметры
// * События - Структура - События декорации
// * Подсказка - Строка - Подсказка
Функция КонструкторПараметрыДекорацииФормы(Имя = "", Родитель = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	// Обязательные параметры к заполнению
	Параметры.Вставить("Имя", 						Имя);
	
	// Не обязательные параметры к заполнению
	Параметры.Вставить("Родитель", 					Родитель);
	Параметры.Вставить("Вид", 						ВидДекорацииФормы.Надпись);
	Параметры.Вставить("Заголовок", 				"");
	Параметры.Вставить("ВставитьПередЭлементом", 	Неопределено);
	Параметры.Вставить("ДополнительныеПараметры", 	Новый Структура);
	Параметры.Вставить("События", 					Новый Структура);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

 // Находит элемент формы по имени в коллекции элементов формы
// Параметры:
//  ФормаИлиКоллекцияЭлементов - ФормаКлиентскогоПриложения, ВсеЭлементыФормы - Форма или коллекция элементов формы, где происходит поиск
//  ИмяЭлемента - Строка - Имя искомого элемента
// 
// Возвращаемое значение:
//  - ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - Найденный элемент формы
//	- Неопределено - Если элемент не найден  
Функция НайтиЭлементФормыПоИмени(ФормаИлиКоллекцияЭлементов, ИмяЭлемента) Экспорт
	
	ТипФормаИлиКоллекцияЭлементов = ТипЗнч(ФормаИлиКоллекцияЭлементов);
	Если ТипФормаИлиКоллекцияЭлементов = Тип("ФормаКлиентскогоПриложения") Тогда
		НайденныйЭлемент = ФормаИлиКоллекцияЭлементов.Элементы.Найти(ИмяЭлемента);
	ИначеЕсли ТипФормаИлиКоллекцияЭлементов = Тип("ВсеЭлементыФормы") Тогда
		НайденныйЭлемент = ФормаИлиКоллекцияЭлементов.Найти(ИмяЭлемента);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru='Передан некорректный тип данных: %1'"), ТипФормаИлиКоллекцияЭлементов);
	КонецЕсли;
	
	Возврат НайденныйЭлемент;
КонецФункции

#Область НастройкиПолейФормы
// Возвращает массив строк настроек полей формы, которые используются к ИскомомуПолю и его свойству
Функция ПолучитьНастройкиПоля(Настройки, ИскомоеПоле, Свойство = неопределено) экспорт
	
	Результат = Новый Массив;
	
	ИскатьПоСвойству = Свойство <> неопределено;
	
	Для Каждого Строка Из Настройки Цикл
		
		Если ИскатьПоСвойству И НЕ Строка.Свойства.Свойство(Свойство) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Поле Из Строка.Поля Цикл
			Если Поле = ИскомоеПоле Тогда
				Результат.Добавить(Строка);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Удаляет  строки настроек полей формы, которые относятся к ИскомомуПолю и его свойству
Функция УдалитьНастройкиПоля(Настройки, ИскомоеПоле, Свойство = Неопределено) экспорт
	
	МассивНастроек = ПолучитьНастройкиПоля(Настройки, ИскомоеПоле, Свойство);
	МассивПустыхНастроек = Новый Массив;
	
	Для каждого СтрокаНастройки Из МассивНастроек Цикл
		ИндексПоля = СтрокаНастройки.Поля.Найти(ИскомоеПоле);
		СтрокаНастройки.Поля.Удалить(ИндексПоля);
		Если НЕ ЗначениеЗаполнено(СтрокаНастройки.Поля) Тогда // не осталось настраиваемых полей
			МассивПустыхНастроек.Добавить(СтрокаНастройки);
		КонецЕсли;	
	КонецЦикла;
	
	// удаляем пустые настройки
	Для каждого СтрокаНастройки Из МассивПустыхНастроек Цикл
		 Настройки.Удалить(СтрокаНастройки);
	КонецЦикла;
	
КонецФункции	

// Возвращает 
Функция ПолучитьУсловие(Настройка, ИмяПоля) экспорт
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Условие Из Настройка.Условие.Элементы Цикл
		
		Если Условие.ЛевоеЗначение = ПолеКомпоновки Тогда
			Возврат Условие;
		КонецЕсли;
		
	КонецЦикла;
	
	ВызватьИсключение НСтр("ru = 'Ошибка встраивания УХ'");
	
КонецФункции

// Возвращает ссылку на новый элемент отбора в переданном отборе схемы компоновки данных.
//
// Параметры:
//  Отбор - ОтборКомпоновкиДанных - отбор схемы компоновки, в который необходимо добавить новый элемент
//  ЛевоеЗначение - Строка, ПолеКомпоновкиДанных - поле компоновки, по которому необходимо установить отбор (необязательное)
//  ПравоеЗначение  - Произвольный, Строка, ПолеКомпоновкиДанных - значение отбора (необязательное) или поле компоновки
//  ТипОтбора  - ЭлементОтбораКомпоновкиДанных, ГруппаЭлементовОтбораКомпоновкиДанных - тип нового элемента отбора (необязательное)
//  ВидСравнения  - ВидСравненияКомпоновкиДанных - вид сравнения левого и правого значения
//  ПравоеЗначениеПоле  - Булево - указывает использовать ли в качестве правого значения поле компоновки данных.
//
// Возвращаемое значение:
//  ЭлементОтбораКомпоновкиДанных - ссылка на новый элемент отбора схемы компоновки данных.
//
Функция НовыйОтбор(Отбор, ЛевоеЗначение, ПравоеЗначение = Неопределено, ТипОтбора = Неопределено, ВидСравнения = Неопределено, ПравоеЗначениеПоле = Ложь) Экспорт
	
	Если ТипОтбора = Неопределено Тогда
		ТипОтбора = Тип("ЭлементОтбораКомпоновкиДанных");
	КонецЕсли;
	
	НовыйОтбор = Отбор.Элементы.Добавить(ТипОтбора);
	Если ЛевоеЗначение <> Неопределено Тогда
		Если ТипЗнч(ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
			НовыйОтбор.ЛевоеЗначение = ЛевоеЗначение;
		Иначе
			НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Если ПравоеЗначениеПоле Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
				НовыйОтбор.ПравоеЗначение = ПравоеЗначение;
			Иначе
				НовыйОтбор.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ПравоеЗначение);
			КонецЕсли;
		Иначе
			НовыйОтбор.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОтбора = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		Если ВидСравнения = Неопределено Тогда
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Если ТипЗнч(ПравоеЗначение) = Тип("Массив") ИЛИ ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			КонецЕсли;
		Иначе
			НовыйОтбор.ВидСравнения = ВидСравнения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйОтбор;
	
КонецФункции

Функция НоваяГруппаИЛИ(Отбор) Экспорт
	
	ГруппаИли = НовыйОтбор(Отбор,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Возврат ГруппаИли;
	
КонецФункции

Функция НоваяГруппаИ(Отбор) Экспорт
	
	ГруппаИ = НовыйОтбор(Отбор,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Возврат ГруппаИ;
	
КонецФункции

Функция НоваяГруппаНЕ(Отбор) Экспорт
	
	ГруппаНЕ = НовыйОтбор(Отбор,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНЕ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНЕ;
	
	Возврат ГруппаНЕ;
	
КонецФункции

// Возвращает ссылку на элемент отбора в переданном отборе схемы компоновки данных
//
// Параметры:
//  ОтборКД - <ОтборКомпоновкиДанных> - отбор схемы компоновки в который необходимо добавить новый элемент
//  ИмяЭлемента - <Строка> - имя поля компоновки по которому необходимо найти элемент отбора
//  ЗначениеОтбора - <ПроизвольноеЗначение> - установленное значение отбора по которому необходимо найти элемент отбора
//  ВидСравнения - <ВидСравненияКомпоновкиДанных> - установленный вид сравнения по которому необходимо найти элемент отбора.
//
// Возвращаемое значение:
//   <ЭлементОтбораКомпоновкиДанных> - ссылка на найденный элемент отбора схемы компоновки данных.
//
Функция НайтиЭлементОтбора(ОтборКД, ИмяЭлемента, ЗначениеОтбора = "#НеУчитывать#", ВидСравнения = Неопределено) Экспорт
	
	Результат = Неопределено;
	Для Каждого ЭлементОтбора Из ОтборКД.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Результат = НайтиЭлементОтбора(ЭлементОтбора, ИмяЭлемента);
			Если Результат <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяЭлемента) Тогда
			Если ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора ИЛИ ЗначениеОтбора = "#НеУчитывать#" Тогда
				Если ЭлементОтбора.ВидСравнения = ВидСравнения ИЛИ ВидСравнения = Неопределено Тогда
					Результат = ЭлементОтбора;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Добавляет ЗависимыеПоля в зависимость от поля ГлавноеПоле
Процедура ДобавитьЗависимыеПоля(Зависимости, ГлавноеПоле, ЗависимыеПоля) Экспорт
	
	Зависимость = Зависимости.Найти(ГлавноеПоле);
	Если Зависимость = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Новый Структура(ЗависимыеПоля) Цикл
		Зависимость.ЗависимыеПоля.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в коллекцию оформляемых полей компоновки данных новое поле
//
// Параметры:
//	КоллекцияОформляемыхПолей 	- коллекция оформляемых полей КД
//	ИмяПоля						- Строка - имя поля
//
// Возвращаемое значение:
//	ОформляемоеПолеКомпоновкиДанных - созданное поле
//
// Пример:
// 	Форма.УсловноеОформление.Элементы[0].Поля
//
Функция ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
	ПолеЭлемента 		= КоллекцияОформляемыхПолей.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных(ИмяПоля);

	Возврат ПолеЭлемента;
	
КонецФункции

#КонецОбласти 

// Функция возвращает структуру с параметрами элементов по умолчанию
Функция ПолучитьПараметрыЭлементовПоУмолчанию() Экспорт
	
	ПараметрыПоляВвода = Новый Структура;
	
	// Поле ввода 28
	ПараметрыПоляВвода28 = Новый Структура;
	ПараметрыПоляВвода28.Вставить("ПоложениеЗаголовка", 	ПоложениеЗаголовкаЭлементаФормы.Лево);
	ПараметрыПоляВвода28.Вставить("АвтоМаксимальнаяШирина",	Ложь);
	ПараметрыПоляВвода28.Вставить("МаксимальнаяШирина",		28);
	
	// Флажок
	ПараметрыПоляФлажка = Новый Структура;
	ПараметрыПоляФлажка.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	
	// Вертикальная группа
	ПараметрыГВ = Новый Структура;
	ПараметрыГВ.Вставить("Группировка",			ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ПараметрыГВ.Вставить("ОтображатьЗаголовок",	Истина);
	ПараметрыГВ.Вставить("Объединенная",		Истина);
	ПараметрыГВ.Вставить("Отображение",			ОтображениеОбычнойГруппы.Нет);
	
	// Горизонтальная группа
	ПараметрыГГ = Новый Структура;
	ПараметрыГГ.Вставить("Группировка",			ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ПараметрыГГ.Вставить("ОтображатьЗаголовок",	Истина);
	ПараметрыГГ.Вставить("Объединенная",		Истина);
	ПараметрыГГ.Вставить("Отображение",			ОтображениеОбычнойГруппы.Нет);
	
	ПараметрыПоляВводаНевидимого = Новый Структура;
	ПараметрыПоляВводаНевидимого.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	ПараметрыПоляВводаНевидимого.Вставить("ТолькоПросмотр", Истина);
	ПараметрыПоляВводаНевидимого.Вставить("Доступность", Ложь);
	ПараметрыПоляВводаНевидимого.Вставить("ПропускатьПриВводе", Истина);
	ПараметрыПоляВводаНевидимого.Вставить("ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
	ПараметрыПоляВводаВидОперацииУХ = Новый Структура;
	ПараметрыПоляВводаВидОперацииУХ.Вставить("ЦветФона", ЦветаСтиля.ФонУправляющегоПоля);
	
	// Параметры элементов, которые можно использовать в формах
	ПараметрыЭлементов = Новый Структура;
	ПараметрыЭлементов.Вставить("ПолеФлажка",			ПараметрыПоляФлажка);
	ПараметрыЭлементов.Вставить("ПолеВвода",			ПараметрыПоляВвода);
	ПараметрыЭлементов.Вставить("ПолеВвода28",			ПараметрыПоляВвода28);
	ПараметрыЭлементов.Вставить("ГруппаВ",				ПараметрыГВ);
	ПараметрыЭлементов.Вставить("ГруппаГ",				ПараметрыГГ);
	
	ПараметрыЭлементов.Вставить("ПолеВводаНевидимое",	
		ДополнитьСтруктуру(ПараметрыПоляВвода28, ПараметрыПоляВводаНевидимого));
		
	ПараметрыЭлементов.Вставить("ПолеВводаВидаОперацииУХ",
		ДополнитьСтруктуру(ПараметрыПоляВвода28, ПараметрыПоляВводаВидОперацииУХ));
	
	ПараметрыЭлементов.Вставить("ПолеВводаНевидимое",	
		ДополнитьСтруктуру(ПараметрыПоляВвода28, ПараметрыПоляВводаНевидимого));
		
	ПараметрыЭлементов.Вставить("ПолеВводаВидаОперацииУХ",
		ДополнитьСтруктуру(ПараметрыПоляВвода28, ПараметрыПоляВводаВидОперацииУХ));
		
	Возврат ПараметрыЭлементов;
	
КонецФункции

// Процедура добавляет реквизит в параметры запрета редактирования
// Параметры
//		Форма - УправляемаяФорма - Форма
//		ИмяРеквизита - Строка - Имя блокируемого реквизита
//		БлокируемыеЭлементы - Строка - Один или несколько элементов формы через запятую. Элементы, которые будут заблокированы
Процедура ДобавитьРеквизитВПараметрыЗапретаРедактирования(Форма, ИмяРеквизита, БлокируемыеЭлементы) Экспорт
	
	Элементы = Форма.Элементы;
	
	РедактированиеРазрешено = НЕ ЗначениеЗаполнено(Форма.Параметры.Ключ);
	
	ОписаниеРеквизита = Форма.ПараметрыЗапретаРедактированияРеквизитов.Добавить();
	ОписаниеРеквизита.ИмяРеквизита = ИмяРеквизита;
	ОписаниеРеквизита.ПравоРедактирования = Истина;
	ОписаниеРеквизита.РедактированиеРазрешено = РедактированиеРазрешено;
	
	СтруктураЭлементов = Новый Структура(БлокируемыеЭлементы);
	Для Каждого КлючЗначение Из СтруктураЭлементов Цикл
		
		Элемент = Элементы.Найти(КлючЗначение.Ключ);
		Если Элемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеРеквизита.БлокируемыеЭлементы.Добавить(КлючЗначение.Ключ);
		Элемент.ТолькоПросмотр = НЕ РедактированиеРазрешено;
		
	КонецЦикла;
	
	ОписаниеРеквизита.Представление = "";
	
КонецПроцедуры

// Создает новую таблицу формы в случае ее отсутствия, иначе возвращается существующий на форме элемент 
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания элемента
//  ПараметрыДляСоздания - Структура - Параметры для создания элемента формы
// 
// Возвращаемое значение:
//  ТаблицаФормы - Созданный элемент формы
Функция СоздатьТаблицуФормыПереопределяемая(Форма, ПараметрыДляСоздания) Экспорт
	
	Если НЕ ПроверитьПараметрыДляСозданияЭлемента(ПараметрыДляСоздания) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныйЭлемент = НайтиЭлементФормыПоИмени(Форма, ПараметрыДляСоздания.Имя);
	Если НайденныйЭлемент <> Неопределено Тогда
		Возврат НайденныйЭлемент;
	КонецЕсли;
	
	Параметры = КонструкторПараметрыПоляФормы();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыДляСоздания);
	
	Если Параметры.Родитель = Неопределено Тогда
		Параметры.Родитель = Форма;
	КонецЕсли;

	Возврат СоздатьТаблицуФормы(
		Форма.Элементы,
		Параметры.Имя,
		Параметры.Заголовок,
		Параметры.ПутьКДанным,
		Параметры.Родитель,
		Параметры.ВставитьПередЭлементом,
		Параметры.ДополнительныеПараметры,
		Параметры.События
	);
	
КонецФункции

// Функция создает ТаблицуФормы
Функция СоздатьТаблицуФормы(Элементы, Имя, Заголовок = "", ПутьКДанным, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, События = Неопределено) Экспорт
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		ТаблицаФормы = Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Родитель);
	Иначе
		ТаблицаФормы = Элементы.Вставить(Имя, Тип("ТаблицаФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	ТаблицаФормы.ПутьКДанным = ПутьКДанным;
	ТаблицаФормы.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ТаблицаФормы, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(События) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из События Цикл
			ТаблицаФормы.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаФормы;
	
КонецФункции

// Создает новую группу формы в случае ее отсутствия, иначе возвращается существующий на форме элемент
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания элемента
//  ПараметрыДляСоздания - Структура - Параметры для создания элемента формы
// 
// Возвращаемое значение:
//  ГруппаФормы - Созданный элемент формы
Функция СоздатьГруппуФормыПереопределяемая(Форма, ПараметрыДляСоздания) Экспорт
	
	Если НЕ ПроверитьПараметрыДляСозданияЭлемента(ПараметрыДляСоздания) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныйЭлемент = НайтиЭлементФормыПоИмени(Форма, ПараметрыДляСоздания.Имя);
	Если НайденныйЭлемент <> Неопределено Тогда
		Возврат НайденныйЭлемент;
	КонецЕсли;
	
	Параметры = КонструкторПараметрыГруппаФормы();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыДляСоздания);

	Если Параметры.Родитель = Неопределено Тогда
		Параметры.Родитель = Форма;
	КонецЕсли;
	
	Возврат СоздатьГруппуФормы(
		Форма.Элементы,
		Параметры.Имя,
		Параметры.Заголовок,
		Параметры.Вид,
		Параметры.Родитель,
		Параметры.ВставитьПередЭлементом,
		Параметры.ДополнительныеПараметры,
		Параметры.События
		);
		
КонецФункции

// Функция создает группу формы
// Параметры:
//  Элементы - ВсеЭлементыФормы
//
Функция СоздатьГруппуФормы(Элементы, Имя, Заголовок = "", Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, События = Неопределено) Экспорт
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		Группа = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель); // ГруппаФормы
	Иначе
		Группа = Элементы.Вставить(Имя, Тип("ГруппаФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Иначе
		Группа.Вид = Вид;
	КонецЕсли;
	Группа.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Группа, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(События) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из События Цикл
			Группа.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

// Создает новый элемент формы в случае его отсутствия, иначе возвращается существующий на форме элемент
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания элемента
//  ПараметрыДляСоздания - Структура - Параметры для создания элемента формы 
//  ПроверятьПараметры - Булево - Признак необходимости проверки параметров
// 
// Возвращаемое значение:
//  ЭлементФормы - Созданный элемент формы
Функция СоздатьПолеФормыПоПараметрам(Форма, ПараметрыДляСоздания, ПроверятьПараметры = Ложь) Экспорт
	
	Если ПроверятьПараметры И НЕ ПроверитьПараметрыДляСозданияЭлемента(ПараметрыДляСоздания) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныйЭлемент = НайтиЭлементФормыПоИмени(Форма, ПараметрыДляСоздания.Имя);
	Если НайденныйЭлемент <> Неопределено Тогда
		Возврат НайденныйЭлемент;
	КонецЕсли;
	
	Параметры = КонструкторПараметрыПоляФормы();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыДляСоздания);
	
	Если Параметры.Родитель = Неопределено Тогда
		Параметры.Родитель = Форма;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Подсказка) Тогда
		Если ТипЗнч(Параметры.ДополнительныеПараметры) <> Тип("Структура") Тогда
			Параметры.ДополнительныеПараметры = Новый Структура;
		КонецЕсли;

		Параметры.ДополнительныеПараметры.Вставить("Подсказка", Параметры.Подсказка);
	КонецЕсли;
	
	Возврат СоздатьПолеФормы(
		Форма.Элементы,
		Параметры.Имя,
		Параметры.Заголовок,
		Параметры.ПутьКДанным,
		Параметры.Вид,
		Параметры.Родитель,
		Параметры.ВставитьПередЭлементом,
		Параметры.ДополнительныеПараметры,
		Параметры.События);
		
КонецФункции

// Функция создает поле формы
// Параметры:
//  Элементы - ВсеЭлементыФормы
//
Функция СоздатьПолеФормы(Элементы, Имя, Заголовок = "", ПутьКДанным, Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, СобытияЭлемента = Неопределено) Экспорт
	
	НайденноеПоле = Элементы.Найти(Имя);
	Если НайденноеПоле <> неопределено Тогда
		Поле = НайденноеПоле;
	ИначеЕсли ВставитьПередЭлементом = Неопределено Тогда
		Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель); // ПолеФормы
		Поле.ПутьКДанным = ПутьКДанным;
	Иначе
		Поле = Элементы.Вставить(Имя, Тип("ПолеФормы"), Родитель, ВставитьПередЭлементом);
		Поле.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Поле.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		Поле.Вид = Вид;
	КонецЕсли;
	
	Поле.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыЭлемента);
	ИначеЕсли Поле.Вид = ВидПоляФормы.ПолеВвода Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыПоляВводаПоУмолчанию());
	ИначеЕсли Поле.Вид = ВидПоляФормы.ПолеФлажка Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыПоляФлажкаПоУмолчанию());
	КонецЕсли;
	
	Если ТипЗнч(СобытияЭлемента) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из СобытияЭлемента Цикл
			Поле.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

// Создает новую кнопку формы в случае ее отсутствия, иначе возвращается существующий на форме элемент
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма для создания кнопки
//  ПараметрыДляСоздания - Структура - Параметры для создания кнопки формы
// 
// Возвращаемое значение:
//  КнопкаФормы - Созданный элемент формы
Функция СоздатьКнопкуФормыПереопределяемая(Форма, ПараметрыДляСоздания) Экспорт
	
	Если НЕ ПроверитьПараметрыДляСозданияЭлемента(ПараметрыДляСоздания) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныйЭлемент = НайтиЭлементФормыПоИмени(Форма, ПараметрыДляСоздания.Имя);
	Если НайденныйЭлемент <> Неопределено Тогда
		Возврат НайденныйЭлемент;
	КонецЕсли;
	
	Параметры = КонструкторПараметрыКнопкаФормы();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыДляСоздания);
	
	Если Параметры.Родитель = Неопределено Тогда
		Параметры.Родитель = Форма;
	КонецЕсли;
	
	Возврат СоздатьКнопкуФормы(
		Форма.Элементы,
		Параметры.Имя,
		Параметры.Заголовок,
		Параметры.ИмяКоманды,
		Параметры.Вид,
		Параметры.Родитель,
		Параметры.ВставитьПередЭлементом,
		Параметры.ДополнительныеПараметры,
		Параметры.События
	);
	
КонецФункции

// Функция создает кнопку формы
Функция СоздатьКнопкуФормы(Элементы, Имя, Заголовок = "", ИмяКоманды, Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, СобытияЭлемента = Неопределено) Экспорт
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		Поле = Элементы.Добавить(Имя, Тип("КнопкаФормы"), Родитель); // КнопкаФормы
	Иначе
		Поле = Элементы.Вставить(Имя, Тип("КнопкаФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Поле.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Иначе
		Поле.Вид = Вид;
	КонецЕсли;
	Поле.Заголовок = Заголовок;
	Поле.ИмяКоманды = ИмяКоманды;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(СобытияЭлемента) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из СобытияЭлемента Цикл
			Поле.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

// Функция создает декорацию формы
Функция СоздатьДекорациюФормы(Элементы, Имя, Заголовок = "", Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, СобытияЭлемента = Неопределено) Экспорт
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		Поле = Элементы.Добавить(Имя, Тип("ДекорацияФормы"), Родитель); // ДекорацияФормы
	Иначе
		Поле = Элементы.Вставить(Имя, Тип("ДекорацияФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Поле.Вид = ВидДекорацииФормы.Надпись;
	Иначе
		Поле.Вид = Вид;
	КонецЕсли;
	Поле.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(СобытияЭлемента) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из СобытияЭлемента Цикл
			Поле.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

// Функция создает команду формы
Функция СоздатьКоманду(Форма, ИмяКоманды, Заголовок, Действие, Картинка = Неопределено, Отображение = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	
	Команда = Команды.Найти(ИмяКоманды);
	Если Команда = Неопределено Тогда
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Заголовок = Заголовок;
		Если Картинка <> Неопределено Тогда
			Команда.Картинка = Картинка;
			Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КонецЕсли;
		Команда.Действие = Действие;
	КонецЕсли;
	
	Возврат Команда;
	
КонецФункции

// Функция создает простые поля и кнопки формы
Функция СоздатьПоляКнопки(Форма, ИменаПолейКнопок, Родитель, ОбъектДляПолей = "Объект.", СобытияЭлемента = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	
	Контекст = Форма;
	Если ЗначениеЗаполнено(ОбъектДляПолей) Тогда
		Путь = Лев(ОбъектДляПолей, СтрДлина(ОбъектДляПолей)-1);
		Контекст = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, Путь);
	КонецЕсли;
	
	СобытиеКоманды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СобытияЭлемента, "ПриИзменении");
	ПараметрыЭлемента = Новый Структура("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	ПараметрыФлажка = Новый Структура("ОтображениеПодсказки, ПоложениеЗаголовка", 
		ОтображениеПодсказки.Кнопка, ПоложениеЗаголовкаЭлементаФормы.Право);
	
	ИменаЭлементов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолейКнопок, ",", Истина, Истина);
	Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
		
		КомандаФормы = Форма.Команды.Найти(ИмяЭлемента);
		Если КомандаФормы = Неопределено Тогда
			
			ЗначениеЭлемента = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Контекст, ИмяЭлемента);
			Если ТипЗнч(ЗначениеЭлемента) = Тип("Булево") Тогда
				СоздатьПолеФормы(Элементы, ИмяЭлемента, , ОбъектДляПолей + ИмяЭлемента, ВидПоляФормы.ПолеФлажка, Родитель,, ПараметрыФлажка, СобытияЭлемента);
			Иначе 
				СоздатьПолеФормы(Элементы, ИмяЭлемента, , ОбъектДляПолей + ИмяЭлемента,, Родитель,, ПараметрыЭлемента, СобытияЭлемента);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
			
		Если СобытиеКоманды <> Неопределено Тогда
			КомандаФормы.Действие = СобытиеКоманды;			
		КонецЕсли;
		СоздатьКнопкуФормы(Элементы, ИмяЭлемента, , ИмяЭлемента, ВидКнопкиФормы.Гиперссылка, Родитель);
			
	КонецЦикла;
	
КонецФункции

// Функция создает свертываемую группу формы
// Параметры:
//  Элементы - ВсеЭлементыФормы
//
Функция СоздатьСвертываемуюГруппуФормы(Элементы, Имя, Заголовок = "", Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, События = Неопределено) Экспорт
	
   	НоваяГруппа = СоздатьГруппуФормы(Элементы, Имя, Заголовок, Вид, Родитель, ВставитьПередЭлементом, ПараметрыЭлемента, События);
	НоваяГруппа.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Поведение 				= ПоведениеОбычнойГруппы.Свертываемая;
	НоваяГруппа.ОтображениеУправления 	= ОтображениеУправленияОбычнойГруппы.Картинка;
	
	НоваяГруппа.Скрыть(); //свернем группу
	
	Возврат НоваяГруппа;
	
КонецФункции

// Функция создает группу формы
// Параметры:
//  Элементы - ВсеЭлементыФормы
//
Функция СоздатьСкрытуюГруппу(Элементы, Имя, ГруппировкаВертикально = Истина, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, События = Неопределено) Экспорт
	
	Группа = СоздатьГруппуФормы(Элементы, Имя,,, Родитель, ВставитьПередЭлементом, ПараметрыЭлемента);
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь;
	
	Если ГруппировкаВертикально = Истина Тогда
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ИначеЕсли ГруппировкаВертикально = Ложь Тогда
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	КонецЕсли;	
	
	Возврат Группа;
	
КонецФункции

// Функция возвращает Истина, если элементы УХ на форму уже добавлены
Функция ЭлементыФормыУХУжеСозданы(Форма) Экспорт
	
	ИмяЭлементаПризнака = ИмяЭлементаПризнака();
	Возврат Форма.Элементы.Найти(ИмяЭлементаПризнака) <> Неопределено;
	
КонецФункции

// Функция устанавливает признак того, что элементы УХ добавлены в форму
Процедура ЭлементыФормыУХДобавлены(Форма) Экспорт
	
	ИмяЭлементаПризнака = ИмяЭлементаПризнака();
	
	// Элемент служит признаком наличия на форме элементов УХ
	Если Форма.Элементы.найти(ИмяЭлементаПризнака) = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить(ИмяЭлементаПризнака, Тип("ДекорацияФормы"));
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает имя элемента, который является признаком добавления элементов УХ 
Функция ИмяЭлементаПризнака() Экспорт
	
	Возврат "ЭлементыУХДобавлены";
	
КонецФункции

Функция ИмяРеквизитаИнициализацияВыполнена() Экспорт

	Возврат "ВстраиваниеУХ_ИнициализацияВыполнена";
	
КонецФункции

Функция НовыйРеквизитИнициализацияВыполнена() Экспорт
	
	Возврат Новый РеквизитФормы(
		ИмяРеквизитаИнициализацияВыполнена(), 
		Новый ОписаниеТипов("Булево"),
		"",
		НСтр("ru = 'Инициализация выполнена'"));
	
КонецФункции

Функция ИнициализацияВыполнена(Форма) Экспорт
	
	ИмяРеквизитаПризнака = ИмяРеквизитаИнициализацияВыполнена();
	
	ДанныеИнициализации = Новый Структура(ИмяРеквизитаПризнака);
	ЗаполнитьЗначенияСвойств(ДанныеИнициализации, Форма);
	
	Возврат (ДанныеИнициализации[ИмяРеквизитаПризнака] = Истина);
	
КонецФункции

// Возвращает структуру с обработчиком события ПриИзменении
Функция ПриИзменении(ИмяОбработчика) Экспорт
	Возврат Новый Структура("ПриИзменении", ИмяОбработчика);
КонецФункции

// параметры поля ввода по умолчанию
Функция ПараметрыПоляВводаПоУмолчанию() Экспорт
	
	ПараметрыПоляВвода28 = Новый Структура;
	ПараметрыПоляВвода28.Вставить("ПоложениеЗаголовка", 		ПоложениеЗаголовкаЭлементаФормы.Лево);
	ПараметрыПоляВвода28.Вставить("АвтоМаксимальнаяШирина",	Ложь);
	ПараметрыПоляВвода28.Вставить("МаксимальнаяШирина",		28);
	
	Возврат ПараметрыПоляВвода28;
	
КонецФункции

// параметры поля флажка по умолчанию
Функция ПараметрыПоляФлажкаПоУмолчанию() Экспорт
	
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("ПоложениеЗаголовка", 		ПоложениеЗаголовкаЭлементаФормы.Право);
	ПараметрыПоля.Вставить("АвтоМаксимальнаяШирина",	Ложь);
	ПараметрыПоля.Вставить("МаксимальнаяШирина",		28);
	
	Возврат ПараметрыПоля;
	
КонецФункции

// пустой список параметров
Функция БезПараметров() Экспорт
	
	Возврат Новый Структура;
	
КонецФункции

// пустой список параметров
Функция ПараметрыНевидимойГруппы() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	Результат.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
	Результат.Вставить("ОтображатьЗаголовок", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ДополнитьСтруктуру(Источник, Дополнение) Экспорт
	
	Результат = Новый Структура(Новый ФиксированнаяСтруктура(Источник));
	Для Каждого КлючЗначение Из Дополнение Цикл
		Результат.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверить существование реквизита формы, и если он отсутствует, создает
//  и добавляет его в массив ДобавляемыеРеквизиты.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, для которой нужно проверить
//						  	существование реквизита.
//  ДобавляемыеРеквизиты - Массив - массив реквизитов формы, в который
//  						будет добавлен реквизит.
//  Имя - Строка - имя реквизита формы. 
//  ТипРеквизита - Строка | Массив(Тип) | ОписаниеТипов - описание типа
//							реквизита. Параметр будет передан в конструктор
//							объекта ОписаниеТипов.
//  Путь - Строка - Путь к создаваемому реквизиту. Не включает имя реквизита. 
//  Заголовок - Строка - заголовок. Если не указан, то будет использовано имя.
//  СохраняемыеДанные - Булево - Реквизит содержит сохраняемые данные.
//							Истина - сохраняемый реквизит формы.
//							Значение по умолчанию: Ложь.
//
Процедура СоздатьДобавитьРеквизитФормы(Форма,
								ДобавляемыеРеквизиты,
								Имя,
								ТипРеквизита,
								Путь="",
								Заголовок="",
								СохраняемыеДанные=Ложь) Экспорт
	РеквизитСуществует =
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			Форма, Имя);
	Если НЕ РеквизитСуществует Тогда 
		ОписаниеТиповРеквизита = Новый ОписаниеТипов(ТипРеквизита);
		Реквизит = Новый РеквизитФормы(
			Имя, ОписаниеТиповРеквизита, Путь, Заголовок, СохраняемыеДанные);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
	КонецЕсли;
КонецПроцедуры

Функция РазместитьВГруппе(Родитель, ПараметрыПолейВвода = неопределено) Экспорт
	Результат = Новый Структура("Размещение, Родитель, ПередЭлементом", "Родитель", Родитель);
	Результат.Вставить("ПараметрыПолейВвода", ?(ПараметрыПолейВвода=неопределено, Новый Структура, ПараметрыПолейВвода));
	Возврат Результат;
КонецФункции

Функция РазместитьПередЭлементом(Элемент, Родитель = "", ПараметрыПолейВвода = неопределено) Экспорт
	Результат = Новый Структура("Размещение, ПередЭлементом, Родитель", "ПередЭлементом", Элемент);
	Результат.ПередЭлементом = Элемент;
	Если ТипЗнч(Элемент) = Тип("Строка") Тогда
		Результат.Родитель = Родитель;
	Иначе
		Результат.Родитель = Элемент.Родитель;
	КонецЕсли;
	Результат.Вставить("ПараметрыПолейВвода", ?(ПараметрыПолейВвода=неопределено, Новый Структура, ПараметрыПолейВвода));
	Возврат Результат;
КонецФункции

Функция РазместитьВГруппеСтрокой(Родитель, ПараметрыПолейВвода = неопределено) Экспорт
	Результат = Новый Структура("Размещение, Родитель, ПередЭлементом", "Родитель");
	Если ТипЗнч(Родитель) = Тип("Строка") Тогда
		Результат.Родитель = Родитель;
	Иначе
		Результат.Родитель = Родитель.Имя;
	КонецЕсли;
	Результат.Вставить("ПараметрыПолейВвода", ?(ПараметрыПолейВвода=неопределено, Новый Структура, ПараметрыПолейВвода));
	Возврат Результат;
КонецФункции

Функция РазместитьПередЭлементомСтрокой(Элемент, Родитель = "", ПараметрыПолейВвода = неопределено) Экспорт
	Результат = Новый Структура("Размещение, ПередЭлементом, Родитель", "ПередЭлементом");
	Если ТипЗнч(Элемент) = Тип("Строка") Тогда
		Результат.ПередЭлементом = Элемент;
		Результат.Родитель = Родитель;
	Иначе
		Результат.ПередЭлементом = Элемент.Имя;
		Результат.Родитель = Элемент.Родитель.Имя;
	КонецЕсли;
	Результат.Вставить("ПараметрыПолейВвода", ?(ПараметрыПолейВвода=неопределено, Новый Структура, ПараметрыПолейВвода));
	Возврат Результат;
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиПараметрПоИмени(Массив, Имя)
	
	Поз = 0;
	Пока Поз < Массив.Количество() Цикл
		Параметр = Массив[Поз];
		Если Параметр.Имя = Имя Тогда
			Возврат Поз;
		КонецЕсли;
		Поз = Поз + 1;
	КонецЦикла;
	
	Возврат неопределено;
	
КонецФункции

Функция ПроверитьПараметрыДляСозданияЭлемента(Параметры)
	
	Если Параметры = Неопределено
		ИЛИ ТипЗнч(Параметры) <> Тип("Структура") Тогда
			
		Возврат Ложь;
	
	КонецЕсли;
		
	Если НЕ Параметры.Свойство("Имя")
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.Имя) Тогда
			
		Возврат Ложь;
	
	КонецЕсли;
				
	Возврат Истина;
	
КонецФункции

#КонецОбласти

Процедура ОформитьЭлементыТаблицыФормы(ЭлементТаблицыФормы) Экспорт
	
	Для Каждого Элемент Из ЭлементТаблицыФормы.ПодчиненныеЭлементы Цикл
		ОформитьФонЭлементаПоПросмотру(Элемент);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//    Элемент - ПолеФормы
Процедура ОформитьФонЭлементаПоПросмотру(Знач Элемент, Знач ТолькоПросмотр = Неопределено) Экспорт
	
	Если ТипЗнч(Элемент) <> Тип("ПолеФормы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда 
		Если Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда
			Если Элемент.Гиперссылка Тогда
				Элемент.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
				Элемент.Шрифт = Новый Шрифт(,,,, Истина);
			КонецЕсли;
			ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
		ТолькоПросмотр = Элемент.ТолькоПросмотр;
	КонецЕсли;
	
	Элемент.ЦветФона = ? (ТолькоПросмотр, ЦветаСтиля.АльтернативныйЦветФонаПоля, ЦветаСтиля.ДобавленныйРеквизитФон);
	
КонецПроцедуры

Функция НачатьИзменениеРеквизитовФормы(Форма) Экспорт
	
	РеквизитыФормы = Новый Структура;
	РеквизитыФормы.Вставить("Добавляемые",	Новый Массив);  
	РеквизитыФормы.Вставить("Удаляемые", 	Новый Массив);  
	
	Возврат РеквизитыФормы;

КонецФункции

Процедура ЗавершитьИзменениеРеквизитовФормы(Форма, РеквизитыФормы) Экспорт
	
	Если РеквизитыФормы.Добавляемые.Количество() > 0 
		ИЛИ РеквизитыФормы.Удаляемые.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(РеквизитыФормы.Добавляемые, РеквизитыФормы.Удаляемые);
	КонецЕсли; 
	
КонецПроцедуры