#Область СлужебныйПрограммныйИнтерфейс
// Сохраняет дерево заказа в РС СтруктураЗаказа
//
// Параметры:
//  МассивЗаказов  - Массив - элементы - ДокументСсылка.ЗаказНаПроизводство2_2
//
Процедура СохранитьДеревоЗаказа(МассивЗаказов = Неопределено)  Экспорт  
	Если МассивЗаказов = Неопределено Тогда
		МассивЗаказов = ПолучитьВсеЗаказы();
	КонецЕсли;
	Если ТипЗнч(МассивЗаказов) = Тип("ДокументСсылка.ЗаказНаПроизводство2_2") Тогда
	    Заказ = МассивЗаказов;
		МассивЗаказов = Новый Массив;
	    МассивЗаказов.Добавить(Заказ);
	КонецЕсли;
	Для каждого Заказ Из МассивЗаказов Цикл 
		ДеревоЗаказа = ПолучитьДеревоЗаказаПоОтчету(Заказ); 
		СохранитьДеревоЗаказаВСправочник(Заказ, ДеревоЗаказа);
	КонецЦикла;
КонецПроцедуры // ()

// Получает дерево заказа так же, как в отчете СтруктураЗаказаНаПроизводствоДинамическая
//
// Параметры:
//  Заказ  - ДокументСсылка.ЗаказНаПроизводство2_2 - документ, для которого нужно получить дерево
//
// Возвращаемое значение:
//   ДеревоЗначений   - дерево структуры заказа
//
Функция ПолучитьДеревоЗаказаПоОтчету(Заказ)  Экспорт
	ПараметрыПроцедуры = ПараметрыЧтенияДереваЗаказаПоОтчету(Заказ);  
	
	ДеревоЗаказа = Отчеты.СтруктураЗаказаНаПроизводствоДинамическая.юум_ПостроитьДеревоЗаказа(ПараметрыПроцедуры);  
	
	РазвернутыеСтроки = Новый СписокЗначений;
	Очередь = Новый Массив;
	Узлы = Новый Соответствие;  
	ДеревоЗаказа.Колонки.Добавить("СчетчикСтрок", Новый ОписаниеТипов("Число"));
	
	СтрокиДерева = ДеревоЗаказа.Строки;   
	СчетчикСтрок = 1;
	Для каждого СтрокаДерева Из СтрокиДерева Цикл 
		СтрокаДерева.СчетчикСтрок = СчетчикСтрок;
		СчетчикСтрок = СчетчикСтрок + 1;
		Очередь.Добавить(СтрокаДерева);
		РазвернутыеСтроки.Добавить(СтрокаДерева.СчетчикСтрок);
	КонецЦикла;
	Пока Очередь.ВГраница() <> -1 Цикл
		СтрокиТекущие = Очередь[0].Строки;
		Для каждого СтрокаДерева Из СтрокиТекущие Цикл
			СтрокаДерева.СчетчикСтрок = СчетчикСтрок;
			СчетчикСтрок = СчетчикСтрок + 1;
			Если СтрокаДерева.ДостроитьДерево Тогда
				КлючиПартий = Новый Массив;
				Для каждого Строка Из СтрокаДерева.Строки Цикл
					КлючиПартий.Добавить(Строка.КлючПартия);
				КонецЦикла;
				Узлы.Вставить(СтрокаДерева.СчетчикСтрок,
					Новый Структура("КлючиПартий, Этап", КлючиПартий, СтрокаДерева.ЭтапСсылка));
			Иначе
				Очередь.Добавить(СтрокаДерева);
				РазвернутыеСтроки.Добавить(СтрокаДерева.СчетчикСтрок);
			КонецЕсли;
		КонецЦикла;
		Очередь.Удалить(0);
	КонецЦикла;
	Если Узлы.Количество() = 0 Тогда
		РассчитатьДолюПодчиненыхСтрокДерева(ДеревоЗаказа);
		Возврат ДеревоЗаказа;
	КонецЕсли;
	
	ПараметрыПроцедуры = ПараметрыЧтенияДереваЗаказаПоОтчету(Заказ);  
	ПараметрыПроцедуры.Вставить("Узлы", Узлы);
	ПараметрыПроцедуры.Вставить("ПорционнаяВыборка", Истина); 
	
	АдресХранилища = Новый УникальныйИдентификатор;
	Отчеты.СтруктураЗаказаНаПроизводствоДинамическая.РазвернутьВсеУровни(ПараметрыПроцедуры, АдресХранилища);
	
	Узлы = ПараметрыПроцедуры.уюм_Узлы;
	Для каждого КлючИЗначение Из Узлы Цикл 
		СтрокаДерева = СтрокиДерева.Найти(КлючИЗначение.Ключ, "СчетчикСтрок", Истина);
		Если СтрокаДерева <> Неопределено Тогда
			Строки = СтрокаДерева.Строки;
			Для Индекс = -Строки.Количество()+1 По 0 Цикл
				Строка = Строки[-Индекс];
				Если Строка.ТипСтроки = ТипСтрокиСлужебный() Тогда
					Строки.Удалить(-Индекс);
				КонецЕсли;
			КонецЦикла;
			СтрокаДерева.ДостроитьДерево = Ложь;
			ЗаполнитьДеревоРекурсивноПоОтчету(Строки, КлючИЗначение.Значение.Строки);
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьДолюПодчиненыхСтрокДерева(ДеревоЗаказа);
	Возврат ДеревоЗаказа;
	
КонецФункции // ()

// Расчет доли входящих номенклатур 
//
// Параметры:
//  ДеревоЗаказа  - ДеревоЗначений - дерево заказа
//
Процедура РассчитатьДолюПодчиненыхСтрокДерева(ДеревоЗаказа)  Экспорт
	ДеревоЗаказа.Колонки.Добавить("ИдСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ДеревоЗаказа.Колонки.Добавить("Доля", Новый ОписаниеТипов("Число"));
	ДеревоЗаказа.Колонки.Добавить("ТребуетсяВсего", Новый ОписаниеТипов("Число"));
	СоответствиеНоменклатур =  Новый Соответствие;
	СтрокиПродукция = ДеревоЗаказа.Строки;
	СчетчикСтрок = 0;
	Для каждого СтрокаПродукция Из СтрокиПродукция Цикл 
		Если СтрокаПродукция.Отменено Тогда
		    Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаПродукция.Номенклатура) Тогда
		    Продолжить;
		КонецЕсли;
		СчетчикСтрок = СчетчикСтрок + 1;
		СтрокаПродукция.СчетчикСтрок = СчетчикСтрок;
		СтрокаПродукция.ИдСтроки = Новый УникальныйИдентификатор;
		СтрокаПродукция.Доля = 1;
		СоответствиеНоменклатур.Вставить(СтрокаПродукция.Номенклатура, СтрокаПродукция.Требуется); 
		СобратьКоличествоВходящихНоменклатурРекурсивно(СоответствиеНоменклатур, СтрокаПродукция, СчетчикСтрок);
	КонецЦикла;
	РассчитатьДолюПодчиненыхСтрокДереваРекурсивно(СоответствиеНоменклатур, ДеревоЗаказа);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьДеревоРекурсивно(СтрокаУровень, ОбщаяТаблица)
	
	ВидСтрокиПП = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции;
	ВидСтрокиПФ = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката;
	ВидСтрокиПотребление = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление;
	ТекущийУровень =  СтрокаУровень.Уровень;
	СледующийУровень = ТекущийУровень + 1; 
	
	// в строках Потребление в качестве ключа указывается уровень и ключ партии 
	// вышестоящего уровня (куда)
	КлючПартия = СтрокаУровень.КлючПартия; 
	СтруктураОтбораПотребление = Новый Структура("ВидСтроки, КлючПартия", 
		ВидСтрокиПотребление, КлючПартия);
	
	СтрокиПотребление = ОбщаяТаблица.НайтиСтроки(СтруктураОтбораПотребление);
	Для каждого СтрокаТаблицы Из СтрокиПотребление Цикл  
		// это строка Потребление, привязанная к текущей 
		// по ней будем искать ПФ
		СтрокаРеквизитов = "ВидСтроки, Номенклатура, Характеристика, Спецификация"; 
		СтруктураОтбораПФ = Новый Структура(СтрокаРеквизитов);
	    ЗаполнитьЗначенияСвойств(СтруктураОтбораПФ, СтрокаТаблицы);
		СтруктураОтбораПФ.Вставить("ВидСтроки", ВидСтрокиПФ);
		СтруктураОтбораПФ.Вставить("Спецификация", СтрокаТаблицы.СпецификацияПолуфабриката);
		СтрокиПФ = ОбщаяТаблица.НайтиСтроки(СтруктураОтбораПФ);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СпецификацияПолуфабриката) Тогда
			Продолжить;
		КонецЕсли; 
		Для каждого СтрокаПФ Из СтрокиПФ Цикл
			Если СтрокаПФ.Отменено Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаПФ.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаСледующийУровень = СтрокаУровень.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСледующийУровень, СтрокаПФ); 
			ЗаполнитьДеревоРекурсивно(СтрокаСледующийУровень, ОбщаяТаблица); 
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры

Функция ЭтоРабота(СтрокаТаблицы) 
	ЭтоРабота = 
		СтрокаТаблицы.ТипНоменклатуры 
			= ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") ИЛИ
		СтрокаТаблицы.ТипНоменклатуры 
			= ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");
	
    Возврат ЭтоРабота;
КонецФункции // ()

Процедура СохранитьДеревоЗаказаВСправочник(Заказ, ДеревоЗаказа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	юум_ДеревоЗаказаСлужебный.Ссылка КАК Ссылка,
	|	юум_ДеревоЗаказаСлужебный.Уровень КАК Уровень
	|ИЗ
	|	Справочник.юум_ДеревоЗаказаСлужебный КАК юум_ДеревоЗаказаСлужебный
	|ГДЕ
	|	юум_ДеревоЗаказаСлужебный.ЗаказНаПроизводство = &Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень УБЫВ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Удалить();
	КонецЦикла;  
	
	ЭлементЗаказ = ДобавитьЭлементЗаказ(Заказ);
	ДобавитьСтрокиВСправочник(ДеревоЗаказа, Заказ, ЭлементЗаказ, ЭлементЗаказ);
КонецПроцедуры

Процедура ДобавитьСтрокиВСправочник(ИсходнаяСтрока, Заказ, Родитель, ЭлементЗаказ)
	ШаблонНаименованиеСКоличеством = "%1 (%2)";
	
	Для каждого Строка  Из ИсходнаяСтрока.Строки Цикл  
		Если Строка.Отменено Тогда
		    Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		ЭлементОбъект = Справочники.юум_ДеревоЗаказаСлужебный.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ЭлементОбъект, Строка);
		ЭлементОбъект.Родитель = Родитель;
		ЭлементОбъект.ЗаказНаПроизводство = Заказ; 
		Количество = Строка.Требуется; 
		Код = СокрЛП(Строка.Номенклатура.Код);
		Наименование = СокрЛП(Строка.Номенклатура.Наименование);
		
		Если ЗначениеЗаполнено(Количество) Тогда
			ЭлементОбъект.Наименование = СтрШаблон(ШаблонНаименованиеСКоличеством, Наименование, Количество); 
		Иначе
			ЭлементОбъект.Наименование = Наименование; 
		КонецЕсли; 
		
		ЭлементОбъект.Уровень = Строка.Уровень() + 1;
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.УстановитьНовыйКод();
		ЭлементОбъект.Записать(); 
		
		ЭлементОбъект.СтрокаДереваУровень1 = ПолучитьРодителяПоНомеруУровня(ЭлементОбъект, 1, ЭлементЗаказ);
		ЭлементОбъект.СтрокаДереваУровень2 = ПолучитьРодителяПоНомеруУровня(ЭлементОбъект, 2, ЭлементЗаказ);
		ЭлементОбъект.СтрокаДереваУровень3 = ПолучитьРодителяПоНомеруУровня(ЭлементОбъект, 3, ЭлементЗаказ);
		ЭлементОбъект.СтрокаДереваУровень4 = ПолучитьРодителяПоНомеруУровня(ЭлементОбъект, 4, ЭлементЗаказ);
		ЭлементОбъект.СтрокаДереваУровень5 = ПолучитьРодителяПоНомеруУровня(ЭлементОбъект, 5, ЭлементЗаказ);

		ЭлементОбъект.Записать(); 
		ДобавитьСтрокиВСправочник(Строка, Заказ, ЭлементОбъект.Ссылка, ЭлементЗаказ);
	КонецЦикла; 
КонецПроцедуры

Функция ДобавитьЭлементЗаказ(Заказ)
	ЭлементОбъект = Справочники.юум_ДеревоЗаказаСлужебный.СоздатьЭлемент();
	ЭлементОбъект.ЗаказНаПроизводство = Заказ; 
	ЭлементОбъект.Наименование = Заказ; 
	ЭлементОбъект.ОбменДанными.Загрузка = Истина;   
	ЭлементОбъект.УстановитьНовыйКод();
	ЭлементОбъект.Записать();  
	Возврат  ЭлементОбъект.Ссылка;
КонецФункции // ()

Процедура РазбитьДеревоЗаказа(МассивДеревьев, ДеревоЗаказа)
	СтрокиПродукции = ДеревоЗаказа.Строки;
	Для каждого Строка Из СтрокиПродукции Цикл
		ДеревоПродукции = Новый ДеревоЗначений;
		Корень = ДеревоПродукции.Строки.Добавить();
	    ЗаполнитьЗначенияСвойств(Корень, Строка);
		СкопироватьСтрокиРекурсивно(Строка, Корень);
	    МассивДеревьев.Добавить(ДеревоПродукции);
	КонецЦикла;
КонецПроцедуры

Процедура СкопироватьСтрокиРекурсивно(ИсходныйУзел, ЦелевойУзел)
    
    Для Каждого ДочерняяСтрока Из ИсходныйУзел.Строки Цикл
        НовыйДочернийУзел = ЦелевойУзел.Строки.Добавить();
        ЗаполнитьЗначенияСвойств(НовыйДочернийУзел, ДочерняяСтрока);
        
        // Рекурсивный вызов для следующих уровней вложенности
        СкопироватьСтрокиРекурсивно(ДочерняяСтрока, НовыйДочернийУзел);
    КонецЦикла;
    
КонецПроцедуры

Функция ТипСтрокиСлужебный()
	
	Возврат 7;
	
КонецФункции

Функция ПолучитьВсеЗаказы()
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтруктураЗаказа.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ИЗ
	|	РегистрСведений.СтруктураЗаказа КАК СтруктураЗаказа";
	
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказНаПроизводство");
    Возврат МассивЗаказов;
КонецФункции // ()

Функция ПараметрыЧтенияДереваЗаказаПоОтчету(Заказ)
	
	ЭтапыОтборАналитика = Новый Структура;
	ЭтапыОтборАналитика.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	ЭтапыОтборАналитика.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	ЭтапыОтборАналитика.Вставить("Склад", Справочники.Склады.ПустаяСсылка());
	ЭтапыОтборАналитика.Вставить("Назначение", Справочники.Назначения.ПустаяСсылка());
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Заказ", Заказ);
	ПараметрыПроцедуры.Вставить("ТипПроцесса", Заказ.ТипПроизводственногоПроцесса);
	ПараметрыПроцедуры.Вставить("ПоказыватьЭтапы", Ложь);
	ПараметрыПроцедуры.Вставить("ПоказыватьПеремещения", Ложь);
	ПараметрыПроцедуры.Вставить("ПоказыватьМатериалы", Ложь);
	ПараметрыПроцедуры.Вставить("ПоказыватьВыпуски", Ложь);
	ПараметрыПроцедуры.Вставить("Назначение", Справочники.Назначения.ПустаяСсылка());
	ПараметрыПроцедуры.Вставить("Этапы", Новый ФиксированныйМассив(Новый Массив));
	ПараметрыПроцедуры.Вставить("ЭтапыАналитика", ЭтапыОтборАналитика);
	
	Возврат ПараметрыПроцедуры;
	
КонецФункции

Процедура ЗаполнитьДеревоРекурсивноПоОтчету(СтрокиДерева, СтрокиСтруктуры)
	
	Для каждого СтрокаСтруктура Из СтрокиСтруктуры Цикл
		
		НоваяСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтруктура);
		Если СтрокаСтруктура.Строки.Количество() > 0 Тогда
			ЗаполнитьДеревоРекурсивноПоОтчету(НоваяСтрока.Строки, СтрокаСтруктура.Строки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СобратьКоличествоВходящихНоменклатурРекурсивно(СоответствиеНоменклатур, ИсходныйУзел, СчетчикСтрок)
	Для Каждого ДочерняяСтрока Из ИсходныйУзел.Строки Цикл
		Если ДочерняяСтрока.Отменено Тогда
		    Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДочерняяСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		СчетчикСтрок = СчетчикСтрок + 1;
		ДочерняяСтрока.СчетчикСтрок = СчетчикСтрок;
		ДочерняяСтрока.ИдСтроки = Новый УникальныйИдентификатор; 
		
		КоличествоНоменклатуры = СоответствиеНоменклатур[ДочерняяСтрока.Номенклатура];
		Если КоличествоНоменклатуры = Неопределено Тогда
			СоответствиеНоменклатур.Вставить(ДочерняяСтрока.Номенклатура, ДочерняяСтрока.Требуется);
		Иначе	
			СоответствиеНоменклатур.Вставить(ДочерняяСтрока.Номенклатура, КоличествоНоменклатуры + ДочерняяСтрока.Требуется);
		КонецЕсли; 
		СобратьКоличествоВходящихНоменклатурРекурсивно(СоответствиеНоменклатур, ДочерняяСтрока, СчетчикСтрок);
	КонецЦикла;
КонецПроцедуры

Процедура РассчитатьДолюПодчиненыхСтрокДереваРекурсивно(СоответствиеНоменклатур, ДеревоЗаказа) 
	СтрокиПродукция = ДеревоЗаказа.Строки;
	Для каждого СтрокаНоменклатуры Из СоответствиеНоменклатур Цикл 
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаНоменклатуры.Ключ);
		СтрокиДерева = СтрокиПродукция.НайтиСтроки(СтруктураОтбора, Истина);
		Если СтрокиДерева.Количество() = 1 Тогда
		    СтрокиДерева[0].Доля = 1;
		    СтрокиДерева[0].ТребуетсяВсего = СтрокиДерева[0].Требуется;
		Иначе	
			МассивКоличества = Новый Массив;
			ТребуетсяВсего = 0;
			Для каждого СтрокаДерева Из СтрокиДерева Цикл
				МассивКоличества.Добавить(СтрокаДерева.Требуется); 
				ТребуетсяВсего = ТребуетсяВсего + СтрокаДерева.Требуется;
			КонецЦикла;
			МассивДоли = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(1,
				МассивКоличества, 6);
			Для Индекс = 0 По СтрокиДерева.Количество() - 1 Цикл 
				Доля = ?(МассивДоли = Неопределено, 1, МассивДоли[Индекс]);
				Если ЗначениеЗаполнено(Доля) Тогда
		    		СтрокиДерева[Индекс].Доля = Доля;
		    		СтрокиДерева[Индекс].ТребуетсяВсего = ТребуетсяВсего;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРодителяПоНомеруУровня(СтрокаДерева, Уровень, ЭлементЗаказ)
	ТекущийУровеньСтроки = СтрокаДерева.Уровень; 
	Если ТекущийУровеньСтроки = Уровень Тогда
		РодительПоУровню = СтрокаДерева.Ссылка;
	Иначе	
		ТекущийЭлемент = СтрокаДерева; 
		РодительПоУровню = Неопределено;
		Пока Истина Цикл 
			Родитель = ТекущийЭлемент.Родитель;
			ТекущийУровеньРодителя = Родитель.Уровень; 
			Если ТекущийУровеньРодителя = Уровень Тогда
				РодительПоУровню = Родитель;
				Прервать;
			ИначеЕсли ТекущийУровеньРодителя = 0 Тогда
				Прервать;
			Иначе
				ТекущийЭлемент = Родитель;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Если РодительПоУровню = Неопределено Тогда
		Если Уровень = 1 Тогда
			РодительПоУровню = СтрокаДерева.Ссылка;
		Иначе	
			ПредыдущийУровень = Уровень - 1;
			РодительПоУровню = СтрокаДерева["СтрокаДереваУровень" + ПредыдущийУровень]; 
		КонецЕсли;
	КонецЕсли;
    Возврат РодительПоУровню;
КонецФункции // ()

#КонецОбласти

