#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если Параметры.Свойство("ЭтоДоходы") Тогда
		ЭтоДоходы = Параметры.ЭтоДоходы;
	КонецЕсли;
	Элементы.СтатьяДоходов.Видимость = ЭтоДоходы;
	Элементы.СтатьяРасходов.Видимость = НЕ ЭтоДоходы;
	ПолучитьРазрешенныеСчетаИСтатьи();
	ПерваяСтрока = 2;
	КолонкаКодНоменклатуры = 1; 
	КолонкаСклад = 5;
	КолонкаНаправлениеДеятельности = 4;
	КолонкаКодПодразделения = 6;
	КолонкаСумма = 7;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СтатьяАктивовПассивовПриИзменении(Элемент)  
	СтатьяАктивовПассивовПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Интерактивно = Ложь;
	ИмяФайлаДанных = СокрЛП(ФайлДанных);
	
	ТекстСообщения = НСтр("ru = 'Начало загрузки резервов из файла %1'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяФайлаДанных);
	ЗаписатьВПротокол(ТекстСообщения, Истина, Истина);
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаВТаблицу", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОповещениеЗавершения, ПараметрыЗагрузки, ИмяФайлаДанных);

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Если Данные.Количество() = 0 Тогда
		ТекстСообщения =  НСтр("ru = 'Нет данных для загрузки'");
		ЗаписатьВПротоколНаСервере(ТекстСообщения);
		Возврат;
	КонецЕсли;
	СтруктураОтбора = Новый Структура("ЕстьОшибки", Истина);
	СтрокиЕстьОшибки = Данные.НайтиСтроки(СтруктураОтбора);
	ЕстьОшибки =  (НЕ СтрокиЕстьОшибки.Количество() = 0);
	
	Если ЕстьОшибки Тогда
		ТекстСообщения =  НСтр("ru = 'Не все ошибки исправлены'");
		ЗаписатьВПротоколНаСервере(ТекстСообщения);
		ТекстСообщения = НСтр("ru = 'Документ не изменен'");
		ЗаписатьВПротоколНаСервере(ТекстСообщения, Истина);
		Возврат;
	КонецЕсли;
	
	Адрес = ПоместитьТаблицуВХранилище();
	Результат = Новый Структура; 
	Результат.Вставить("ЭтоДоходы", ЭтоДоходы);
	Результат.Вставить("СтатьяДоходов", СтатьяДоходов);
	Результат.Вставить("СтатьяРасходов", СтатьяРасходов);
	Результат.Вставить("СтатьяАктивовПассивов", СтатьяАктивовПассивов);
	Результат.Вставить("Адрес", Адрес);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибки(Команда)
	ОтборСтрок = Новый ФиксированнаяСтруктура(
		"ЕстьОшибки",
		Истина);
	Элементы.Данные.ОтборСтрок = ОтборСтрок;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	Элементы.Данные.ОтборСтрок = Неопределено;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл Excel с данными";
	Диалог.ПолноеИмяФайла = "";
	Диалог.Фильтр = ""
			+ "Формат XLSX (*.xls;*.xlsx)|*.xls;*.xlsx|";
			
	СтруктураДиалог = Новый Структура("Диалог", Диалог);
	ОписаниеОповещения = Новый ОписаниеОповещения("ФайлДанныхОбработкаВыбораЗавершение", ЭтотОбъект, СтруктураДиалог);
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанные
&НаКлиенте
Процедура ДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКорНаправлениеДеятельностиПриИзменении(Элемент)
	УстановитьПризнакОшибки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНоменклатураПриИзменении(Элемент)
	УстановитьПризнакОшибки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСкладПриИзменении(Элемент)
	УстановитьПризнакОшибки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПодразделениеПриИзменении(Элемент)
	УстановитьПризнакОшибки();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаВТаблицу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	ИмяФайла = Результат.Имя;
	АдресВременногоХранилища = Результат.Хранение;
	
	ИмяФайла = ПолучитьИмяФайлаБезПолногоПути(Результат.Имя);
	
	Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла));
	
	ЗагрузитьДанныеИзФайлаНаСервере(АдресВременногоХранилища, ИмяФайла, Расширение);
	
	ТекстОповещения = НСтр("ru = 'Загрузка резервов МПЗ времени'");
	ТекстПояснения  = НСтр("ru = 'Прочитаны данные из файла'");
	ПоказатьОповещениеПользователя(ТекстОповещения,, ТекстПояснения, БиблиотекаКартинок.Информация32);
	
	ТекстСообщения = НСтр("ru = 'Окончание загрузки из файла %1 (считано %2 строк)'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, Результат.Имя, ТекущийНомерСтрокиФайла);
	ЗаписатьВПротокол(ТекстСообщения, Истина);
	
	ЕстьОшибкиВФайле = Ложь;  
	СтруктураОтбора = Новый Структура("ЕстьОшибки", Истина);
	СтрокиЕстьОшибки = Данные.НайтиСтроки(СтруктураОтбора);
	ЕстьОшибкиВФайле =  (НЕ СтрокиЕстьОшибки.Количество() = 0);
		
	Если ЕстьОшибкиВФайле Тогда
		ТекстСообщения = НСтр("ru = 'В загруженном файле есть ошибки. Подробнее на вкладке Протокол'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Элементы.ФормаПеренестиВДокумент.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СтатьяАктивовПассивовПриИзмененииНаСервере()
	СчетУчета =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяАктивовПассивов, "СчетУчета");	
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		Для каждого Строка  Из Данные Цикл
			Строка.СчетУчета = СчетУчета;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

Процедура ПолучитьРазрешенныеСчетаИСтатьи() 
	РазрешенныеСчета.Очистить();
	СчетРодитель = ПланыСчетов.Хозрасчетный.РезервыПодСнижениеСтоимостиМЦ;
    МассивВидовСубконто = Новый Массив;
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.ВидСубконто В(&МассивВидовСубконто)
	|	И ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ(&СчетРодитель)";
	
	Запрос.УстановитьПараметр("МассивВидовСубконто", МассивВидовСубконто);
	Запрос.УстановитьПараметр("СчетРодитель", СчетРодитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСчетов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивСчетов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	РазрешенныеСчета.ЗагрузитьЗначения(МассивСчетов);
	Элементы.ДанныеСчетУчета.СписокВыбора.ЗагрузитьЗначения(МассивСчетов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиАктивовПассивов.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|ГДЕ
	|	НЕ СтатьиАктивовПассивов.ПометкаУдаления
	|	И СтатьиАктивовПассивов.СчетУчета В(&МассивСчетов)
	|	И НЕ СтатьиАктивовПассивов.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Элементы.СтатьяАктивовПассивов.СписокВыбора.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.СтатьяАктивовПассивов.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаНаСервере(АдресВременногоХранилища, ИмяФайла, Расширение)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ШаблонСДанными = Новый ТабличныйДокумент;
	ШаблонСДанными.Прочитать(ИмяВременногоФайла);
	ФайловаяСистема.УдалитьВременныйФайл(ИмяВременногоФайла);
	ВсегоСтрок = ШаблонСДанными.ВысотаТаблицы;
		
	Данные.Очистить(); 
	ВсегоСтрок = ШаблонСДанными.ВысотаТаблицы;
	Для ТекРяд = ПерваяСтрока По ВсегоСтрок Цикл
		СтрокаТаблицы = Данные.Добавить();
		СтрокаТаблицы.НомерСтрокиФайла = ТекРяд;

		Ячейка = ШаблонСДанными.ПолучитьОбласть(ТекРяд, КолонкаКодНоменклатуры).ТекущаяОбласть;
		ЗначениеФайл = СокрЛП(Ячейка.Текст);
		СтрокаТаблицы.НоменклатураФайл =  ЗначениеФайл;
		
		Ячейка = ШаблонСДанными.ПолучитьОбласть(ТекРяд, КолонкаСклад).ТекущаяОбласть;
		ЗначениеФайл = СокрЛП(Ячейка.Текст);
		СтрокаТаблицы.СкладФайл =  ЗначениеФайл;
	
		Ячейка = ШаблонСДанными.ПолучитьОбласть(ТекРяд, КолонкаНаправлениеДеятельности).ТекущаяОбласть;
		ЗначениеФайл = СокрЛП(Ячейка.Текст);
		СтрокаТаблицы.НаправлениеДеятельностиФайл =  ЗначениеФайл;
	
		Ячейка = ШаблонСДанными.ПолучитьОбласть(ТекРяд, КолонкаКодПодразделения).ТекущаяОбласть;
		ЗначениеФайл = СокрЛП(Ячейка.Текст);
		СтрокаТаблицы.ПодразделениеФайл =  ЗначениеФайл;
	
		Ячейка = ШаблонСДанными.ПолучитьОбласть(ТекРяд, КолонкаСумма).ТекущаяОбласть;
		ЗначениеФайл = СокрЛП(Ячейка.Текст);
		Сумма    = ПриведениеЗначениеКТипуЧисло(ЗначениеФайл); 
		СтрокаТаблицы.Сумма =  Сумма;
		
        СтрокаТаблицы.СчетУчета = СчетУчета;
	КонецЦикла;
	
	ТекущийНомерСтрокиФайла = ТекРяд - 1;
	ОбработатьТаблицуНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ОбработатьТаблицуНаСервере(ТабельныйНомер = Неопределено, Сотрудник = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабДанных.НомерСтрокиФайла КАК НомерСтрокиФайла,
	|	ТабДанных.СчетУчета КАК СчетУчета,
	|	ТабДанных.НоменклатураФайл КАК НоменклатураФайл,
	|	ТабДанных.СкладФайл КАК СкладФайл,
	|	ТабДанных.НаправлениеДеятельностиФайл КАК НаправлениеДеятельностиФайл,
	|	ТабДанных.ПодразделениеФайл КАК ПодразделениеФайл,
	|	ТабДанных.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТабДанных
	|ИЗ
	|	&ТабДанных КАК ТабДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДанных.НомерСтрокиФайла КАК НомерСтрокиФайла,
	|	ТабДанных.СчетУчета КАК СчетУчета,
	|	ТабДанных.НоменклатураФайл КАК НоменклатураФайл,
	|	ТабДанных.СкладФайл КАК СкладФайл,
	|	ТабДанных.НаправлениеДеятельностиФайл КАК НаправлениеДеятельностиФайл,
	|	ТабДанных.ПодразделениеФайл КАК ПодразделениеФайл,
	|	ТабДанных.Сумма КАК Сумма,
	|	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(СтруктураПредприятия.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(Склады.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ЕСТЬNULL(НаправленияДеятельности.Ссылка, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности
	|ПОМЕСТИТЬ ТабОбработано
	|ИЗ
	|	ТабДанных КАК ТабДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабДанных.НоменклатураФайл = СпрНоменклатура.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО ТабДанных.ПодразделениеФайл = СтруктураПредприятия.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО ТабДанных.СкладФайл = Склады.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|		ПО ТабДанных.НаправлениеДеятельностиФайл = НаправленияДеятельности.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОбработано.НомерСтрокиФайла КАК НомерСтрокиФайла,
	|	""Не найдена номенклатура по коду %1"" КАК ОписаниеОшибки,
	|	ТабОбработано.НоменклатураФайл КАК ПолеПоиска
	|ИЗ
	|	ТабОбработано КАК ТабОбработано
	|ГДЕ
	|	НЕ ТабОбработано.НоменклатураФайл = """"
	|	И ТабОбработано.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабОбработано.НомерСтрокиФайла,
	|	""Не найдено подразделение по коду %1"",
	|	ТабОбработано.ПодразделениеФайл
	|ИЗ
	|	ТабОбработано КАК ТабОбработано
	|ГДЕ
	|	НЕ ТабОбработано.ПодразделениеФайл = """"
	|	И ТабОбработано.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабОбработано.НомерСтрокиФайла,
	|	""Не найден склад по наименованию %1"",
	|	ТабОбработано.СкладФайл
	|ИЗ
	|	ТабОбработано КАК ТабОбработано
	|ГДЕ
	|	НЕ ТабОбработано.СкладФайл = """"
	|	И ТабОбработано.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабОбработано.НомерСтрокиФайла,
	|	""Не найдено направление деятельности по наименованию %1"",
	|	ТабОбработано.НаправлениеДеятельностиФайл
	|ИЗ
	|	ТабОбработано КАК ТабОбработано
	|ГДЕ
	|	НЕ ТабОбработано.НаправлениеДеятельностиФайл = """"
	|	И ТабОбработано.КорНаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОбработано.НомерСтрокиФайла КАК НомерСтрокиФайла,
	|	ТабОбработано.СчетУчета КАК СчетУчета,
	|	ТабОбработано.НоменклатураФайл КАК НоменклатураФайл,
	|	ТабОбработано.СкладФайл КАК СкладФайл,
	|	ТабОбработано.НаправлениеДеятельностиФайл КАК НаправлениеДеятельностиФайл,
	|	ТабОбработано.ПодразделениеФайл КАК ПодразделениеФайл,
	|	ТабОбработано.Сумма КАК Сумма,
	|	ТабОбработано.Номенклатура КАК Номенклатура,
	|	ТабОбработано.Подразделение КАК Подразделение,
	|	ТабОбработано.Склад КАК Склад,
	|	ТабОбработано.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности
	|ИЗ
	|	ТабОбработано КАК ТабОбработано";
	ТабДанных = Данные.Выгрузить(); 
	Запрос.УстановитьПараметр("ТабДанных", ТабДанных);

	ПакетЗапросов = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = ПакетЗапросов.Количество();
	СдвигНомераРезультатаВПакете = 2;
	ВыборкаОшибок = ПакетЗапросов[КоличествоРезультатов - СдвигНомераРезультатаВПакете].Выбрать();
	МассивСтрокСОшибками = Новый Массив;
	Пока ВыборкаОшибок.Следующий() Цикл
		ОписаниеОшибки = ВыборкаОшибок.ОписаниеОшибки;
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, ВыборкаОшибок.ПолеПоиска);
		ТекстСообщения =  НСтр("ru = 'В строке файла № %1 %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаОшибок.НомерСтрокиФайла, ОписаниеОшибки);
		ЗаписатьВПротоколНаСервере(ТекстСообщения);   
		Если МассивСтрокСОшибками.Найти(ВыборкаОшибок.НомерСтрокиФайла) = Неопределено Тогда
		     МассивСтрокСОшибками.Добавить(ВыборкаОшибок.НомерСтрокиФайла);
		КонецЕсли;
	КонецЦикла;
	СдвигНомераРезультатаВПакете = 1;
	ТабДанных = ПакетЗапросов[КоличествоРезультатов - СдвигНомераРезультатаВПакете].Выгрузить();
	Данные.Загрузить(ТабДанных);
	Для каждого Стр Из Данные Цикл 
		Стр.ЕстьОшибки = НЕ МассивСтрокСОшибками.Найти(Стр.НомерСтрокиФайла) = Неопределено;
	КонецЦикла;

КонецПроцедуры

#Область СообщенияИПротокол

&НаКлиенте
Процедура ЗаписатьВПротокол(ТекстСообщения, ДобавитьДату = Ложь, ДобавитьРазделитель = Ложь)
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		
		Протокол = Протокол + Символы.ПС;
		
		Если ДобавитьРазделитель Тогда
			Протокол = Протокол + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
		
	Если ДобавитьДату Тогда
		Протокол = Протокол + Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT") + " ";
	КонецЕсли;
	
	Протокол = Протокол + ТекстСообщения;
	
	Если ДобавитьРазделитель Тогда
		Протокол = Протокол + Символы.ПС + "----------------";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВПротоколНаСервере(ТекстСообщения, ДобавитьРазделитель = Ложь)
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		
		Протокол = Протокол + Символы.ПС;
		
	КонецЕсли;
	
	Протокол = Протокол +  ТекстСообщения;
	
	Если ДобавитьРазделитель Тогда
		Протокол = Протокол + Символы.ПС + "----------------";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныхОбработкаВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ФайлДанных = Диалог.ПолноеИмяФайла;
	КонецЕсли;
		
	Элементы.ФормаЗагрузитьИзФайла.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьИмяФайлаБезПолногоПути(ПолныйПутьКФайлу)
	
	Результат = "";
	МассивСтрок = СтрРазделить(ПолныйПутьКФайлу, "\", Ложь);
	Если МассивСтрок.Количество() > 1 Тогда
		Результат = МассивСтрок[МассивСтрок.Количество() - 1];
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПриведениеЗначениеКТипуЧисло(Знач Значение)
	
	Отрицательное = Ложь;
	
	Значение = СокрЛП(Значение);
	Если Лев(Значение, 1) = "-" Тогда
		Отрицательное = Истина;
	КонецЕсли;
			
	НецифровыеСимволы = СтрСоединить(СтрРазделить(Значение, "1234567890,."));
	Значение = СтрСоединить(СтрРазделить(Значение, НецифровыеСимволы));
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипаЧисло.ПривестиЗначение(Значение);
	
	Если Отрицательное И Результат > 0 Тогда
		Результат = -1 * Результат;
	КонецЕсли;
	 
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьОшибкиВСтроке(СтрокаТЧ)
	ЕстьОшибки = Ложь;
	Если ЗначениеЗаполнено(СтрокаТЧ.НаправлениеДеятельностиФайл) И 
		НЕ ЗначениеЗаполнено(СтрокаТЧ.КорНаправлениеДеятельности) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЧ.НоменклатураФайл) И 
		НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЧ.СкладФайл) И 
		НЕ ЗначениеЗаполнено(СтрокаТЧ.Склад) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЧ.ПодразделениеФайл) И 
		НЕ ЗначениеЗаполнено(СтрокаТЧ.Подразделение) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат ЕстьОшибки;
КонецФункции 

&НаКлиенте
Процедура УстановитьПризнакОшибки()
    ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.ЕстьОшибки = ЕстьОшибкиВСтроке(ТекущиеДанные);
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуВХранилище()
	Адрес = ПоместитьВоВременноеХранилище(Данные.Выгрузить());
	Возврат Адрес;
КонецФункции // ()

#КонецОбласти
