#Область ОбработчикиСобытийЭлементовСтраницыФормыТрудозатратыОбеспечениеМатериаламиИРаботамиРасходМатериаловИРабот

// #юум {
// #04.02.01
// Разграничение доступа к содержимому страниц в зависимости от назначенной роли
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("СтраницыПриСменеСтраницы")
Процедура юум_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущийПользователь = юум_ПолучитьТекущегоПользователя();
	ДоступныеРеквизиты = Новый Массив;
	
	Если ТекущаяСтраница.Имя = "СтраницаТрудозатраты" Тогда
		
		Если ТекущийПользователь <> "НачальникЦеха" Тогда
			
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.ТрудозатратыДобавить.Доступность             = Ложь; 
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.ТрудозатратыГруппаЗаполнить.Доступность      = Ложь;
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.Трудозатраты_СкопироватьСтроки.Доступность   = Ложь;
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.Трудозатраты_ВставитьСтроки.Доступность      = Ложь;
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.Трудозатраты_РазбитьСтроку.Доступность       = Ложь;
			
			Для Каждого Колонка Из Элементы.Трудозатраты.ПодчиненныеЭлементы Цикл
				
				Если ДоступныеРеквизиты.Найти(Колонка.Имя) = Неопределено Тогда 
					
					Колонка.Доступность = Ложь;     
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаОбеспечениеМатериаламиИРаботами" Тогда
		
		Если ТекущийПользователь <> "НачальникЦеха" Тогда 
			
            Элементы.ОбеспечениеМатериаламиИРаботами.КоманднаяПанель.ПодчиненныеЭлементы.ОбеспечениеМатериаламиИРаботамиДобавить.Доступность = Ложь;
			
			ДоступныеРеквизиты.Добавить("ОбеспечениеМатериаламиИРаботамиЕстьАналогиМатериала");
			ДоступныеРеквизиты.Добавить("ОбеспечениеМатериаламиИРаботамиСерия");
			
			Для Каждого Колонка Из Элементы.ОбеспечениеМатериаламиИРаботами.ПодчиненныеЭлементы Цикл
				
				Если ДоступныеРеквизиты.Найти(Колонка.Имя) = Неопределено Тогда 
					
					Колонка.Доступность = Ложь;  
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "РасходМатериаловИРабот" Тогда
		
		Если ТекущийПользователь <> "НачальникЦеха" Тогда 
						
            ДоступныеРеквизиты.Добавить("РасходМатериаловИРаботДатаРасхода");
			
			Для Каждого Колонка Из Элементы.РасходМатериаловИРабот.ПодчиненныеЭлементы Цикл
				
				Если ДоступныеРеквизиты.Найти(Колонка.Имя) = Неопределено Тогда 
					
					Колонка.Доступность = Ложь;  
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
		Если ТекущийПользователь = "Мастер" Тогда  
			
			Элементы.РасходМатериаловИРабот_ЗаполнитьДатуРасхода.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 
// } #юум

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбеспечениеМатериаламиИРаботами

// #юум {
// #04.02.01
// Запрет на удаление содержимого ТЧ, если у пользователя нет роли юум_НачальникЦеха
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&Перед("ОбеспечениеМатериаламиИРаботамиПередУдалением")
Процедура юум_ОбеспечениеМатериаламиИРаботамиПередУдалением(Элемент, Отказ)
	
	ТекущийПользователь = юум_ПолучитьТекущегоПользователя();
	
	Если ТекущийПользователь <> "НачальникЦеха" Тогда
		
		юум_СообщениеОДоступности();
		Отказ = Истина;  
		
	КонецЕсли; 
		
КонецПроцедуры
// } #юум

#КонецОбласти 

#Область ОбработчикиКомандФормы 

// #юум {
// #04.02.01
// При изменении статуса документа на "Завершен" осуществляется заполнение ТЧ "РасходМатериаловИРабот"
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("СтатусПриИзменении")
Процедура юум_СтатусПриИзменении(Элемент)
		
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") Тогда
		
		юум_ВызватьЗаполнениеИзМодуляМенеджера();
		юум_УстановитьДатуРасходаПоПередачеВПроизводство();
			
	КонецЕсли;
	
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Дополнение данных из закладки обеспечение на закладку расход (предварительно вызывается типовой метод), заполнение даты расхода для полуфабрикатов - данными со страницы обеспечение, для остального - датой из документа "Передача в производство"
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("РасходМатериаловИРабот_ДополнитьПоДаннымОбеспечения")
Процедура юум_РасходМатериаловИРабот_ДополнитьПоДаннымОбеспечения(Команда)
	
	юум_УстановитьДатуРасходаПоПередачеВПроизводство();
	
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Заполнение данных из закладки обеспечение на закладку расход (логика типового метода), заполнение даты расхода для полуфабрикатов - данными со страницы обеспечение, для остального - датой из документа "Передача в производство"
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспечения")
Процедура юум_РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспечения(Команда)
	
	юум_ВызватьЗаполнениеИзМодуляМенеджера();
	юум_УстановитьДатуРасходаПоПередачеВПроизводство();
	
КонецПроцедуры 
// } #юум

&НаКлиенте
&ИзменениеИКонтроль("РасходМатериаловИРабот_ЗаполнитьДатуРасхода")
Процедура юум_РасходМатериаловИРабот_ЗаполнитьДатуРасхода(Команда)
	
	// #юум {
	// #04.02.01
	// Убрано окно, вводящее дату расхода для всех элементов ТЧ одной датой. 	
	// Галфинд AMotorin 2026/09/28
	#Удаление
	Если Элементы.РасходМатериаловИРабот.ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Необходимо выбрать материалы, для которых необходимо заполнить дату расхода.';
		|en = 'Select the materials for which it is required to populate the consumption date.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("РасходМатериаловИРабот_ЗаполнитьДатуРасходаЗавершение", ЭтотОбъект, Элементы.РасходМатериаловИРабот.ВыделенныеСтроки);
	ОбщегоНазначенияУТКлиент.ВвестиДатуСКонтролемПустогоЗначения(
	НачалоДняТекущаяДатаСеанса(), 
	НСтр("ru = 'Введите дату расхода материалов (работ)';
	|en = 'Enter the material (work) consumption date'"), 
	ЧастиДаты.Дата, Оповещение);
	#КонецУдаления
	// } #юум
		
	// #юум {
	// #04.02.01
	// При нажатии на заполнить дата расхода выполняется логика, описанная в процедуре этого расширения "юум_РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспечения" 	
	// Галфинд AMotorin 2026/09/28
	#Вставка
	юум_ВызватьЗаполнениеИзМодуляМенеджера();
	юум_УстановитьДатуРасходаПоПередачеВПроизводство();
	#КонецВставки
	// } #юум

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #юум {
// #04.02.01
// Сообщение о доступности
// Галфинд AMotorin 2026/09/28
&НаКлиенте
Процедура юум_СообщениеОДоступности()
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Данное действие доступно только начальнику цеха";
	Сообщение.Сообщить();
	
КонецПроцедуры 
// } #юум

// #юум {
// #04.02.01
// Серверный вызов метода модуля менеджера документа ЭтапПроизводства2_2
// Галфинд AMotorin 2026/09/28
&НаСервере
Процедура юум_ВызватьЗаполнениеИзМодуляМенеджера()
	
	Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(Объект, 0);
	
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Установка даты передачи материало в производство для статьи калькуляции "ПолуфабрикатыПроизводимыеВПроцессе" - дата с закладки обеспчение, остальные статьи - дата из документа "Передача материалов в производство"
// Галфинд AMotorin 2026/09/28
&НаКлиенте
Процедура юум_УстановитьДатуРасходаПоПередачеВПроизводство()
	
	СтатьяПолуфабрикаты = ПредопределенноеЗначение("Справочник.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе");
	ДатаДляОстальныхСтатей = юум_ПолучитьДатуПередачиВПроизводство(Объект.Ссылка);
	
	Для Каждого СтрокаТЧ Из Объект.РасходМатериаловИРабот Цикл
		
		Если СтрокаТЧ.СтатьяКалькуляции = СтатьяПолуфабрикаты Тогда 
			
			Продолжить;
			
		Иначе
		
			СтрокаТЧ.ДатаРасхода = ДатаДляОстальныхСтатей;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Получение даты производсва для строк ТЧ со статьей калькуляции отличной от "Полуфабрикаты, производимые в процессе"
// Галфинд AMotorin 2026/09/28
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка.ЭтапПроизводства2_2 - Ссылка на текущий документ
//
// Возвращаемое значение:
//	ДатаПередачиВПроизводство - Дата 
//
&НаСервереБезКонтекста
Функция юум_ПолучитьДатуПередачиВПроизводство(СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаМатериаловВПроизводство.Дата КАК Дата
		|ИЗ
		|	Документ.ПередачаМатериаловВПроизводство КАК ПередачаМатериаловВПроизводство
		|ГДЕ
		|	ПередачаМатериаловВПроизводство.Распоряжение = &СсылкаНаДокументРаспоряжение";
	
	Запрос.УстановитьПараметр("СсылкаНаДокументРаспоряжение", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		ДатаПередачиВПроизводство = ВыборкаДетальныеЗаписи.Дата;
		
	КонецЦикла;
	
	Возврат ДатаПередачиВПроизводство;
	
КонецФункции
// } #юум

// #юум {
// #04.02.01
// Получение текущего пользователя (роли)
// Галфинд AMotorin 2026/09/28
//
// Возвращаемое значение:
//	Строка - "НачальникСмены" или "Мастер"
//
&НаСервереБезКонтекста
Функция юум_ПолучитьТекущегоПользователя()
	
	Если Пользователи.РолиДоступны("юум_НачальникСмены") Тогда
		
		ТекущийПользователь = "НачальникСмены";
		
	ИначеЕсли Пользователи.РолиДоступны("юум_Мастер") Тогда  
		
		ТекущийПользователь = "Мастер";
		
	ИначеЕсли Пользователи.РолиДоступны("юум_НачальникЦеха") Тогда
		
		ТекущийПользователь = "НачальникЦеха";
		
	КонецЕсли;

	Возврат ТекущийПользователь; 

КонецФункции	
// } #юум

#КонецОбласти