#Область ОбработчикиСобытийЭлементовСтраницыФормыТрудозатратыОбеспечениеМатериаламиИРаботамиРасходМатериаловИРабот

// #юум {
// #04.02.01
// Разграничение доступа к содержимому страниц в зависимости от назначенной роли
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("СтраницыПриСменеСтраницы")
Процедура юум_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущийПользователь = юум_ПолучитьТекущегоПользователя();
	ДоступныеРеквизиты = Новый Массив;
	
	Если ТекущаяСтраница.Имя = "СтраницаТрудозатраты" Тогда
		
		Если ТекущийПользователь <> "НачальникЦеха" И ТекущийПользователь <> "ПользовательСПолнымиПравами" Тогда
			
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.ТрудозатратыДобавить.Доступность             = Ложь; 
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.ТрудозатратыГруппаЗаполнить.Доступность      = Ложь;
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.Трудозатраты_СкопироватьСтроки.Доступность   = Ложь;
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.Трудозатраты_ВставитьСтроки.Доступность      = Ложь;
			Элементы.Трудозатраты.КоманднаяПанель.ПодчиненныеЭлементы.Трудозатраты_РазбитьСтроку.Доступность       = Ложь;
			
			ДоступныеРеквизиты.Добавить("ТрудозатратыГруппаВыполнено");
						
			Для Каждого Колонка Из Элементы.Трудозатраты.ПодчиненныеЭлементы Цикл
				
				Если ДоступныеРеквизиты.Найти(Колонка.Имя) = Неопределено Тогда 
					
					Колонка.Доступность = Ложь;     
					
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаОбеспечениеМатериаламиИРаботами" Тогда
		
		Если ТекущийПользователь <> "НачальникЦеха" И ТекущийПользователь <> "ПользовательСПолнымиПравами" Тогда 
			
            Элементы.ОбеспечениеМатериаламиИРаботами.КоманднаяПанель.ПодчиненныеЭлементы.ОбеспечениеМатериаламиИРаботамиДобавить.Доступность = Ложь;
			
			ДоступныеРеквизиты.Добавить("ОбеспечениеМатериаламиИРаботамиЕстьАналогиМатериала");
			ДоступныеРеквизиты.Добавить("ОбеспечениеМатериаламиИРаботамиСерия");
			ДоступныеРеквизиты.Добавить("ОбеспечениеМатериаламиИРаботамиВариантОбеспечения");
			
			Для Каждого Колонка Из Элементы.ОбеспечениеМатериаламиИРаботами.ПодчиненныеЭлементы Цикл
				
				Если ДоступныеРеквизиты.Найти(Колонка.Имя) = Неопределено Тогда 
					
					Колонка.Доступность = Ложь;  
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаРасходМатериаловИРабот" Тогда
		
		Если ТекущийПользователь <> "НачальникЦеха" И ТекущийПользователь <> "ПользовательСПолнымиПравами" Тогда
			
			Элементы.РасходМатериаловИРабот.КоманднаяПанель.ПодчиненныеЭлементы.РасходМатериаловИРаботДобавить.Доступность = Ложь;
						
            ДоступныеРеквизиты.Добавить("РасходМатериаловИРаботДатаРасхода");
			
			Для Каждого Колонка Из Элементы.РасходМатериаловИРабот.ПодчиненныеЭлементы Цикл
				
				Если ДоступныеРеквизиты.Найти(Колонка.Имя) = Неопределено Тогда 
					
					Колонка.Доступность = Ложь;  
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
		Если ТекущийПользователь = "Мастер" Тогда  
			
			Элементы.РасходМатериаловИРабот_ЗаполнитьДатуРасхода.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 
// } #юум

#КонецОбласти

#Область ОбработчикиКомандФормы 

// #юум {
// #04.02.01
// При изменении статуса документа на "Завершен" осуществляется заполнение ТЧ "РасходМатериаловИРабот"
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("СтатусПриИзменении")
Процедура юум_СтатусПриИзменении(Элемент)
		
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") Тогда
		
		юум_ВызватьЗаполнениеИзМодуляМенеджера(0);
		юум_УстановитьДатуРасхода();
			
	КонецЕсли;
	
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Дополнение данных из закладки обеспечение на закладку расход (предварительно вызывается типовой метод), заполнение даты расхода для полуфабрикатов - данными со страницы обеспечение, для остального - датой из документа "ДвижениеПродукцииИМатериалов"
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&После("РасходМатериаловИРабот_ДополнитьПоДаннымОбеспечения")
Процедура юум_РасходМатериаловИРабот_ДополнитьПоДаннымОбеспечения(Команда)
	
	юум_ВызватьЗаполнениеИзМодуляМенеджера(1);
	юум_УстановитьДатуРасхода();
	
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Убрано окно с вопросом, которое позволяет отказаться от перезаполнения ТЧ страницы "Расход".  	
// Галфинд AMotorin 2026/10/09
&НаКлиенте
&ИзменениеИКонтроль("РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспечения")
Процедура юум_РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспечения(Команда)
	
	#Удаление
	Если Объект.РасходМатериаловИРабот.Количество() <> 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перезаполнить табличную часть по данным обеспечения
		|с учетом неизрасходованных материалов?';
		|en = 'Refill the table according to supply data 
		|considering unused materials?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспеченияЗавершение", ЭтотОбъект);
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Заполнить';
		|en = 'Fill'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок); 
	Иначе
		РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспеченияЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	#КонецУдаления
	
	#Вставка
	// #юум {
	// #04.02.01
	// При повторной попытке заполнения уже заполненной ТЧ страницы "Расход" происходит заполнение, дополнительно подтягиваются новые записи из страницы обеспечения.	
	// Галфинд AMotorin 2026/10/09
	юум_ВызватьЗаполнениеИзМодуляМенеджера(0);
	юум_УстановитьДатуРасхода();
	// } #юум
	#КонецВставки

КонецПроцедуры
// } #юум

// #юум {
// #04.02.01
// Убрано окно, вводящее дату расхода для всех элементов ТЧ одной датой. Новая логика работы описана в области вставки. 	
// Галфинд AMotorin 2026/09/28
&НаКлиенте
&ИзменениеИКонтроль("РасходМатериаловИРабот_ЗаполнитьДатуРасхода")
Процедура юум_РасходМатериаловИРабот_ЗаполнитьДатуРасхода(Команда)
	
	#Удаление
	Если Элементы.РасходМатериаловИРабот.ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Необходимо выбрать материалы, для которых необходимо заполнить дату расхода.';
		|en = 'Select the materials for which it is required to populate the consumption date.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("РасходМатериаловИРабот_ЗаполнитьДатуРасходаЗавершение", ЭтотОбъект, Элементы.РасходМатериаловИРабот.ВыделенныеСтроки);
	ОбщегоНазначенияУТКлиент.ВвестиДатуСКонтролемПустогоЗначения(
	НачалоДняТекущаяДатаСеанса(), 
	НСтр("ru = 'Введите дату расхода материалов (работ)';
	|en = 'Enter the material (work) consumption date'"), 
	ЧастиДаты.Дата, Оповещение);
	#КонецУдаления
		
	#Вставка
	// #юум {
	// #04.02.01
	// При нажатии на заполнить дата расхода выполняется логика, описанная в процедуре этого расширения "юум_РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспечения" 	
	// Галфинд AMotorin 2026/09/28
	юум_ВызватьЗаполнениеИзМодуляМенеджера(0);
	юум_УстановитьДатуРасхода();
	// } #юум
	#КонецВставки

КонецПроцедуры
// } #юум

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #юум {
// #04.02.01
// Серверный вызов метода модуля менеджера документа ЭтапПроизводства2_2
// Галфинд AMotorin 2026/09/28
//
// Параметры:
//  РежимЗаполнения - Число - 0 => заполнение происходит только по данным обеспечения (расход предварительно очищается),
//                  		  1 => к расходу добавляются данные из обеспечения
//
&НаСервере
Процедура юум_ВызватьЗаполнениеИзМодуляМенеджера(РежимЗаполнения)
	
	Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(Объект, РежимЗаполнения);
	
КонецПроцедуры
// } #юум

// BSLLS:DeletingCollectionItem-off
// #юум {
// #04.02.01
// Установка даты отрузки для строк со статьей калькуляции "ПолуфабрикатыПроизводимыеВПроцессе" - дата с закладки обеспечение, остальные статьи - дата из документа "ДвижениеПродукцииИМатериалов".
// Галфинд AMotorin 2026/10/10
&НаКлиенте
Процедура юум_УстановитьДатуРасхода()
    
    СтатьяПолуфабрикаты = ПредопределенноеЗначение("Справочник.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе");
    МассивДатПередачи = юум_ПолучитьДатуПередачиВПроизводство(Объект.Ссылка);
	МассивДатДляПолуфабрикатов = юум_ПолучитьСтрокиСоСтатьейПолуфабрикаты(Объект.Ссылка); 
    
    Для Каждого СтрокаТЧ Из Объект.РасходМатериаловИРабот Цикл
        
		Если СтрокаТЧ.СтатьяКалькуляции = СтатьяПолуфабрикаты Тогда
			
			Для Каждого ЭлементМассива Из МассивДатДляПолуфабрикатов Цикл
            
            	Если СтрокаТЧ.Номенклатура = ЭлементМассива.Номенклатура И СтрокаТЧ.Количество = ЭлементМассива.Количество Тогда
                
                	СтрокаТЧ.ДатаРасхода = ЭлементМассива.Дата;
                	ИндексУдаления = МассивДатДляПолуфабрикатов.Найти(ЭлементМассива);   
					МассивДатДляПолуфабрикатов.Удалить(ИндексУдаления);
					
                	Прервать; 
                
            	КонецЕсли;
            
        	КонецЦикла;	
			
			Продолжить; 
			
        КонецЕсли;
        
        Для Каждого ЭлементМассива Из МассивДатПередачи Цикл
            
            Если СтрокаТЧ.Номенклатура = ЭлементМассива.Номенклатура И СтрокаТЧ.Количество = ЭлементМассива.Количество Тогда
                
                СтрокаТЧ.ДатаРасхода = ЭлементМассива.Дата;
                ИндексУдаления = МассивДатПередачи.Найти(ЭлементМассива);   
				МассивДатПередачи.Удалить(ИндексУдаления);
					
                Прервать; 
                
            КонецЕсли;
            
        КонецЦикла;
        
    КонецЦикла;
    
КонецПроцедуры
// } #юум
// BSLLS:DeletingCollectionItem-on

// #юум {
// #04.02.01
// Получение строк со статьей калькуляции "Полуфабрикаты (работы) производимые в процессе" со страницы "Обеспечение"
// Галфинд AMotorin 2026/10/10
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка.ЭтапПроизводства2_2 - Ссылка на текущий документ
//
// Возвращаемое значение:
//  Массив - Массив структур с полями:
//    * Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//    * Количество   - Число                         - Количество
//    * Дата         - Дата                          - Дата отгрузки данной номенклатуры
//
&НаСервереБезКонтекста
Функция юум_ПолучитьСтрокиСоСтатьейПолуфабрикаты(СсылкаНаДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество КАК Количество,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки КАК ДатаОтгрузки
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
		|ГДЕ
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	МассивСтруктур = Новый Массив;
	
    Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
        
        СтруктураСтроки = Новый Структура("Номенклатура, Количество, Дата");
        СтруктураСтроки.Номенклатура = СтрокаТаблицы.Номенклатура;
        СтруктураСтроки.Количество   = СтрокаТаблицы.Количество;
        СтруктураСтроки.Дата         = СтрокаТаблицы.ДатаОтгрузки;
        
        МассивСтруктур.Добавить(СтруктураСтроки);
        
    КонецЦикла;
	
    Возврат МассивСтруктур;
    
КонецФункции
// } #юум

// #юум {
// #04.02.01
// Получение даты производсва для строк ТЧ страницы Расход со статьей калькуляции отличной от "Полуфабрикаты, производимые в процессе", поиск даты ведется среди документов "ДвижениеПродукцииИМатериалов"
// Галфинд AMotorin 2026/10/10
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка.ЭтапПроизводства2_2 - Ссылка на текущий документ
//
// Возвращаемое значение:
//  Массив - Массив структур с полями:
//    * Номенклатура - СправочникСсылка.Номенклатура - Номенклатура переданного материала
//    * Количество   - Число                         - Количество переданного материала
//    * Дата         - Дата                          - Дата документа передачи
//
&НаСервереБезКонтекста
Функция юум_ПолучитьДатуПередачиВПроизводство(СсылкаНаДокумент)

    ЗапросСсылки = Новый Запрос;
    ЗапросСсылки.Текст = 
    "ВЫБРАТЬ
    |    ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка
    |ИЗ
    |    Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
    |ГДЕ
    |    ДвижениеПродукцииИМатериалов.Распоряжение = &СсылкаНаДокумент";

    ЗапросСсылки.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент); 
    МассивСсылок = ЗапросСсылки.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
    Если МассивСсылок.Количество() = 0 Тогда
        Возврат Новый Массив;
    КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|    Товары.Ссылка КАК Ссылка,
	|    Товары.Номенклатура КАК Номенклатура,
	|    Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Строки
	|ИЗ
	|    Документ.ДвижениеПродукцииИМатериалов.Товары КАК Товары
	|ГДЕ
	|    Товары.Ссылка В (&МассивСсылок)
	|;
	|ВЫБРАТЬ
	|    Док.Дата КАК ДатаДокумента,
	|    ВТ_Строки.Номенклатура КАК Номенклатура,
	|    ВТ_Строки.Количество КАК Количество
	|ИЗ
	|    ВТ_Строки КАК ВТ_Строки
	|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов КАК Док
	|    ПО ВТ_Строки.Ссылка = Док.Ссылка"; 
	
    ЗапросТЧ.УстановитьПараметр("МассивСсылок", МассивСсылок);
    ТаблицаДанных = ЗапросТЧ.Выполнить().Выгрузить();
    МассивСтруктур = Новый Массив;
    
    Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
        
        СтруктураСтроки = Новый Структура("Номенклатура, Количество, Дата");
        СтруктураСтроки.Номенклатура = СтрокаТаблицы.Номенклатура;
        СтруктураСтроки.Количество   = СтрокаТаблицы.Количество;
        СтруктураСтроки.Дата         = СтрокаТаблицы.ДатаДокумента;
        
        МассивСтруктур.Добавить(СтруктураСтроки);
        
    КонецЦикла;
    
    Возврат МассивСтруктур;
    
КонецФункции
// } #юум

// #юум {
// #04.02.01
// Получение текущего пользователя (роли)
// Галфинд AMotorin 2026/09/28
//
// Возвращаемое значение:
//	Строка - "НачальникСмены" или "Мастер" или "НачальникЦеха" или "ПользовательСПолнымиПравами"
//
&НаСервереБезКонтекста
Функция юум_ПолучитьТекущегоПользователя()

	РольАдминистраторСистемы = Пользователи.ЭтоПолноправныйПользователь(Неопределено, Истина, Истина);
	РольПолныеПрава          = Пользователи.ЭтоПолноправныйПользователь(Неопределено, Ложь,   Истина);

	Если РольАдминистраторСистемы ИЛИ РольПолныеПрава Тогда    
		
		ТекущийПользователь = "ПользовательСПолнымиПравами";
	
	ИначеЕсли Пользователи.РолиДоступны("юум_НачальникСмены") Тогда
		
		ТекущийПользователь = "НачальникСмены";
		
	ИначеЕсли Пользователи.РолиДоступны("юум_Мастер") Тогда  
		
		ТекущийПользователь = "Мастер";
		
	ИначеЕсли Пользователи.РолиДоступны("юум_НачальникЦеха") Тогда
		
		ТекущийПользователь = "НачальникЦеха";
		
	КонецЕсли;

	Возврат ТекущийПользователь; 

КонецФункции	
// } #юум

#КонецОбласти