
#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
&После("ВыполнитьРаспределениеВФоне")
Процедура юум_ВыполнитьРаспределениеВФоне(Задания, ИдентификаторыНеОбработанныхЗаписей, ДополнительныеСвойства)
	// здесь выполняется "Проведение" или "Отмена проведения" документа Заказ на производство
	// Заполняем регистр сведений юум_НоменклатураПоТребованию номенклатурой "по требованию" из Заказов на производство
	Для Каждого Задание Из Задания Цикл
		Если ТипЗнч(Задание.ЗаказНаОтгрузку) = Тип("ДокументСсылка.ЗаказНаПроизводство2_2") Тогда
			Проведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задание.ЗаказНаОтгрузку, "Проведен");
			Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задание.ЗаказНаОтгрузку, "Статус");
			Если Проведен
				И Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству Тогда
				СтруктураЗаказаВызовСервера.юум_ЗаполнитьНоменклатураПоТребованию(Задание.ЗаказНаОтгрузку);
			Иначе
				СтруктураЗаказаВызовСервера.юум_ОчиститьНоменклатураПоТребованию(Задание.ЗаказНаОтгрузку);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // } #юум
