Функция Выгрузить() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	т.Шаблон КАК Шаблон,
		|	т.Содержит КАК Содержит,
		|	т.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	0 КАК Длина
		|ИЗ
		|	РегистрСведений.юум_СоответствиеКодовНоменклатурыЦГ_Статье КАК т
		|
		|УПОРЯДОЧИТЬ ПО
		|	Содержит УБЫВ,
		|	Шаблон";
	
	тз0 = Запрос.Выполнить().Выгрузить();
	тз = тз0.СкопироватьКолонки();
	Для каждого стз Из тз0 Цикл
    	ш = стз.Шаблон;
		ш = СтрЗаменить(ш, " ", "");
	    части = СтрРазделить(ш, ",");
		Для каждого часть Из части Цикл
		
			нс = тз.Добавить();
			ЗаполнитьЗначенияСвойств(нс, стз);
		    нс.шаблон = часть;
			нс.Длина = СтрДлина(часть);
		КонецЦикла;

	КонецЦикла;	
	тз.Сортировать("Содержит УБЫВ, Длина УБЫВ, Шаблон");
	Возврат тз;
	
КонецФункции

Функция ЦеноваяГруппа(тз, КодНоменклатуры) Экспорт 

	Для каждого стз Из тз Цикл
	
		Если стз.Содержит Тогда
			Если СтрНайти(ВРег(КодНоменклатуры), ВРег(стз.Шаблон)) Тогда
				Возврат стз.ЦеноваяГруппа;			
			КонецЕсли; 	
		Иначе	
			Если СтрНачинаетсяС(ВРег(КодНоменклатуры), ВРег(стз.Шаблон)) Тогда
				Возврат стз.ЦеноваяГруппа;			
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

КонецФункции

Функция СтатьяКалькуляции(тз, КодНоменклатуры) Экспорт 

	Для каждого стз Из тз Цикл
	
		Если стз.Содержит Тогда
			Если СтрНайти(ВРег(КодНоменклатуры), ВРег(стз.Шаблон)) Тогда
				Возврат стз.СтатьяКалькуляции;			
			КонецЕсли; 	
		Иначе	
			Если СтрНачинаетсяС(ВРег(КодНоменклатуры), ВРег(стз.Шаблон)) Тогда
				Возврат стз.СтатьяКалькуляции;			
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

КонецФункции
