
#Область юум_СлужебныйПрограммныйИнтерфейс 

// Сворачивает записи РН ДоступностьВидовРабочихЦентров, аналогично пр-ре СвернутьЗаписиПоРесурсуЗанято() 
// По указанным условиям отбираются регистраторы, свертка производится по отобранным регистраторам.
// Т.е., если указан один ВРЦ, а в регистраторе их несколько, то в рамках регистратора свертка будет по всем
//
// Параметры:
//  ПараметрыОтбора	 - Структура	 -  значения отбора (по И). Разрешенные ключи - Имена свойств регистра, 
// 										"ПериодМеньше", "ПериодБольше", "ПериодРавно" (проверка без времени) 
// 
Процедура юум_СвернутьЗаписиПоРесурсуЗанятоСОтбором(ПараметрыОтбора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АВТОНОМЕРЗАПИСИ()       КАК Очередь,
		|	Доступность.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТРегистраторы
		|ИЗ
		|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК Доступность
		|ГДЕ
		|	(Доступность.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
		|	ИЛИ Доступность.Регистратор ССЫЛКА Документ.РегистраторГрафикаПроизводства)
		|   И &УсловияОтбора
		|
		|СГРУППИРОВАТЬ ПО
		|	Доступность.Регистратор,
		|	Доступность.ВидРабочегоЦентра,
		|	Доступность.ДатаИнтервала,
		|	Доступность.ВариантНаладки,
		|	Доступность.Распоряжение,
		|	Доступность.Подразделение,
		|	Доступность.Смена,
		|	Доступность.КлючПартия,
		|	Доступность.Этап
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(Доступность.НомерСтроки) > 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Очередь";

	ТекстУсловий = юум_ПолучитьТекстУсловийОтбора(Запрос, ПараметрыОтбора);  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбора", ТекстУсловий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаРегистраторы =
		"ВЫБРАТЬ
		|	Регистраторы.Регистратор КАК Регистратор
		|ИЗ
		|	ВТРегистраторы КАК Регистраторы
		|ГДЕ
		|	Регистраторы.Очередь >= &НачалоОчереди 
		|	И Регистраторы.Очередь < &КонецОчереди";
	
	ТекстЗапросаДвижения = 
		"ВЫБРАТЬ
		|	Доступность.Регистратор       КАК Регистратор,
		|	Доступность.Период            КАК Период,
		|	Доступность.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	Доступность.ДатаИнтервала     КАК ДатаИнтервала,
		|	Доступность.ВариантНаладки    КАК ВариантНаладки,
		|	Доступность.Распоряжение      КАК Распоряжение,
		|	Доступность.Подразделение     КАК Подразделение,
		|	Доступность.Смена             КАК Смена,
		|	Доступность.КлючПартия        КАК КлючПартия,
		|	Доступность.Этап              КАК Этап,
		|	СУММА(Доступность.Занято)     КАК Занято
		|ИЗ
		|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК Доступность
		|ГДЕ
		|	Доступность.Регистратор В (&Регистраторы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Доступность.ВариантНаладки,
		|	Доступность.ВидРабочегоЦентра,
		|	Доступность.ДатаИнтервала,
		|	Доступность.КлючПартия,
		|	Доступность.Период,
		|	Доступность.Подразделение,
		|	Доступность.Распоряжение,
		|	Доступность.Регистратор,
		|	Доступность.Смена,
		|	Доступность.Этап
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доступность.Занято) <> 0";
	
	НачалоОчереди = 1;
	СтруктураПоиска = Новый Структура("Регистратор");
	
	Пока Истина Цикл
		Запрос.Текст = ТекстЗапросаРегистраторы;
		Запрос.УстановитьПараметр("НачалоОчереди", НачалоОчереди);
		Запрос.УстановитьПараметр("КонецОчереди", НачалоОчереди + 100);
		НачалоОчереди = НачалоОчереди + 100;
		
		Регистраторы = Запрос.Выполнить().Выгрузить();
		Если Регистраторы.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДоступностьВидовРабочихЦентров.НаборЗаписей");
			ЭлементБлокировки.ИсточникДанных = Регистраторы;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
			Блокировка.Заблокировать();
			
			Запрос.Текст = ТекстЗапросаДвижения;
			Запрос.УстановитьПараметр("Регистраторы", Регистраторы.ВыгрузитьКолонку("Регистратор"));
			ВсеДвижения = Запрос.Выполнить().Выгрузить();
			ВсеДвижения.Индексы.Добавить("Регистратор");
			
			Для каждого Строка Из Регистраторы Цикл
				Набор = РегистрыНакопления.ДоступностьВидовРабочихЦентров.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Строка.Регистратор);
				
				СтруктураПоиска.Регистратор = Строка.Регистратор;
				Движения = ВсеДвижения.Скопировать(СтруктураПоиска);
				Если Движения.Количество() > 0 Тогда
					Набор.Загрузить(Движения);
				КонецЕсли;
				
				Набор.Записать();
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Доступность видов рабочих центров.Сворачивание записей';
					|en = 'Capacity of work center types.Collapse records'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры 
#КонецОбласти

#Область юум_СлужебныеПроцедурыИФункции

Функция юум_ПолучитьТекстУсловийОтбора(Запрос, ПараметрыОтбора)
	МассивУсловий = Новый Массив; 
	ШаблонПараметра = "&%1"; 
	Для каждого ПараметрОтбора  Из ПараметрыОтбора Цикл  
		ИмяОтбора = ПараметрОтбора.Ключ;
		ТекстПараметра = СтрШаблон(ШаблонПараметра, ИмяОтбора);
		Если ИмяОтбора = "ПериодМеньше" Тогда
			ТекстУсловия = "КОНЕЦПЕРИОДА(Доступность.Период, ДЕНЬ) <= &ПериодМеньше";
			Значение = КонецДня(ПараметрОтбора.Значение);
		ИначеЕсли ИмяОтбора = "ПериодБольше" Тогда
			ТекстУсловия = "НАЧАЛОПЕРИОДА(Доступность.Период, ДЕНЬ) >= &ПериодБольше";
			Значение = НачалоДня(ПараметрОтбора.Значение);
		ИначеЕсли ИмяОтбора = "ПериодРавно" Тогда
			ТекстУсловия = "НАЧАЛОПЕРИОДА(Доступность.Период, ДЕНЬ) = &ПериодРавно";
			Значение = НачалоДня(ПараметрОтбора.Значение);
		Иначе
			Значение = ПараметрОтбора.Значение;  
			Если ТипЗнч(Значение) = Тип("Массив") Тогда
				ШаблонУсловия = "Доступность.%1 В (&%2)";
			Иначе	
				ШаблонУсловия = "Доступность.%1 = &%2";
			КонецЕсли;
			ТекстУсловия = СтрШаблон(ШаблонУсловия, ИмяОтбора, ИмяОтбора); 
		КонецЕсли;
		Запрос.УстановитьПараметр(ИмяОтбора, Значение);
		
	    МассивУсловий.Добавить(ТекстУсловия);
	КонецЦикла; 
	Если МассивУсловий.Количество() = 0 Тогда
	    ПолныйТекстУсловий = "ИСТИНА"
	Иначе	
		ПолныйТекстУсловий = СтрСоединить(МассивУсловий, " И ");
	КонецЕсли;
	Возврат ПолныйТекстУсловий;
КонецФункции

#КонецОбласти
