
#Область ПрограммныйИнтерфейс

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
//
// Параметры:
//  ЗаказНаПроизводство - ДокументСсылка.ЗаказНаПроизводство2_2
//
Процедура юум_ОчиститьНоменклатураПоТребованию(ЗаказНаПроизводство) Экспорт
	НаборЗаписей = РегистрыСведений.юум_НоменклатураПоТребованию.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказНаПроизводство.Установить(ЗаказНаПроизводство);
	НаборЗаписей.Записать();
КонецПроцедуры // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
//
// Параметры:
//  ЗаказНаПроизводство - ДокументСсылка.ЗаказНаПроизводство2_2
//
Процедура юум_ЗаполнитьНоменклатураПоТребованию(ЗаказНаПроизводство) Экспорт
	// 1. найдем перечень номенклатуры "по требованию"
	НоменклатураПоТребованию = Новый ТаблицаЗначений;
	НоменклатураПоТребованию.Колонки.Добавить("Спецификация");
	НоменклатураПоТребованию.Колонки.Добавить("Номенклатура");
	НоменклатураПоТребованию.Колонки.Добавить("Характеристика");
	НоменклатураПоТребованию.Колонки.Добавить("Склад");
	НоменклатураПоТребованию.Колонки.Добавить("Подразделение");
	НоменклатураПоТребованию.Колонки.Добавить("Назначение");
	НоменклатураПоТребованию.Колонки.Добавить("СпособОбеспечения");
	НоменклатураПоТребованию.Колонки.Добавить("Вероятность");
	НоменклатураПоТребованию.Колонки.Добавить("Количество");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка КАК Ссылка,
	               |	ЗаказНаПроизводство2_2Продукция.НомерСтроки КАК НомерСтроки,
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	               |	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика,
	               |	ЗаказНаПроизводство2_2Продукция.Упаковка КАК Упаковка,
	               |	ЗаказНаПроизводство2_2Продукция.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ЗаказНаПроизводство2_2Продукция.Количество КАК Количество,
	               |	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
	               |	ЗаказНаПроизводство2_2Продукция.Склад КАК Склад,
	               |	ЗаказНаПроизводство2_2Продукция.Подразделение КАК Подразделение,
	               |	ЗаказНаПроизводство2_2Продукция.Назначение КАК Назначение,
	               |	ЗаказНаПроизводство2_2Продукция.ДатаПотребности КАК ДатаПотребности,
	               |	ЗаказНаПроизводство2_2Продукция.Отменено КАК Отменено,
	               |	ЗаказНаПроизводство2_2Продукция.ПричинаОтмены КАК ПричинаОтмены,
	               |	ЗаказНаПроизводство2_2Продукция.ДоляСтоимости КАК ДоляСтоимости,
	               |	ЗаказНаПроизводство2_2Продукция.ДоляСтоимостиНаЕдиницу КАК ДоляСтоимостиНаЕдиницу,
	               |	ЗаказНаПроизводство2_2Продукция.СписатьНаРасходы КАК СписатьНаРасходы,
	               |	ЗаказНаПроизводство2_2Продукция.СтатьяРасходов КАК СтатьяРасходов,
	               |	ЗаказНаПроизводство2_2Продукция.АналитикаРасходов КАК АналитикаРасходов,
	               |	ЗаказНаПроизводство2_2Продукция.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	               |	ЗаказНаПроизводство2_2Продукция.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |ГДЕ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаПроизводство);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Спецификация) Тогда
			юум_ЗаполнитьРекурсивноМассивНоменклатураПоТребованию(ЗаказНаПроизводство,
				НоменклатураПоТребованию, Выборка.Спецификация, Выборка.КоличествоУпаковок);
		КонецЕсли;
	КонецЦикла;
	
	// 2. заполняем регистр сведений
	КолонкиГруппировок = "Спецификация, Номенклатура, Характеристика, Склад, Подразделение, Назначение, СпособОбеспечения, Вероятность";
	НоменклатураПоТребованию.Свернуть(КолонкиГруппировок, "Количество");
	НаборЗаписей = РегистрыСведений.юум_НоменклатураПоТребованию.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказНаПроизводство.Установить(ЗаказНаПроизводство);
	Для Каждого СтруктураНоменклатура Из НоменклатураПоТребованию Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.ЗаказНаПроизводство = ЗаказНаПроизводство;
		ЗаполнитьЗначенияСвойств(Запись, СтруктураНоменклатура);
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры // } #юум

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
&После("ЗапуститьПересчетСтруктурыЗаказа")
Процедура юум_ЗапуститьПересчетСтруктурыЗаказа(ЗаказыНаПроизводство)
	// здесь выполняется команда "Пересчитать структуру заказа"
	// Заполняем регистр сведений юум_НоменклатураПоТребованию номенклатурой "по требованию" из Заказов на производство
	Если ТипЗнч(ЗаказыНаПроизводство) = Тип("ДокументСсылка.ЗаказНаПроизводство2_2") Тогда
		МассивЗаказы = Новый Массив;
		МассивЗаказы.Добавить(ЗаказыНаПроизводство);
	Иначе
		МассивЗаказы = ЗаказыНаПроизводство;
	КонецЕсли;
	Для Каждого Заказ Из МассивЗаказы Цикл
		Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Статус");
		Если Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству Тогда
			юум_ЗаполнитьНоменклатураПоТребованию(Заказ);
		Иначе
			юум_ОчиститьНоменклатураПоТребованию(Заказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
//
// Параметры:
//	ЗаказНаПроизводство - ДокументСсылка.ЗаказНаПроизводство2_2
//  НоменклатураПоТребованию - ТаблицаЗначений
//  Спецификация - СправочникСсылка.РесурсныеСпецификации
//  Количество - Число
//
Процедура юум_ЗаполнитьРекурсивноМассивНоменклатураПоТребованию(ЗаказНаПроизводство, НоменклатураПоТребованию, Спецификация, Количество)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Спецификация);
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
	               |	МАКСИМУМ(ЕСТЬNULL(ЗаказыНаПроизводство.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))) КАК Назначение
	               |ПОМЕСТИТЬ втНазначения
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыНаПроизводство КАК ЗаказыНаПроизводство
	               |		ПО ЗаказНаПроизводство2_2Продукция.Спецификация = ЗаказыНаПроизводство.Спецификация
	               |			И ЗаказыНаПроизводство.ЗаказНаПроизводство = &ЗаказНаПроизводство
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказНаПроизводство2_2Продукция.Спецификация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Спецификация";
	Запрос.Выполнить();
	// _омОтладка.ПолучитьСодержимоеВременнойТаблицы(Запрос, "втНазначения")
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.НомерСтроки КАК НомерСтроки,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ОбособленнаяЗакупкаПродажа КАК ОбособленнаяЗакупкаПродажа,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Характеристика КАК Характеристика,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Упаковка КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Этап КАК Этап,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Этап.Подразделение КАК Подразделение,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ЭтапРедактирование КАК ЭтапРедактирование,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Операция КАК Операция,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ОперацияРедактирование КАК ОперацияРедактирование,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СпособАвтовыбораНоменклатуры КАК СпособАвтовыбораНоменклатуры,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СпособАвтовыбораХарактеристики КАК СпособАвтовыбораХарактеристики,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СвойствоСодержащееНоменклатуру КАК СвойствоСодержащееНоменклатуру,
	               |	РесурсныеСпецификацииМатериалыИУслуги.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СпособПолученияМатериала КАК СпособПолученияМатериала,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ТребуетсяУказыватьСерии КАК ТребуетсяУказыватьСерии,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ПланироватьНеРанее КАК ПланироватьНеРанее,
	               |	РесурсныеСпецификацииМатериалыИУслуги.АлгоритмАвтовыбораХарактеристики КАК АлгоритмАвтовыбораХарактеристики,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СпецификацияРемонта КАК СпецификацияРемонта,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Альтернативный КАК Альтернативный,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Вероятность КАК Вероятность,
	               |	РесурсныеСпецификацииМатериалыИУслуги.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Обособленно КАК Обособленно,
				   |	ЕСТЬNULL(СхемыОбеспеченияПроизводства.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
				   |	ЕСТЬNULL(втНазначения.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение,
	               |	ЕСТЬNULL(СхемыОбеспечения.СпособОбеспеченияПотребностей, ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)) КАК СпособОбеспечения
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |
	               |ЛЕВОЕ СОЕДИНЕНИЕ
	               |	РегистрСведений.СхемыОбеспеченияПроизводства КАК СхемыОбеспеченияПроизводства				   
	               |ПО
				   |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.СхемаОбеспечения = СхемыОбеспеченияПроизводства.СхемаОбеспечения
				   |	И РесурсныеСпецификацииМатериалыИУслуги.Этап.Подразделение = СхемыОбеспеченияПроизводства.Подразделение
	               |
	               |ЛЕВОЕ СОЕДИНЕНИЕ
	               |	втНазначения КАК втНазначения
	               |ПО
				   |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка = втНазначения.Спецификация
	               |
	               |ЛЕВОЕ СОЕДИНЕНИЕ
	               |	РегистрСведений.СхемыОбеспечения КАК СхемыОбеспечения
	               |ПО
				   |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.СхемаОбеспечения = СхемыОбеспечения.СхемаОбеспечения
				   |	И ЕСТЬNULL(СхемыОбеспеченияПроизводства.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) = СхемыОбеспечения.Склад
	               |
				   |ГДЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.Обеспечивать
			И Выборка.Альтернативный Тогда
			юум_ДобавитьСтрокуВНоменклатуруПоТребованию(НоменклатураПоТребованию, Выборка, Количество);
		Иначе
			Если Выборка.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации
				И ЗначениеЗаполнено(Выборка.ИсточникПолученияПолуфабриката)
				И ТипЗнч(Выборка.ИсточникПолученияПолуфабриката) = Тип("СправочникСсылка.РесурсныеСпецификации") Тогда
				юум_ЗаполнитьРекурсивноМассивНоменклатураПоТребованию(ЗаказНаПроизводство,
					НоменклатураПоТребованию, Выборка.ИсточникПолученияПолуфабриката, Выборка.КоличествоУпаковок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // } #юум

// #юум {
// #ЧТЗ 03.01 Управление закупками
// Галфинд Садомцев 2026/09/18        	
//
// Параметры:
//  НоменклатураПоТребованию - ТаблицаЗначений
//  Выборка - ВыборкаИзРезультатаЗапроса
//  Количество - Число
//
Процедура юум_ДобавитьСтрокуВНоменклатуруПоТребованию(НоменклатураПоТребованию, Выборка, Количество)
	НоваяСтрока = НоменклатураПоТребованию.Добавить();
	НоваяСтрока.Спецификация = Выборка.Ссылка;
	НоваяСтрока.Номенклатура = Выборка.Номенклатура;
	НоваяСтрока.Характеристика = Выборка.Характеристика;
	НоваяСтрока.Склад = Выборка.Склад;
	НоваяСтрока.Подразделение = Выборка.Подразделение;
	Если Выборка.Обособленно ИЛИ Выборка.ОбособленнаяЗакупкаПродажа Тогда
		НоваяСтрока.Назначение = Выборка.Назначение;
	Иначе
		НоваяСтрока.Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	НоваяСтрока.СпособОбеспечения = Выборка.СпособОбеспечения;
	НоваяСтрока.Вероятность = Выборка.Вероятность;
	НоваяСтрока.Количество = Выборка.КоличествоУпаковок * Количество;
КонецПроцедуры // } #юум

#КонецОбласти