
&НаСервере
Процедура НачальноеЗаполнениеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК Количество
	|ИЗ
	|	РегистрСведений.юум_СоответствиеЕдиницИзмеренияВнешнейСистемы КАК _СоответствиеЕдиницИзмеренияВнешнейСистемы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В регистре уже есть записи!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.юум_СоответствиеЕдиницИзмеренияВнешнейСистемы.СоздатьНаборЗаписей();
	Макет = РегистрыСведений.юум_СоответствиеЕдиницИзмеренияВнешнейСистемы.ПолучитьМакет("НачальноеЗаполнение");
	
	НС = 1;
	Пока Истина Цикл
		ЗначениеКод = Макет.Область(НС,1).Текст;
		Если ПустаяСтрока(ЗначениеКод) Тогда
			Прервать;
		КонецЕсли;
		НЗ = Набор.Добавить();
		
		НЗ.Код						= Число(ЗначениеКод);
		ЗначениеНаименование		= Макет.Область(НС,2).Текст;
		НЗ.Наименование				= ЗначениеНаименование;
		ЗначениеКраткоеНаименование	= Макет.Область(НС,3).Текст;
		НЗ.КраткоеНаименование		= ЗначениеКраткоеНаименование;
		НЗ.ЕдиницаИзмерения			= Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(ЗначениеКраткоеНаименование,
											Истина,, Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения);
		
		НС = НС + 1;
		
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура НачальноеЗаполнение(Команда)
	
	НачальноеЗаполнениеНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры
