
&НаСервере
Процедура ЗагрузитьНоменклатуруНаСервере()
	об = РеквизитФормыВЗначение("Объект");
	об.ЗагрузитьНоменклатуру(Истина, ЗаписыватьНеИзмененные);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	ЗагрузитьНоменклатуруНаСервере();
	ПоказатьОповещениеПользователя("Выполнено");
КонецПроцедуры


&НаСервере
Процедура УдалитьНоменклатуруНаСервере()
	РеквизитФормыВЗначение("Объект").УдалитьНоменклатуру();
КонецПроцедуры


&НаКлиенте
Процедура УдалитьНоменклатуру(Команда)
	УдалитьНоменклатуруНаСервере();
КонецПроцедуры

