#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.3.548");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия = "001";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	//Команда = ПараметрыРегистрации.Команды.Добавить();
	//Команда.Представление = НСтр("ru = 'Загрузить АОН по расписанию'");
	//Команда.Идентификатор = "ЗагрузитьАОН_РЗ";
	//Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	//Команда.ПоказыватьОповещение = Ложь;
	
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = 'Загрузить АОН интерактивно'");
    Команда.Идентификатор = "ЗагрузитьАОН_Интерактивно";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;

	Возврат ПараметрыРегистрации; 
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения) Экспорт
	
	ЗагрузитьАкты(Неопределено);
		
КонецПроцедуры

Функция Подключение() Экспорт 

	Connection = Новый COMОбъект("ADODB.Connection");
	сс = СформироватьСтрокуСоединения();
	Connection.ConnectionString = сс;

	Попытка
		Connection.Open();
	Исключение
		Сообщить ("Проблемы с подключением к SQL !" );
		текст = ОписаниеОшибки();
		Сообщить(текст);
		Connection = Неопределено;
		Возврат Ложь;	
	КонецПопытки;

	Возврат Истина;
	
КонецФункции 

Процедура Отключение(Сообщить = Истина) Экспорт 

	Если Connection <> Неопределено Тогда
		Connection.Close();	
		Connection = Неопределено;	
	КонецЕсли;	
	
КонецПроцедуры 

Функция СформироватьСтрокуСоединения() Экспорт
	
	//Возврат "Provider=SQLNCLI11.1;Initial Catalog=IndustriCS_Orsk;Data Source=ugo-db01;User ID=gf;Password=15426378"; 
	Возврат юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("СтрокаСоединенияTechnologiCS");
	
	Струк = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначениеСАвторизацией("СтрокаСоединенияСЭСА");
	Если Струк.ЕстьДанные Тогда
		Значение = СтрЗаменить(Струк.Значение, "%usr%", Струк.Логин);
		Значение = СтрЗаменить(Значение, "%psw%", Струк.Пароль);
	Иначе
		Значение = "";
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция Поле(RS, Имя)

	п = RS.Fields(Имя);	
	Если п.Type = 200 Тогда
		//строка
		Возврат СокрЛП(п.Value);		
	ИначеЕсли п.Type = 139 Тогда		
		// число
		Возврат Формат(п.Value, "ЧГ=0");
	КонецЕсли;
	
КонецФункции

Функция НайтиПодразделение(ИД)

	Если ПустаяСтрока(ИД) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	подр = КЭШ.ствПодразделения[ИД];
	Если ЗначениеЗаполнено(подр) Тогда
		Возврат подр;
	КонецЕсли;
	подр = Справочники.СтруктураПредприятия.НайтиПоКоду(ИД);
	Если ЗначениеЗаполнено(подр) Тогда
		КЭШ.ствПодразделения[ИД] = подр;
	КонецЕсли;

	Возврат подр;
	
КонецФункции

Функция НайтиСоздатьНоменклатуру(Код)

	Если ПустаяСтрока(Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	сс = КЭШ.ствНоменклатура[Код];
	Если ЗначениеЗаполнено(сс) Тогда
		Возврат сс;
	КонецЕсли;
	
	сс = Справочники.Номенклатура.НайтиПоКоду(Код);
	Если ЗначениеЗаполнено(сс) Тогда
		КЭШ.ствНоменклатура[Код] = сс;
		Возврат сс;
	КонецЕсли;

	сс = СоздатьНоменклатуру(Код);
	Если ЗначениеЗаполнено(сс) Тогда
		КЭШ.ствНоменклатура[Код] = сс;
		Возврат сс;
	КонецЕсли;

	ЗапроситьНоменклатуру(Код);
	сс = СоздатьНоменклатуру(Код);
	
	Возврат сс;
	
КонецФункции

Процедура ЗапроситьНоменклатуру(Код)

	Command = Новый COMObject("ADODB.Command");
	Command.ActiveConnection = Connection;
	ТекстЗапроса = "EXEC ('begin user1C.getnmk_1c_byCode(''" + Код + "''); end;') AT INTR";
	
	Command.CommandText = ТекстЗапроса; 
	Command.CommandType = 1;
	Command.Execute();

КонецПроцедуры

Функция СоздатьНоменклатуру(Код)
   
	RS = Новый COMОбъект("ADODB.Recordset");
	
	ТекстЗапроса = "SELECT * FROM OPENQUERY(INTR, 'SELECT  
	| S_ID, DESIGNATIO, NAME, P750M, P750ED, H580, P750, WIDTH, LENGTH, DIAM, MATERIAL, STP, 
	| GOST_M, GOST_S, AWT, GROUP_CODE, GROUP_NAME, TYPSIZE, DOP_COND, DOP_TREB, APPLICABILITY_SIGN, 
	| F_NEED_ITT, F_ITT_IN_BASE, F_OBOZN_ITT, F_FILE_ITT, VID_NOMENKL, F_KEZ_IN_BASE, F_OBOZN_KEZ, 
	| F_FILE_KEZ, MAKE_AS_METALLURG, GAUN, F_PASPORT, F_NEED_TZ, F_TZ_IN_BASE, F_OBOZN_TZ, F_FILE_TZ, 
	| F_FULL_NAME, F_FULL_NAME_2, F_KOD_IZK, SOURCE_NAME, SOURCE_MARKA, SOURCE_RAZMER, SOURCE_GOST_S, 
	| SOURCE_GOST_M, SOURCE_STP, FULL_NAME_1C
	| FROM USER1C.NMK_SEARCH_night where DESIGNATIO = "
	+ "''" + Код + "'' ') ";
	
	Попытка
		RS.Open(ТекстЗапроса, Connection);
	Исключение
		Сообщить ("Проблемы с выполнением запроса к SQL !");
		Сообщить (ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

	Если RS.EOF() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	об = юум_Интеграция.ОбъектНоменклатуры(КЭШН, RS, Ложь);
	об.Записать();
	Возврат об.Ссылка;
	
КонецФункции

Функция ЗаполнитьКЭШ()
	
	КЭШН = Новый Структура;
	юум_Интеграция.ЗаполнитьКЭШНоменклатуры(КЭШН);
	
	КЭШ = Новый Структура;
	
	КЭШ.Вставить("Организация", юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ОрганизацияПоУмолчанию"));
	
	КЭШ.Вставить("ПодразделениеШапка",  юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ПодразделениеШапкаАОН")); 
	КЭШ.Вставить("ПодразделениеПродукция", юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ПодразделениеПродукцияАОН")); 
	КЭШ.Вставить("ствПодразделения", Новый Соответствие);
	КЭШ.ствПодразделения[КЭШ.ПодразделениеШапка.Код] = КЭШ.ПодразделениеШапка;
	КЭШ.ствПодразделения[КЭШ.ПодразделениеПродукция.Код] = КЭШ.ПодразделениеПродукция;

	КЭШ.Вставить("спецРаботыПоИсправлениюБрака", юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("спецРаботыПоИсправлениюБрака"));	
	КЭШ.Вставить("номРаботыПоИсправлениюБрака", юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("номРаботыПоИсправлениюБрака"));	
	КЭШ.Вставить("ствНоменклатура", Новый Соответствие);
	КЭШ.ствНоменклатура[КЭШ.номРаботыПоИсправлениюБрака.Код] = КЭШ.номРаботыПоИсправлениюБрака;
	
	КЭШ.Вставить("СкладПродукция", юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("СкладАОН")); 
	
	НаборДР = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту(
		"ИмяПредопределенногоНабора", "Документ_ЗаказНаПроизводство2_2");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборДР", НаборДР);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Свойство,
	|	Т.ИдентификаторДляФормул КАК ИД,
	|	Т.Наименование КАК Наименование,
	|	Т.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Т
	|ГДЕ
	|	Т.НаборСвойств = &НаборДР";

	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ствСвойства = Новый Соответствие;	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.ИД) Тогда
			Продолжить;	
		КонецЕсли;
		ствСвойства[Выборка.ИД] = Выборка.Свойство;
	КонецЦикла;
	КЭШ.Вставить("ствСвойства", ствСвойства);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Владелец.ИдентификаторДляФормул КАК ИД,
	|	Т.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК Т
	|ГДЕ
	|	Т.Владелец.НаборСвойств = &НаборДР";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ствДопСпр = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.Наименование) Тогда
			Продолжить;	
		КонецЕсли;
		ствДопСпр[Выборка.Наименование] = Выборка.Ссылка;
	КонецЦикла;
	КЭШ.Вставить("ствДопСпр", ствДопСпр);
	
	КЭШ.Вставить("ПричинаОтмены", юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ПричинаОтменыАОН"));
	
	
КонецФункции

Функция НаправлениеДеятельности(НомерЗаказа)

	Если ПустаяСтрока(НомерЗаказа) Тогда
		Возврат Неопределено;	
	КонецЕсли;	

	_нач = Лев(НомерЗаказа, 6);
	Если СтрДлина(_нач) < 6 Тогда
		Возврат Неопределено;	
	КонецЕсли;	

	ТолькоЦифры = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(_нач);
	Если НЕ ТолькоЦифры Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	НачалоНомера = Число(_нач);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.НомерЗаказаДо - т.НомерЗаказаОт + 1 КАК Кодов
	|ИЗ
	|	Справочник.юум_КлассификаторЗаказов КАК т
	|ГДЕ
	|	&НачалоНомера МЕЖДУ т.НомерЗаказаОт И т.НомерЗаказаДо
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.ПометкаУдаления,
	|	Кодов";
	
	Запрос.УстановитьПараметр("НачалоНомера", НачалоНомера);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

Процедура ЗагрузитьАкты(пНомерЗаказа = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации("Загрузка АОН", УровеньЖурналаРегистрации.Информация,
		,, "Начало");
		
	НетОшибок = Истина;
	ТекДата = ТекущаяДатаСеанса();
	
	Подключение();
	ЗаполнитьКЭШ();
	
	RS = Новый COMОбъект("ADODB.Recordset");
	
	//ТекстЗапроса = "SELECT * FROM REJECT.FullAktExchange ";
	
	пМинДата = Дата(2025,1,1);
	ДатаНачалаАОН = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ДатаНачалаАОН");
	Если НЕ ЗначениеЗаполнено(ДатаНачалаАОН) Тогда
		ДатаНачалаАОН = пМинДата;
	КонецЕсли;
	ДатаИзмененияАОН = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ДатаИзмененияАОН");
	Если НЕ ЗначениеЗаполнено(ДатаИзмененияАОН) Тогда
		ДатаИзмененияАОН = пМинДата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(пНомерЗаказа) Тогда
		
		Шаблон = 
		" SELECT * FROM WEB.Reject_InfAct 
		|  	WHERE DATE >= CAST('%1' AS date)
		| 	AND N_ORD_NOTE = '%2'
		//| 	AND status IN(2, 3, 13)
		| ORDER BY DATE, id ";
		
		ТекстЗапроса = СтрШаблон(Шаблон, 
			Формат(ДатаНачалаАОН, "ДФ=yyyy-MM-dd"),
			пНомерЗаказа);
	Иначе
		
		Шаблон = 
		" SELECT * FROM WEB.Reject_InfAct 
		| WHERE  
		| 	DATE >= CAST('%1' AS date)
		//| 	AND status IN(2, 3, 13)		
		| 	AND ID IN
		| 		(
		| 			SELECT distinct C.reject_id FROM WEB.LogChangeAkt AS C
		| 			WHERE c.DT >= CAST('%2' AS datetime2)
		| 		)
		| ORDER BY DATE, id";
		
		ТекстЗапроса = СтрШаблон(Шаблон, 
			Формат(ДатаНачалаАОН, "ДФ=yyyy-MM-dd"),
			Формат(ДатаИзмененияАОН, "ДФ='yyyy-MM-dd HH:mm:ss'"));
		
	КонецЕсли;
	
	Попытка
		RS.Open(ТекстЗапроса, Connection);
	Исключение
		Сообщить ("Проблемы с выполнением запроса к SQL !");
		Сообщить (ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	сч = 0;
	КоличествоДокументов = 1;
	
	Пока RS.EOF() = 0 Цикл
		лКомментарий = "";
		сч = сч + 1;
		//Если Сч > КоличествоДокументов Тогда Прервать; КонецЕсли;
		
		Д = Новый Структура;
		Д.Вставить("Организация", КЭШ.Организация);
		
		лДата = СтроковыеФункцииКлиентСервер.СтрокаВДату(RS.Fields("dateAct").Value);
		Д.Вставить("ДатаАкта", лДата);
		
		НомерАкта = Поле(RS, "NUM_AKT");
		Д.Вставить("НомерАкта", "АОН-" + НомерАкта);
		Д.Вставить("Подразделение", КЭШ.ПодразделениеШапка);

		НомерЗаказа = Поле(RS, "N_ORD_NOTE");
		Д.Вставить("НаправлениеДеятельности", НаправлениеДеятельности(НомерЗаказа));
		
		ЭтоИсправимый = Истина;
		Если RS.Fields("TYPE_AKT").Value = 2 Тогда
			ЭтоИсправимый = Ложь;
		КонецЕсли;
		ЭтоВнутренный = Истина;
		Если RS.Fields("VidAkt").Value = "ВнешнийБрак" Тогда
			ЭтоВнутренный = Ложь;
		КонецЕсли;
		
		ПараметрыСпецификации = Новый Структура("ЭтоИсправимый", ЭтоИсправимый);
		
		стрПродукция = Новый Структура("Подразделение,Склад", 
			КЭШ.ПодразделениеПродукция,
			КЭШ.СкладПродукция);
			
		Если ЭтоИсправимый Тогда
			стрПродукция.Вставить("Номенклатура", КЭШ.номРаботыПоИсправлениюБрака);
			стрПродукция.Вставить("Количество", 1);
			стрПродукция.Вставить("КоличествоУпаковок", 1); 
			ПараметрыСпецификации.Вставить("Номенклатура", стрПродукция.Номенклатура);
		Иначе	
			стрПродукция.Вставить("Отменено", Истина);
			стрПродукция.Вставить("ПричинаОтмены", КЭШ.ПричинаОтмены);
			//Номенклатура будет при заполнении доп реквизитов			
			стрПродукция.Вставить("Количество", RS.Fields("ZABRAKOVANO").Value);
			стрПродукция.Вставить("КоличествоУпаковок", стрПродукция.Количество);
		КонецЕсли;			
		
		Д.Вставить("стрПродукция", стрПродукция);
		
		ПараметрыСпецификации.Вставить("НомерОсновногоЗаказа", НомерЗаказа);
				
		// ИД							Наименование					ТипЗначения
		// =====================================================================================
		// АОН							АОН								Булево
		// ВидБрака2					Вид брака						Дополнительное значение		исправимый/неисправимый
		// ТипБрака						Тип брака						Дополнительное значение		внеш/внутр
		// ЦехОбнаружитель				Цех - обнаружитель				Подразделение
		// ОсновнойЗаказНаПроизводство	Основной заказ на производство	Строка
		// НаименованиеИзделия			Наименование изделия			Строка
		// КодДетали					Код детали						Строка
		// НаименовавниеДетали			Наименовавние детали			Номенклатура
		// Материал						Материал						Строка
		// ЗабракованоНаОперации		Забраковано на операции			Строка
		// Операции						№ операции						Строка
		// Признак						Признак							Строка
		// Причина						Причина							Строка
		// Предъявлено					Предъявлено						Число
		// Забраковано					Забраковано						Число
		// ЦехВиновник					Цех - виновник					Подразделение
		// Спецификация					Спецификация					Строка
		
		
		ДопРеквизиты = Новый ТаблицаЗначений;
		ДопРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
		ДопРеквизиты.Колонки.Добавить("Значение");
		
		УстановитьДопРеквизит(ДопРеквизиты, "АОН", Истина);
		УстановитьДопРеквизит(ДопРеквизиты, "ВидБрака2", ?(ЭтоИсправимый, КЭШ.ствДопСпр["Исправимый"], КЭШ.ствДопСпр["Неисправимый"]));
		УстановитьДопРеквизит(ДопРеквизиты, "ТипБрака",  ?(ЭтоВнутренный, КЭШ.ствДопСпр["Внутренний брак"], КЭШ.ствДопСпр["Внешний брак"]));
		
		подр = НайтиПодразделение(Поле(RS, "TPCEHA_NUM"));
		Если ЗначениеЗаполнено(подр) Тогда
			УстановитьДопРеквизит(ДопРеквизиты, "ЦехОбнаружитель", подр);
		КонецЕсли;
		
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "ОсновнойЗаказНаПроизводство", "N_ORD_NOTE", RS);
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "Спецификация", "SP_NOTE", RS);
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "НаименованиеИзделия", "SP_NAME", RS);
		
		КодНом = Поле(RS, "NMK_NOTE");
		ПараметрыСпецификации.Вставить("КодДетали", КодНом);

		Если НЕ ПустаяСтрока(КодНом) Тогда
			УстановитьДопРеквизит(ДопРеквизиты, "КодДетали", КодНом);
			
			ном = НайтиСоздатьНоменклатуру(КодНом);
			Если ЗначениеЗаполнено(ном) Тогда
				УстановитьДопРеквизит(ДопРеквизиты, "НаименовавниеДетали", ном);
				Если НЕ ЭтоИсправимый Тогда
					стрПродукция.Вставить("Номенклатура", ном);
				Иначе
					Д.Вставить("РемонтируемоеИзделиеНоменклатура", ном);
					Д.Вставить("ТипПроизводственногоПроцесса", Перечисления.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот);
				КонецЕсли;		
			Иначе
				НетОшибок = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "Материал", "MATERIAL", RS);
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "ЗабракованоНаОперации", "OPER_NAME", RS);
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "Операции", "NUM_OPER", RS);
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "Признак", "PRIZNAK", RS);
		УстановитьДопРеквизитСтроку(ДопРеквизиты, "Причина", "PRICHINA", RS);
		УстановитьДопРеквизит(ДопРеквизиты, "Предъявлено", RS.Fields("PREDYAVLENO").Value);
		УстановитьДопРеквизит(ДопРеквизиты, "Забраковано", RS.Fields("ZABRAKOVANO").Value);
		
		подр = НайтиПодразделение(Поле(RS, "CULPRIT_CEH")); 
		Если ЗначениеЗаполнено(подр) Тогда
			УстановитьДопРеквизит(ДопРеквизиты, "ЦехВиновник", подр);
		КонецЕсли;
		
		Д.Вставить("тзДопРеквизиты", ДопРеквизиты);
		
	
		ссДок = Документы.ЗаказНаПроизводство2_2.НайтиПоНомеру(Д.НомерАкта, Д.ДатаАкта);
		Если НЕ ЗначениеЗаполнено(ссДок) Тогда
			
			обДок = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
			обДок.УстановитьСсылкуНового(
				Документы.ЗаказНаПроизводство2_2.ПолучитьСсылку(Новый УникальныйИдентификатор));
			обДок.Дата = Д.ДатаАкта;
			обДок.Номер = Д.НомерАкта;
			обДок.Заполнить(Неопределено);
			ЭтоНовый = Истина;	
		Иначе
			Проведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ссДок, "Проведен");	
			Если Проведен Тогда 
				ЗаписьЖурналаРегистрации("Загрузка АОН", УровеньЖурналаРегистрации.Предупреждение,
					, ссДок, "Документ уже проведен! Измения не записаны");
				Перейти ~Дальше;
			КонецЕсли;
			
			обДок = ссДок.ПолучитьОбъект();
			ЭтоНовый = Ложь;	
		КонецЕсли;
			
		ЗаполнитьЗначенияСвойств(обДок, Д);
		
		обДок.Продукция.Очистить();
		стрПродукция = обДок.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(стрПродукция, Д.стрПродукция);	
		
		обДок.ДополнительныеРеквизиты.Очистить();
		Для каждого стз Из Д.тзДопРеквизиты Цикл
			нс = обДок.ДополнительныеРеквизиты.Добавить();
			нс.Свойство = стз.Свойство;
			нс.Значение = стз.Значение;
		КонецЦикла;
		
		ЗаполнитьСпецификацию(обДок, ПараметрыСпецификации);
		
		Если НЕ обДок.ПроверитьЗаполнение() Тогда
			
			НетОшибок = Ложь;
			обДок.ОбменДанными.Загрузка = Истина;
			обДок.Записать();
			текст = "Ошибка проверки заполнения "
				+ ?(ЭтоНовый, " Нового", " Существующего")
				+ " документа";
				
			ЗаписьЖурналаРегистрации("Загрузка АОН", УровеньЖурналаРегистрации.Предупреждение,
					, обДок.Ссылка, текст);
			Перейти ~Дальше;
		КонецЕсли;
		
		Попытка
			обДок.Записать();
			текст = ?(ЭтоНовый, "Записан Новый", "Перезаписан существующий")
				+ " документ";
				
			ЗаписьЖурналаРегистрации("Загрузка АОН", УровеньЖурналаРегистрации.Информация,
					, обДок.Ссылка, текст);
			Перейти ~Дальше;
		Исключение
			НетОшибок = Ложь;
		КонецПопытки;
		
		~Дальше:
		RS.MoveNext();

	КонецЦикла;
	
	RS.Close();
	//НайтиСоздатьНоменклатуру("3-444766");
	Отключение();
	
	Если НетОшибок И НЕ ЗначениеЗаполнено(пНомерЗаказа) Тогда
		гз = ПланыВидовХарактеристик.юум_ГлобальныеЗначения.НайтиПоРеквизиту("Ключ", "ДатаИзмененияАОН");
		обГЗ = гз.ПолучитьОбъект();
		обГЗ.Значение = ТекДата;
		обГЗ.Записать();
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка АОН", УровеньЖурналаРегистрации.Информация,
		,, "Завершение");
	
КонецПроцедуры

Процедура УстановитьДопРеквизитСтроку(ТЗ, ИмяСвойства, КолонкаSQL, RS);
	
	стр = Поле(RS, КолонкаSQL);
	Если НЕ ПустаяСтрока(стр) Тогда
		УстановитьДопРеквизит(ТЗ, ИмяСвойства, стр);
	КонецЕсли;
	 
КонецПроцедуры

Процедура УстановитьДопРеквизит(ТЗ, ИмяСвойства, Значение);
	
	нс = ТЗ.Добавить();
	нс.Свойство = КЭШ.ствСвойства[ИмяСвойства];
	нс.Значение = Значение;

КонецПроцедуры

Процедура ЗаполнитьСпецификацию(обДок, ПараметрыСпецификации)
	
	Если обДок.Продукция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыСпецификации.ЭтоИсправимый Тогда
		обДок.Продукция[0].Спецификация = Неопределено;
		Возврат;		
	КонецЕсли;

	//Если ЗначениеЗаполнено(обДок.Продукция[0].Спецификация) Тогда
	//	Возврат;
	//КонецЕсли;

	ссДок = обДок.Ссылка;
	Если НЕ ЗначениеЗаполнено(ссДок) Тогда
		ссДок = обДок.ПолучитьСсылкуНового();
	КонецЕсли;
	
	ссСпец = Справочники.РесурсныеСпецификации.НайтиПоРеквизиту("юум_ЗаказНаПроизводство", ссДок);
	Если НЕ ЗначениеЗаполнено(ссСпец) Тогда
		
		обСпец = Справочники.РесурсныеСпецификации.СоздатьЭлемент();
		обСпец.ОсновноеИзделиеНоменклатура = обДок.Продукция[0].Номенклатура;
		обСпец.ОсновноеИзделиеВидНоменклатуры = обСпец.ОсновноеИзделиеНоменклатура.ВидНоменклатуры;
		обСпец.ОсновноеИзделиеКоличествоУпаковок = 1;
		
		Если обСпец.ВыходныеИзделия.Количество() = 0 Тогда
			нс = обСпец.ВыходныеИзделия.Добавить();
		Иначе
			нс = обСпец.ВыходныеИзделия[0];			
		КонецЕсли;
			
		нс.Номенклатура = обСпец.ОсновноеИзделиеНоменклатура;
	    нс.ВидНоменклатуры = обСпец.ОсновноеИзделиеВидНоменклатуры;
		нс.КоличествоУпаковок = обСпец.ОсновноеИзделиеКоличествоУпаковок;
		
		обСпец.Наименование = "" + обДок.Продукция[0].Номенклатура + " "
		    + СокрЛП(обДок.Номер)  + "_"
			+ ПараметрыСпецификации.НомерОсновногоЗаказа + "_"
			+ ПараметрыСпецификации.КодДетали;
	    обСпец.юум_ЗаказНаПроизводство = ссДок;
		
		обСпец.Заполнить(Неопределено);
		обСпец.Статус = Перечисления.СтатусыСпецификаций.ВРазработке;
		обСпец.НачалоДействия = обДок.Дата;
		обСпец.Записать();
		ссСпец = обСпец.Ссылка;
	КонецЕсли;
	
	обДок.Продукция[0].Спецификация = ссСпец;
	
КонецПроцедуры

Функция ПолучитьGUIDизCOMSafeArray(COMSafeArray)
	
	МассивGuid = COMSafeArray.Выгрузить();
	GUIDСсылки = "";
	Для н = 12 по 15 Цикл
		GUIDСсылки = GUIDСсылки + Dec_to_Hex(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	
	Для н = 10 по 11 Цикл
		GUIDСсылки = GUIDСсылки + Dec_to_Hex(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	
	Для н = 8 по 9 Цикл
		GUIDСсылки = GUIDСсылки + Dec_to_Hex(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	Для н = 0 по 1 Цикл
		GUIDСсылки = GUIDСсылки + Dec_to_Hex(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	Для н = 2 по 7 Цикл
		GUIDСсылки = GUIDСсылки + Dec_to_Hex(МассивGuid[н]);
	КонецЦикла;
	
	Возврат GUIDСсылки;
	
	//ВозвЗнач=Новый УникальныйИдентификатор(GUIDСсылки);
	//Возврат ВозвЗнач;
КонецФункции

Функция ПолучитьGUIDПоУникальномуИдентификатору(Знач UUID)
	
	ч1 = Сред(UUID, 20, 4);
    ч2 = Сред(UUID, 25, 12);
    ч3 = Сред(UUID, 15, 4);
    ч4 = Сред(UUID, 10, 4);
    ч5 = Сред(UUID, 1, 8);
    Возврат "0x" + ч1 + ч2 + ч3 + ч4 + ч5;
	
КонецФункции
 
Функция Dec_to_Hex(Знач пDec)// пDec - десятичное число(Число)

	арг = пDec;
    Разрядность = 16;
    стр16Число = "";

    Пока пDec <> 0 Цикл

        Поз = пDec % Разрядность;
        стр16Число = Сред("0123456789ABCDEF", Поз + 1, 1) + стр16Число;
        пDec = Цел(пDec / Разрядность);

    КонецЦикла;
	Пока СтрДлина(стр16Число) < 2 Цикл
		стр16Число = "0" + стр16Число;
	КонецЦикла;
	
	Возврат НРег(стр16Число); //Шестнадцатеричное число (Строка)

КонецФункции

//////////////
// Код модуля
//////////////


фф = 1;

#КонецЕсли
