
&ИзменениеИКонтроль("ЗагрузитьОдиночныйВРЦ")
Функция юум_ЗагрузитьОдиночныйВРЦ(ДанныеРасчета, ПараметрыРасчета, Этап, ВидРЦ)
	
	ИнтервалРазмещения = НачальныйИнтервалРазмещенияВРЦ(ДанныеРасчета, ПараметрыРасчета, Этап, ВидРЦ);
	Если ИнтервалРазмещения = Неопределено Тогда
		ОбработатьОшибкуНеНайденаДоступностьВРЦ(ПараметрыРасчета, Этап, ВидРЦ);
		Возврат Ложь;
	КонецЕсли;
	
	ОсталосьРазместить = ВидРЦ.ВремяЗагрузка;
	Начало = '00010101';
	Окончание = '00010101';
	КоличествоИнтервалов = 0;
	#Вставка 
	МаксимальнаяДоступностьВРЦ = ПолучитьМаксимальнуюДоступностьВРЦ(ВидРЦ);
	#КонецВставки
	
	Пока Истина Цикл
		#Удаление 
		ВремяЗагрузка = МИН(ОсталосьРазместить,
			ИнтервалРазмещения.МаксимумВремяЗагрузка, ИнтервалРазмещения.ДоступноВремяЗагрузка);
		#КонецУдаления
		#Вставка 
		ВремяЗагрузка = МИН(ОсталосьРазместить,
			 ИнтервалРазмещения.ДоступноВремяЗагрузка, МаксимальнаяДоступностьВРЦ);
		#КонецВставки
		
		Если ИнтервалРазмещения.НачалоИнтервала < ПараметрыРасчета.ТекущаяДата
			И ИнтервалРазмещения.ОкончаниеИнтервала > ПараметрыРасчета.ТекущаяДата Тогда
			ВремяЗагрузка = Мин(ВремяЗагрузка,
				?(НЕ ВидРЦ.ПараллельнаяЗагрузка,
					ИнтервалРазмещения.ОкончаниеИнтервала - ПараметрыРасчета.ТекущаяДата,
					(ИнтервалРазмещения.ОкончаниеИнтервала - ПараметрыРасчета.ТекущаяДата) * ВидРЦ.МаксимальнаяЗагрузка));
		КонецЕсли;
		
		НоваяСтрока = ДанныеРасчета.ЗагрузкаВРЦ.Добавить();
		НоваяСтрока.Распоряжение = Этап.ЗаказНаПроизводство;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Этап, "Этап, КлючПартия, Подразделение");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ИнтервалРазмещения, "ВидРабочегоЦентра, ДатаИнтервала, Смена");
		
		НоваяСтрока.ЗанятоВремяЗагрузка = ВремяЗагрузка;
		Если НЕ ВидРЦ.ПараллельнаяЗагрузка Тогда
			НоваяСтрока.Занято = ВремяЗагрузка;
		Иначе
			НоваяСтрока.Занято = ?(ВремяЗагрузка = ИнтервалРазмещения.ДоступноВремяЗагрузка,
				ИнтервалРазмещения.ДоступноВремя,
				Окр(ВремяЗагрузка / ВидРЦ.МаксимальнаяЗагрузка));
		КонецЕсли;
		
		НоваяСтрока.Интервал = ИнтервалРазмещения;
		КоличествоИнтервалов = КоличествоИнтервалов + 1;
		
		ИнтервалРазмещения.ДоступноВремяЗагрузка = ИнтервалРазмещения.ДоступноВремяЗагрузка - НоваяСтрока.ЗанятоВремяЗагрузка;
		ИнтервалРазмещения.ДоступноВремя = ИнтервалРазмещения.ДоступноВремя - НоваяСтрока.Занято;
		
		ОсталосьРазместить = ОсталосьРазместить - ВремяЗагрузка;
		Если Начало = '00010101' Тогда
			Начало = ИнтервалРазмещения.НачалоИнтервала;
		КонецЕсли;
		
		Если ОсталосьРазместить = 0 Тогда
			Окончание = ИнтервалРазмещения.ОкончаниеИнтервала;
			Прервать;
		КонецЕсли;
		
		// Подбор следующего интервала
		Индекс = ДанныеРасчета.ДоступностьВРЦ.Индекс(ИнтервалРазмещения);
		КоличествоСтрок = ДанныеРасчета.ДоступностьВРЦ.Количество();
		Пока Индекс < КоличествоСтрок Цикл
			// Дочитать доступность
			Если Индекс = КоличествоСтрок - 1
				ИЛИ ДанныеРасчета.ДоступностьВРЦ[Индекс + 1].ВидРабочегоЦентра <> ВидРЦ.ВидРабочегоЦентра Тогда
				ЕстьЗаписи = ДочитатьДоступность(ДанныеРасчета, ПараметрыРасчета, ИнтервалРазмещения, "ДоступностьВРЦ");
				Если Не ЕстьЗаписи Тогда
					ОбработатьОшибкуНеНайденаДоступностьВРЦ(ПараметрыРасчета, Этап, ВидРЦ);
					Возврат Ложь;
				КонецЕсли;
				
				Индекс = ДанныеРасчета.ДоступностьВРЦ.Индекс(ИнтервалРазмещения);
				КоличествоСтрок = ДанныеРасчета.ДоступностьВРЦ.Количество();
			КонецЕсли;
			
			Индекс = Индекс + 1;
			ИнтервалРазмещения = ДанныеРасчета.ДоступностьВРЦ[Индекс];
			Если ИнтервалРазмещения.ДоступноВремяЗагрузка > 0 Тогда
				Прервать;
			ИначеЕсли НЕ ИнтервалРазмещения.ЭтоИндекс И Этап.Непрерывный Тогда
				// Откат размещения
				Для Счетчик = 1 По КоличествоИнтервалов Цикл
					СтрокаЗагрузка = ДанныеРасчета.ЗагрузкаВРЦ[ДанныеРасчета.ЗагрузкаВРЦ.Количество()-1];
					СтрокаЗагрузка.Интервал.ДоступноВремяЗагрузка = СтрокаЗагрузка.Интервал.ДоступноВремяЗагрузка + СтрокаЗагрузка.ЗанятоВремяЗагрузка;
					СтрокаЗагрузка.Интервал.ДоступноВремя = СтрокаЗагрузка.Интервал.ДоступноВремя + СтрокаЗагрузка.Занято;
					ДанныеРасчета.ЗагрузкаВРЦ.Удалить(СтрокаЗагрузка);
				КонецЦикла;
				
				Этап.ОграниченПоОборудованию = Истина;
				
				ОсталосьРазместить = ВидРЦ.ВремяЗагрузка;
				Начало = '00010101';
				КоличествоИнтервалов = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Этап.ОкончаниеПредварительногоБуфера = Начало;
	Этап.НачалоЗавершающегоБуфера = Окончание;
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ЗагрузитьГруппуВРЦ")
Функция юум_ЗагрузитьГруппуВРЦ(ДанныеРасчета, ПараметрыРасчета, Этап, ВидыРабочихЦентров)
	
	ВидРЦ = ВидыРабочихЦентров[0];
	#Вставка 
	Если Не ЗначениеЗаполнено(ВидРЦ.ВремяЗагрузка) Тогда // попался Null
		ВидРЦ.ВремяЗагрузка = 0;	
	КонецЕсли;
	МаксимальнаяДоступностьВРЦ = ПолучитьМаксимальнуюДоступностьВРЦ(ВидРЦ);
	#КонецВставки
	
	ИнтервалРазмещения = НачальныйИнтервалРазмещенияВРЦ(ДанныеРасчета, ПараметрыРасчета, Этап, ВидРЦ);
	Если ИнтервалРазмещения = Неопределено Тогда
		ОбработатьОшибкуНеНайденаДоступностьВРЦ(ПараметрыРасчета, Этап, ВидРЦ);
		Возврат Ложь;
	КонецЕсли;
	
	ОсталосьРазместить = ВидРЦ.ВремяЗагрузка;
	Начало = '00010101';
	Окончание = '00010101';
	КоличествоИнтервалов = 0;
	
	Интервалы = Новый Массив;
	ПоискВРЦ = Новый Структура("ЭтоИндекс, ВидРабочегоЦентра, ДатаИнтервала", Ложь);
	
	Пока Истина Цикл
		Интервалы.Добавить(ИнтервалРазмещения);
		ВремяЗагрузка = МИН(ОсталосьРазместить,
			ИнтервалРазмещения.МаксимумВремяЗагрузка, ИнтервалРазмещения.ДоступноВремяЗагрузка);
		
		// Подбор интервалов дополнительных видов РЦ
		Пока Интервалы.Количество() <> ВидыРабочихЦентров.Количество() Цикл
			Для ИндексВидыРЦ = 1 По ВидыРабочихЦентров.Количество()-1 Цикл
				ДопВидРЦ = ВидыРабочихЦентров[ИндексВидыРЦ];
				
				ПоискВРЦ.ВидРабочегоЦентра = ДопВидРЦ.ВидРабочегоЦентра;
				ПоискВРЦ.ДатаИнтервала = ИнтервалРазмещения.ДатаИнтервала;
				НайденныеСтроки = ДанныеРасчета.ДоступностьВРЦ.НайтиСтроки(ПоискВРЦ);
				
				Если НайденныеСтроки.Количество() > 0
					И НайденныеСтроки[0].ДоступноВремяЗагрузка > 0 Тогда
					// Интервал дополнительного вида найден и доступен
				#Удаление 
					ВремяЗагрузка = МИН(ВремяЗагрузка,
						НайденныеСтроки[0].МаксимумВремяЗагрузка, НайденныеСтроки[0].ДоступноВремяЗагрузка);
				#КонецУдаления
				#Вставка 
					ВремяЗагрузка = МИН(ВремяЗагрузка,
					 	НайденныеСтроки[0].ДоступноВремяЗагрузка, МаксимальнаяДоступностьВРЦ);
				#КонецВставки
					Интервалы.Добавить(НайденныеСтроки[0]);
				Иначе
					// Интервал дополнительного вида не найден или недоступен
					Если Этап.Непрерывный Тогда
						// Откат размещения
						Для Счетчик = 1 По КоличествоИнтервалов Цикл
							СтрокаЗагрузка = ДанныеРасчета.ЗагрузкаВРЦ[ДанныеРасчета.ЗагрузкаВРЦ.Количество()-1];
							СтрокаЗагрузка.Интервал.ДоступноВремяЗагрузка = СтрокаЗагрузка.Интервал.ДоступноВремяЗагрузка + СтрокаЗагрузка.ЗанятоВремяЗагрузка;
							СтрокаЗагрузка.Интервал.ДоступноВремя = СтрокаЗагрузка.Интервал.ДоступноВремя + СтрокаЗагрузка.Занято;
							ДанныеРасчета.ЗагрузкаВРЦ.Удалить(СтрокаЗагрузка);
						КонецЦикла;
						
						Этап.ОграниченПоОборудованию = Истина;
						
						ОсталосьРазместить = ВидРЦ.ВремяЗагрузка;
						Начало = '00010101';
						КоличествоИнтервалов = 0;
					ИначеЕсли ОсталосьРазместить = ВидРЦ.ВремяЗагрузка Тогда
						Этап.ОграниченПоОборудованию = Истина;
					КонецЕсли;
					
					// Поиск нового интервала основного вида РЦ
					Индекс = ДанныеРасчета.ДоступностьВРЦ.Индекс(ИнтервалРазмещения);
					КоличествоСтрок = ДанныеРасчета.ДоступностьВРЦ.Количество();
					Пока Индекс < КоличествоСтрок Цикл
						// Дочитать доступность
						Если Индекс = КоличествоСтрок - 1
							ИЛИ ДанныеРасчета.ДоступностьВРЦ[Индекс + 1].ВидРабочегоЦентра <> ВидРЦ.ВидРабочегоЦентра Тогда
							ЕстьЗаписи = ДочитатьДоступность(ДанныеРасчета, ПараметрыРасчета, ИнтервалРазмещения, "ДоступностьВРЦ");
							Если Не ЕстьЗаписи Тогда
								ОбработатьОшибкуНеНайденаДоступностьВРЦ(ПараметрыРасчета, Этап, ВидРЦ);
								Возврат Ложь;
							КонецЕсли;
							
							Индекс = ДанныеРасчета.ДоступностьВРЦ.Индекс(ИнтервалРазмещения);
							КоличествоСтрок = ДанныеРасчета.ДоступностьВРЦ.Количество();
						КонецЕсли;
						
						Индекс = Индекс + 1;
						ИнтервалРазмещения = ДанныеРасчета.ДоступностьВРЦ[Индекс];
						Если ИнтервалРазмещения.ДоступноВремяЗагрузка > 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Интервалы.Очистить();
					Интервалы.Добавить(ИнтервалРазмещения);
					
					ВремяЗагрузка = МИН(ОсталосьРазместить,
						ИнтервалРазмещения.МаксимумВремяЗагрузка, ИнтервалРазмещения.ДоступноВремяЗагрузка);
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Индекс = 0 По ВидыРабочихЦентров.Количество()-1 Цикл
			ТекущийВидРЦ = ВидыРабочихЦентров[Индекс];
			Интервал = Интервалы[Индекс];
			
			НоваяСтрока = ДанныеРасчета.ЗагрузкаВРЦ.Добавить();
			НоваяСтрока.Распоряжение = Этап.ЗаказНаПроизводство;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Этап, "Этап, КлючПартия, Подразделение");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Интервал, "ВидРабочегоЦентра, ДатаИнтервала, Смена");
			
			НоваяСтрока.ЗанятоВремяЗагрузка = ВремяЗагрузка;
			Если НЕ ТекущийВидРЦ.ПараллельнаяЗагрузка Тогда
				НоваяСтрока.Занято = ВремяЗагрузка;
			Иначе
				НоваяСтрока.Занято = ?(ВремяЗагрузка = Интервал.ДоступноВремяЗагрузка,
					Интервал.ДоступноВремя,
					Окр(ВремяЗагрузка / ТекущийВидРЦ.МаксимальнаяЗагрузка));
			КонецЕсли;
			
			НоваяСтрока.Интервал = Интервал;
			КоличествоИнтервалов = КоличествоИнтервалов + 1;
			
			Интервал.ДоступноВремяЗагрузка = Интервал.ДоступноВремяЗагрузка - НоваяСтрока.ЗанятоВремяЗагрузка;
			Интервал.ДоступноВремя = Интервал.ДоступноВремя - НоваяСтрока.Занято;
		КонецЦикла;
		Интервалы.Очистить();
		
		ОсталосьРазместить = ОсталосьРазместить - ВремяЗагрузка;
		Если Начало = '00010101' Тогда
			Начало = ИнтервалРазмещения.НачалоИнтервала;
		КонецЕсли;
		
		Если ОсталосьРазместить = 0 Тогда
			Окончание = ИнтервалРазмещения.ОкончаниеИнтервала;
			Прервать;
		КонецЕсли;
		
		// Подбор следующего интервала
		Индекс = ДанныеРасчета.ДоступностьВРЦ.Индекс(ИнтервалРазмещения);
		КоличествоСтрок = ДанныеРасчета.ДоступностьВРЦ.Количество();
		Пока Индекс < КоличествоСтрок Цикл
			// Дочитать доступность
			Если Индекс = КоличествоСтрок - 1
				ИЛИ ДанныеРасчета.ДоступностьВРЦ[Индекс + 1].ВидРабочегоЦентра <> ВидРЦ.ВидРабочегоЦентра Тогда
				ЕстьЗаписи = ДочитатьДоступность(ДанныеРасчета, ПараметрыРасчета, ИнтервалРазмещения, "ДоступностьВРЦ");
				Если Не ЕстьЗаписи Тогда
					ОбработатьОшибкуНеНайденаДоступностьВРЦ(ПараметрыРасчета, Этап, ВидРЦ);
					Возврат Ложь;
				КонецЕсли;
				
				Индекс = ДанныеРасчета.ДоступностьВРЦ.Индекс(ИнтервалРазмещения);
				КоличествоСтрок = ДанныеРасчета.ДоступностьВРЦ.Количество();
			КонецЕсли;
			
			Индекс = Индекс + 1;
			ИнтервалРазмещения = ДанныеРасчета.ДоступностьВРЦ[Индекс];
			Если ИнтервалРазмещения.ДоступноВремяЗагрузка > 0 Тогда
				Прервать;
			ИначеЕсли НЕ ИнтервалРазмещения.ЭтоИндекс И Этап.Непрерывный Тогда
				// Откат размещения
				Для Счетчик = 1 По КоличествоИнтервалов Цикл
					СтрокаЗагрузка = ДанныеРасчета.ЗагрузкаВРЦ[ДанныеРасчета.ЗагрузкаВРЦ.Количество()-1];
					СтрокаЗагрузка.Интервал.ДоступноВремяЗагрузка = СтрокаЗагрузка.Интервал.ДоступноВремяЗагрузка + СтрокаЗагрузка.ЗанятоВремяЗагрузка;
					СтрокаЗагрузка.Интервал.ДоступноВремя = СтрокаЗагрузка.Интервал.ДоступноВремя + СтрокаЗагрузка.Занято;
					ДанныеРасчета.ЗагрузкаВРЦ.Удалить(СтрокаЗагрузка);
				КонецЦикла;
				
				Этап.ОграниченПоОборудованию = Истина;
				
				ОсталосьРазместить = ВидРЦ.ВремяЗагрузка;
				Начало = '00010101';
				КоличествоИнтервалов = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Этап.ОкончаниеПредварительногоБуфера = Начало;
	Этап.НачалоЗавершающегоБуфера = Окончание;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМаксимальнуюДоступностьВРЦ(ВидРЦ)
	СтрокаРеквизитовВРЦ = "КоличествоРабочихЦентров, МаксимальнаяДоступностьРЦ, ЕдиницаИзмеренияДоступностиРЦ";
	РеквизитыВРЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРЦ.ВидРабочегоЦентра, СтрокаРеквизитовВРЦ);
	Если РеквизитыВРЦ.ЕдиницаИзмеренияДоступностиРЦ = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
	    КоэффициентПересчетаВСекунды = 60;
	ИначеЕсли РеквизитыВРЦ.ЕдиницаИзмеренияДоступностиРЦ = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
	    КоэффициентПересчетаВСекунды = 3600;
	ИначеЕсли РеквизитыВРЦ.ЕдиницаИзмеренияДоступностиРЦ = Перечисления.ЕдиницыИзмеренияВремени.Сутки Тогда
	    КоэффициентПересчетаВСекунды = 86400;
	Иначе	
	    КоэффициентПересчетаВСекунды = 1;
	КонецЕсли;
	
	МаксимальнаяДоступностьВРЦ = 
		РеквизитыВРЦ.МаксимальнаяДоступностьРЦ * РеквизитыВРЦ.КоличествоРабочихЦентров * КоэффициентПересчетаВСекунды;
	
    Возврат МаксимальнаяДоступностьВРЦ;
КонецФункции // ()

&ИзменениеИКонтроль("ЗаписатьЗагрузкуВРЦ")
Процедура юум_ЗаписатьЗагрузкуВРЦ(ДанныеРасчета, ПараметрыРасчета, ОтборПоЭтапам)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗагрузкаВРЦ = ДанныеРасчета.ЗагрузкаВРЦ;
	ЭтапыСРучнымРазмещением = ДанныеРасчета.ЭтапыСРучнымРазмещением;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Загрузка.ДатаИнтервала, ДЕНЬ) КАК Период,
		|	Загрузка.ВидРабочегоЦентра                  КАК ВидРабочегоЦентра,
		|	Загрузка.ДатаИнтервала                      КАК ДатаИнтервала,
		|	Загрузка.Занято                             КАК Занято,
		|	Загрузка.Распоряжение                       КАК Распоряжение,
		|	Загрузка.Подразделение                      КАК Подразделение,
		|	Загрузка.Смена                              КАК Смена,
		|	Загрузка.КлючПартия                         КАК КлючПартия,
		|	Загрузка.Этап                               КАК Этап
		|ПОМЕСТИТЬ ВТНовыйГрафик
		|ИЗ
		|	&ЗагрузкаВРЦ КАК Загрузка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Регистратор.Дата             КАК Период,
		|	МАКСИМУМ(Регистратор.Ссылка) КАК Ссылка
		|ПОМЕСТИТЬ ВТРегистраторы
		|ИЗ
		|	Документ.РегистраторГрафикаПроизводства КАК Регистратор
		|ГДЕ
		|	Регистратор.Проведен
		|	И Регистратор.Дата В (
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Т.Период КАК Дата
		|		ИЗ
		|			ВТНовыйГрафик КАК Т)
		|
		|СГРУППИРОВАТЬ ПО
		|	Регистратор.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Регистратор       КАК Регистратор,
		|	ВложенныйЗапрос.Период            КАК Период,
		|	ВложенныйЗапрос.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ВложенныйЗапрос.ДатаИнтервала     КАК ДатаИнтервала,
		|	СУММА(ВложенныйЗапрос.Занято)     КАК Занято,
		|	ВложенныйЗапрос.Распоряжение      КАК Распоряжение,
		|	ВложенныйЗапрос.Подразделение     КАК Подразделение,
		|	ВложенныйЗапрос.Смена             КАК Смена,
		|	ВложенныйЗапрос.КлючПартия        КАК КлючПартия,
		|	ВложенныйЗапрос.Этап              КАК Этап
		|ИЗ
		|	(
		|		ВЫБРАТЬ
		|			ВЫБОР
		|				КОГДА НовыйГрафик.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
		|					ТОГДА НовыйГрафик.Этап
		|				ИНАЧЕ ЕСТЬNULL(Регистраторы.Ссылка, ЗНАЧЕНИЕ(Документ.РегистраторГрафикаПроизводства.ПустаяСсылка))
		|			КОНЕЦ                         КАК Регистратор,
		|			НовыйГрафик.Период            КАК Период,
		|			НовыйГрафик.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|			НовыйГрафик.ДатаИнтервала     КАК ДатаИнтервала,
		|			НовыйГрафик.Занято            КАК Занято,
		|			НовыйГрафик.Распоряжение      КАК Распоряжение,
		|			НовыйГрафик.Подразделение     КАК Подразделение,
		|			НовыйГрафик.Смена             КАК Смена,
		|			НовыйГрафик.КлючПартия        КАК КлючПартия,
		|			НовыйГрафик.Этап              КАК Этап
		|		ИЗ
		|			ВТНовыйГрафик КАК НовыйГрафик
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторы КАК Регистраторы
		|			ПО НовыйГрафик.Этап ССЫЛКА Справочник.ЭтапыПроизводства
		|				И НовыйГрафик.Период = Регистраторы.Период
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			СтарыйГрафик.Регистратор       КАК Регистратор,
		|			СтарыйГрафик.Период            КАК Период,
		|			СтарыйГрафик.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|			СтарыйГрафик.ДатаИнтервала     КАК ДатаИнтервала,
		|			-СтарыйГрафик.Занято           КАК Занято,
		|			СтарыйГрафик.Распоряжение      КАК Распоряжение,
		|			СтарыйГрафик.Подразделение     КАК Подразделение,
		|			СтарыйГрафик.Смена             КАК Смена,
		|			СтарыйГрафик.КлючПартия        КАК КлючПартия,
		|			СтарыйГрафик.Этап              КАК Этап
		|		ИЗ
		|			РегистрНакопления.ДоступностьВидовРабочихЦентров КАК СтарыйГрафик
		|		ГДЕ
		|			СтарыйГрафик.Распоряжение = &Заказ
		|			И &ТекстЗапросаОтборПоЭтапам
		|			И &ТекстЗапросаИсключитьЭтапыСРучнымРазмещением
		|	) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.ВидРабочегоЦентра,
		|	ВложенныйЗапрос.ДатаИнтервала,
		|	ВложенныйЗапрос.Распоряжение,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.Смена,
		|	ВложенныйЗапрос.КлючПартия,
		|	ВложенныйЗапрос.Этап
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.Занято) <> 0
		|
		|ИТОГИ ПО
		|	Регистратор,
		|	Период";
	
	Если ОтборПоЭтапам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаОтборПоЭтапам",
			"(СтарыйГрафик.КлючПартия, СтарыйГрафик.Этап) В (
			|	ВЫБРАТЬ
			|		Т.КлючПартия,
			|		Т.Этап
			|	ИЗ
			|		ВТНовыйГрафик КАК Т)");
	Иначе
		ТекстЗапросаОтборПоЭтапам = 
			"НЕ СтарыйГрафик.Этап В (
			|	ВЫБРАТЬ
			|		Этапы.Ссылка КАК Этап
			|	ИЗ
			|		Документ.ЭтапПроизводства2_2 КАК Этапы
			|	ГДЕ
			|		Этапы.Распоряжение = &Заказ
			|		И Этапы.Проведен
			|		И Этапы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат))";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаОтборПоЭтапам",
			ТекстЗапросаОтборПоЭтапам);
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ОтменитьРучныеИзмененияГрафика
		И ЭтапыСРучнымРазмещением.Количество() > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаИсключитьЭтапыСРучнымРазмещением",
			"СтарыйГрафик.Этап НЕ В (&ЭтапыСРучнымРазмещением)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаИсключитьЭтапыСРучнымРазмещением",
			"ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗагрузкаВРЦ", ЗагрузкаВРЦ);
	Запрос.УстановитьПараметр("Заказ", ПараметрыРасчета.Заказ);
	Запрос.УстановитьПараметр("ЭтапыСРучнымРазмещением", ЭтапыСРучнымРазмещением);
	#Вставка
	МассивРегистраторов = Новый Массив;
	#КонецВставки
	
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		ВыборкаПериод = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаРегистратор.Регистратор.Пустая() Тогда
			Пока ВыборкаПериод.Следующий() Цикл
				ДокументОбъект = Документы.РегистраторГрафикаПроизводства.СоздатьДокумент();
				ДокументОбъект.Дата = ВыборкаПериод.Период;
				ДокументОбъект.Проведен = Истина;
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать();
				
				Набор = РегистрыНакопления.ДоступностьВидовРабочихЦентров.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
				
				Выборка = ВыборкаПериод.Выбрать();
				Пока Выборка.Следующий() Цикл
					Запись = Набор.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					Запись.Регистратор = ДокументОбъект.Ссылка;
				КонецЦикла;
				
				Набор.Записать(Ложь);
				#Вставка
				МассивРегистраторов.Добавить(ДокументОбъект.Ссылка);
				#КонецВставки
			КонецЦикла;
		Иначе
			Набор = РегистрыНакопления.ДоступностьВидовРабочихЦентров.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
			
			Пока ВыборкаПериод.Следующий() Цикл
				Выборка = ВыборкаПериод.Выбрать();
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
				КонецЦикла;
			КонецЦикла;
			
			Набор.Записать(Ложь);
			#Вставка
			МассивРегистраторов.Добавить(ВыборкаРегистратор.Регистратор);
			#КонецВставки
		КонецЕсли;
	КонецЦикла;
	
	ЗагрузкаВРЦ.Свернуть("ВидРабочегоЦентра, ДатаИнтервала");
	РегистрыНакопления.ДоступностьВидовРабочихЦентров.ПроверитьЗагрузкаНеПревышаетДоступностьГрафика(ЗагрузкаВРЦ);
	#Вставка 
	ПараметрыОтбора = Новый Структура("Регистратор", МассивРегистраторов);
	РегистрыНакопления.ДоступностьВидовРабочихЦентров.юум_СвернутьЗаписиПоРесурсуЗанятоСОтбором(ПараметрыОтбора);
	#КонецВставки
	
КонецПроцедуры

&После("ПослеЗаписиГрафикаПроизводства")
Процедура юум_ПослеЗаписиГрафикаПроизводства(Заказ, Этапы)
	// перепишем начало и окончание по записи заказа в соответствии с записями этапов
	СтатусГрафика = РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик(); 
	ПустойКлючСвязи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ПустойЭтап = Справочники.ЭтапыПроизводства.ПустаяСсылка(); 
	
	// запись заказа
	Набор = РегистрыСведений.ГрафикЭтаповПроизводства2_2.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаказНаПроизводство.Установить(Заказ);
	Набор.Отбор.СтатусГрафика.Установить(СтатусГрафика);
	Набор.Отбор.КлючПартия.Установить(ПустойКлючСвязи);
	Набор.Отбор.Этап.Установить(ПустойЭтап); 
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
	    Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойЭтап", ПустойЭтап);
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Заказ);
	Запрос.УстановитьПараметр("СтатусГрафика", СтатусГрафика);  
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(График.Начало) КАК Начало,
	|	МАКСИМУМ(График.Окончание) КАК Окончание
	|ИЗ
	|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК График
	|ГДЕ
	|	График.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И График.СтатусГрафика = &СтатусГрафика
	|	И НЕ График.Этап = &ПустойЭтап";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Начало = ?(Не ЗначениеЗаполнено(Выборка.Начало), '00010101', Выборка.Начало);
		Окончание = ?(Не ЗначениеЗаполнено(Выборка.Окончание), '00010101', Выборка.Окончание);  
		Меняли = Ложь;
		ЗаписьЗаказа = Набор[0]; 
		Если ЗначениеЗаполнено(Выборка.Начало) и НЕ ЗаписьЗаказа.Начало = Выборка.Начало Тогда
		    ЗаписьЗаказа.Начало = Выборка.Начало;
			Меняли = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Окончание) и НЕ ЗаписьЗаказа.Окончание = Выборка.Окончание Тогда
		    ЗаписьЗаказа.Окончание = Выборка.Окончание;
			Меняли = Истина;
		КонецЕсли;
		Если Меняли Тогда
			Набор.Записать(РежимЗамещения.Замещение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
