
Функция ТекущийПользователь() Экспорт
	Возврат ПользователиКлиентСервер.ТекущийПользователь();
КонецФункции

Функция СообщитьОбОшибке(ТекстСообщения, Отказ = ложь, Заголовок = "", Статус = Неопределено) Экспорт
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Важное;
	КонецЕсли;
	
	Отказ = истина;
	
	#Если ВнешнееСоединение Тогда
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
			Заголовок = "";
		КонецЕсли;
		
		ВызватьИсключение (ТекстСообщения);
		
	#Иначе
				
		Если ЗначениеЗаполнено(Заголовок) Тогда
			Сообщить(Заголовок);
			Заголовок = "";
		КонецЕсли;
		Сообщить(ТекстСообщения, Статус);
	#КонецЕсли
	
	Возврат ложь;
КонецФункции

Процедура УстановитьЗначение(Реквизит, Значение) Экспорт

	Если Реквизит <> Значение Тогда
		Реквизит = Значение;
	КонецЕсли;

КонецПроцедуры

Функция ЗначениеЭлементаСтруктуры(Знач Структура, Знач Поле, Знач ЗначениеПоУмолчанию = Неопределено) Экспорт
	Перем Значение;
	
	Возврат ?(Структура.Свойство(Поле, Значение), Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ЗначениеСвойстваОбъекта(Знач Объект, Знач Поле, Знач ЗначениеПоУмолчанию = Неопределено) Экспорт
	пСтрук = новый Структура(Поле, ЗначениеПоУмолчанию);
	
	Попытка
		ЗаполнитьЗначенияСвойств(пСтрук, Объект);
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
	
	Возврат пСтрук[Поле];
КонецФункции

Функция ЗначениеВМассив(Знач Значение) Экспорт
	пРезультат = новый Массив;
	пРезультат.Добавить(Значение);
	
	Возврат пРезультат;
КонецФункции

Функция БезусловнаяЗапись(ДополнительныеСвойства) Экспорт
	// Галфинд ROL32:1 07.12.2022 - новая функция
	Возврат (ЗначениеЭлементаСтруктуры(ДополнительныеСвойства, "_БезусловнаяЗапись", ложь) = истина);
КонецФункции

Функция ПолучитьПрефиксИзСтроки(Знач Строка, Знач ЗначениеДляПустого = "") Экспорт
	пСтрока = СокрЛП(Строка);
	пДлина = СтрДлина(пСтрока);
	пПрефикс = "";
	
	Для Сч = 1 по пДлина Цикл
		КодСимвола = КодСимвола(пСтрока, Сч);
		Если (КодСимвола >= 48 и КодСимвола <= 57) Тогда
			Прервать;
		КонецЕсли;
		пПрефикс = пПрефикс + Сред(пСтрока, Сч, 1);
	КонецЦикла;
	
	Возврат ?(пПрефикс = "", ЗначениеДляПустого, пПрефикс);
КонецФункции


Функция ПолучитьГлобальноеЗначение(Имя, ЗначениеПоУмолчанию = Неопределено, ЗаменитьНеопределеноНаЗначениеПоУмолчанию = ложь) Экспорт
	Возврат юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение(Имя, ЗначениеПоУмолчанию, ЗаменитьНеопределеноНаЗначениеПоУмолчанию);
КонецФункции

Функция ПолучитьГлобальноеЗначениеМассив(Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат юум_ОбщегоНазначения.ПолучитьГлобальноеЗначениеМассив(Имя);
КонецФункции

Функция ПолучитьГлобальноеЗначениеСАвторизацией(Имя) Экспорт
	Возврат юум_ОбщегоНазначения.ПолучитьГлобальноеЗначениеСАвторизацией(Имя);
КонецФункции


// Функция выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения
// --- погрешности округления относятся на коэффицент с максимальным весом
//
// Параметры:
//		ИсхСумма - распределяемая сумма
//		МассивКоэф - массив коэффициентов распределения
//		Точность - точность округления при распределении. Необязателен.
//
//	Возврат:
//		МассивСумм - массив размерностью равный массиву коэффициентов, содержит
//			суммы в соответствии с весом коэффициента (из массива коэффициентов)
//          В случае если распределить не удалось (сумма = null
//          или суммарный вес коэф. = 0), тогда возвращается значение Неопределено
//
Функция РаспределитьПропорционально(Знач ИсхСумма, МассивКоэф, Знач Точность = 2) Экспорт

	Если МассивКоэф.Количество() = 0 Тогда
		Возврат Новый Массив;
	ИначеЕсли  ИсхСумма = 0 Тогда
		МассивСумм = Новый Массив(МассивКоэф.Количество());
		Для К = 0 по МассивКоэф.Количество() - 1 Цикл
			МассивСумм[К] = 0;
		КонецЦикла;
		Возврат МассивСумм;
	ИначеЕсли  ИсхСумма = null Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИндексМакс = 0;
	МаксЗнач   = 0;
	РаспрСумма = 0;
	СуммаКоэф  = 0;

	Для К = 0 По МассивКоэф.Количество() - 1 Цикл

		МодульЧисла = ?(МассивКоэф[К] > 0, МассивКоэф[К], - МассивКоэф[К]);

		Если МаксЗнач < МодульЧисла Тогда
			МаксЗнач   = МодульЧисла;
			ИндексМакс = К;
		КонецЕсли;

		СуммаКоэф = СуммаКоэф + МассивКоэф[К];

	КонецЦикла;

	Если СуммаКоэф = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	МассивСумм = Новый Массив(МассивКоэф.Количество());

	Для К = 0 По МассивКоэф.Количество() - 1 Цикл
		МассивСумм[К] = Окр(ИсхСумма * МассивКоэф[К] / СуммаКоэф, Точность, 1);
		РаспрСумма    = РаспрСумма + МассивСумм[К];
	КонецЦикла;

	// Погрешности округления отнесем на коэффицент с максимальным весом
	Если РаспрСумма <> ИсхСумма Тогда
		МассивСумм[ИндексМакс] = МассивСумм[ИндексМакс] + ИсхСумма - РаспрСумма;
	КонецЕсли;

	Возврат МассивСумм;

КонецФункции


Функция СвойстваПериода(Дата1, знач Дата2, ВключатьКонецПериода = ложь) Экспорт
	Если ВключатьКонецПериода Тогда
		Дата2 = КонецДня(Дата2)+1;
	КонецЕсли;
	
	Результат = новый Структура;
	
	Результат.Вставить("ПравильныйПериод", (Дата2 >= Дата1));
	
	Результат.Вставить("РГ", Год(Дата2) - Год(Дата1));
	Результат.Вставить("РМ", Месяц(Дата2) - Месяц(Дата1));
	Результат.Вставить("РД", День(Дата2) - День(Дата1));
	
	Сдвиг = 0;
	Если Результат.ПравильныйПериод и Результат.РД < 0 Тогда
		Сдвиг = -1;
	ИначеЕсли не Результат.ПравильныйПериод и Результат.РД > 0 Тогда
		Сдвиг = +1;
	КонецЕсли;
	
	Результат.Вставить("ЧМ", 12 * Результат.РГ + Результат.РМ + Сдвиг);
	Результат.Вставить("ЧМН", Результат.ЧМ);
	
	ДатаХ = ДобавитьМесяц(Дата1, Результат.ЧМ);
	
	Если Результат.ПравильныйПериод Тогда
		Результат.ЧМН = Результат.ЧМН + ?(ДатаХ < Дата2, 1,0);
	Иначе
		Результат.ЧМН = Результат.ЧМН - ?(ДатаХ > Дата2, 1,0);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЧислоМесяцевВПериоде(Дата1, Дата2, ВключатьКонецПериода = ложь, ТолькоПолныеМесяцы = истина) Экспорт
	Значение = СвойстваПериода(Дата1, Дата2, ВключатьКонецПериода);
	Возврат ?(ТолькоПолныеМесяцы, Значение.ЧМ, Значение.ЧМН);
КонецФункции

Функция ЧислоПолныхМесяцевВПериоде(Дата1, Дата2, ВключатьКонецПериода = ложь) Экспорт
	Возврат СвойстваПериода(КонецДня(Дата1)+1, Дата2, ВключатьКонецПериода).ЧМ;
КонецФункции

Функция ЧислоНеполныхМесяцевВПериоде(Дата1, Дата2, ВключатьКонецПериода = ложь) Экспорт
	Возврат СвойстваПериода(КонецДня(Дата1)+1, Дата2, ВключатьКонецПериода).ЧМН;
КонецФункции


#Если Клиент Тогда
	
Процедура ОткрытьФормуВнешнейОбработки(Знач Ссылка, Знач ВладелецФормы, Параметры = Неопределено, ЭтоОтчет = ложь, ИмяФормы = "", пРежимОткрытияОкна = "Независимый", пУникальность = ложь) Экспорт
	// создана на базе ОбщийМодуль.ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки()
	
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		пСтрук = юум_ОбщегоНазначения.СформироватьПараметрыЗапускаВнешнейОбработки(Ссылка, ЭтоОтчет);
		Если пСтрук = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ссылка = пСтрук.Ссылка;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ВызватьИсключение "Обычное приложение не поддерживается!"
	#Иначе
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Ссылка);
		
		Если ЭтоОтчет Тогда
			пИмяФормы = "ВнешнийОтчет." + ИмяОбработки + ".Форма";
		Иначе
			пИмяФормы = "ВнешняяОбработка." + ИмяОбработки + ".Форма";
		КонецЕсли;
		
		Если не ПустаяСтрока(ИмяФормы) Тогда
			пИмяФормы = пИмяФормы + "." + ИмяФормы;
		КонецЕсли;
		
		ОткрытьФорму(пИмяФормы, Параметры, ВладелецФормы,пУникальность,,,,РежимОткрытияОкнаФормы[пРежимОткрытияОкна]);
	#КонецЕсли
КонецПроцедуры

Процедура ОткрытьФормуВыбораПоказателейОтчетов(Владелец, ВидОтчета = Неопределено, ТекущийПоказатель = Неопределено, ЗакрыватьПриВыборе = истина, МножественныйВыбор = ложь) Экспорт
	пСтрук = новый Структура;
	пСтрук.Вставить("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе);
	пСтрук.Вставить("МножественныйВыбор", МножественныйВыбор);
	пСтрук.Вставить("ТекущаяСтрока", ТекущийПоказатель);
	
	пСтрук.Вставить("Отбор", новый Структура);
	пСтрук.Отбор.Вставить("Владелец", ВидОтчета);
	
	ОткрытьФорму("Справочник.ПоказателиОтчетов.Форма._ФормаВыбора", пСтрук, Владелец);
КонецПроцедуры

#КонецЕсли