
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() и не ПустаяСтрока(Запись.ВидОбъекта) Тогда
		Если не ТолькоПросмотр Тогда
			вЗаполнитьСписокОбъетков();
			вЗаполнитьСписокТабличныхЧастей();
			вЗаполнитьСписокРеквизитов();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если не ТолькоПросмотр Тогда
		вЗаполнитьСписокОбъетков();
		вЗаполнитьСписокТабличныхЧастей();
		вЗаполнитьСписокРеквизитов();
		УстановитьВидимость();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	вЗаполнитьСписокОбъетков();
	вЗаполнитьСписокТабличныхЧастей();
	вЗаполнитьСписокРеквизитов();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаПриИзменении(Элемент)
	вЗаполнитьСписокТабличныхЧастей();
	вЗаполнитьСписокРеквизитов();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	вЗаполнитьСписокРеквизитов();
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСписокОбъетков()
	Список = Элементы.ИмяОбъекта.СписокВыбора;
	
	Если Запись.ВидОбъекта = "Справочник" Тогда
		РазделМД = Метаданные.Справочники;
	ИначеЕсли Запись.ВидОбъекта = "Документ" Тогда
		РазделМД = Метаданные.Документы;
	Иначе
		Список.Очистить();
		Возврат;
	КонецЕсли;
	
	Список.Очистить();
	
	Для каждого Элем из РазделМД Цикл
		Список.Добавить(Элем.Имя);
	КонецЦикла;
	
	Список.СортироватьПоЗначению();
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСписокТабличныхЧастей()
	Список = Элементы.ИмяТабличнойЧасти.СписокВыбора;
	
	Список.Очистить();
	
	Если не ПустаяСтрока(Запись.ВидОбъекта) и не ПустаяСтрока(Запись.ИмяОбъекта) Тогда
		ОбъектМД = Метаданные.НайтиПоПолномуИмени(Запись.ВидОбъекта + "." + Запись.ИмяОбъекта);
		
		Если ОбъектМД <> Неопределено Тогда
			Для каждого Элем из ОбъектМД.ТабличныеЧасти Цикл
				Список.Добавить(Элем.Имя);
			КонецЦикла;
			
			Список.СортироватьПоЗначению();
		Иначе
			Запись.ИмяТабличнойЧасти = "";
			Запись.ИмяРеквизита = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСписокРеквизитов()
	Список = Элементы.ИмяРеквизита.СписокВыбора;
	
	Список.Очистить();
	
	Если не ПустаяСтрока(Запись.ВидОбъекта) и не ПустаяСтрока(Запись.ИмяОбъекта) Тогда
		ОбъектМД = Метаданные.НайтиПоПолномуИмени(Запись.ВидОбъекта + "." + Запись.ИмяОбъекта);
		
		Если ОбъектМД = Неопределено Тогда
			Запись.ИмяТабличнойЧасти = "";
			Запись.ИмяРеквизита = "";
			Возврат;
		КонецЕсли;
		
		Если не ПустаяСтрока(Запись.ИмяТабличнойЧасти) Тогда
			Если ОбъектМД.ТабличныеЧасти.Найти(Запись.ИмяТабличнойЧасти) <> Неопределено Тогда
				ОбъектМД = ОбъектМД.ТабличныеЧасти[Запись.ИмяТабличнойЧасти];
			Иначе
				Запись.ИмяТабличнойЧасти = "";
			КонецЕсли;
		КонецЕсли;
		
		Если ОбъектМД <> Неопределено Тогда
			Для каждого Элем из ОбъектМД.Реквизиты Цикл
				Список.Добавить(Элем.Имя);
			КонецЦикла;
			
			Список.СортироватьПоЗначению();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ВидНоменклатуры.Видимость = (Запись.ИмяОбъекта = "Номенклатура");

КонецПроцедуры
