#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// #юум {
// #04.02.01.02.01
// Добавление новой команды печати
// Галфинд Домнышева 2026/10/27
&После("ДобавитьКомандыПечати")
Процедура юум_ДобавитьКомандыПечати(КомандыПечати)
	
	// Сводная спецификация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "юум_СводнаяСпецификация";
	КомандаПечати.Представление = НСтр("ru = 'Сводная спецификация'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры
// } #юум

// #юум {
// #04.02.01.02.01
// Добавление новой команды печати
// Галфинд Домнышева 2026/10/27
&После("Печать")
Процедура юум_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "юум_СводнаяСпецификация") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"юум_СводнаяСпецификация",
			НСтр("ru = 'Сводная спецификация'"),
			ПечатьСводнойСпецификации(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры
// } #юум

#КонецОбласти

// #юум {
// #04.02.01.02.01
// Формирование ПФ юум_СводнаяСпецификация
// Галфинд Домнышева 2026/10/27
//
// Параметры:
//  МассивОбъектов - Массив - из ссылок ДокументСсылка.ЗаказКлиента
//  ОбъектыПечати - СписокЗначений
//
// Возвращаемое значение:
//	ТабличныйДокумент - ТабличныйДокумент  
//
Функция ПечатьСводнойСпецификации(МассивОбъектов, ОбъектыПечати)
	
	ДатаСоставления = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	Составил = ПолучитьСоставителяПоПользователю();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказКлиента_юум_СводнаяСпецификация";
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказКлиента.юум_СводнаяСпецификация");
	
	Область_Шапка					= Макет.ПолучитьОбласть("Шапка");
	Область_ШапкаТаблицы			= Макет.ПолучитьОбласть("ШапкаТаблицы");
	Область_СтрокаИзделия			= Макет.ПолучитьОбласть("СтрокаИзд");
	Область_СтрокаЗаказа 			= Макет.ПолучитьОбласть("СтрокаЗаказа");
	Область_СтрокаСпец 				= Макет.ПолучитьОбласть("СтрокаСпец");
	Область_Подвал   				= Макет.ПолучитьОбласть("Подвал"); 
	Область_ПустаяСтрока			= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ДанныеДокумента = ПолучитьДанныеДляСпецификации(МассивОбъектов);
	ВыборкаОсновноеИзделие = ДанныеДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПервыйДокумент = Истина;
	НомерЛиста = 1;
	МассивВыводимыхОбластей = Новый Массив;
	
	Пока ВыборкаОсновноеИзделие.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        ПервыйДокумент = Ложь;                          
		
		СпецИмя = ?(ВыборкаОсновноеИзделие.СпецификацияПроработана, "Окончательная", "Предварительная");
		Область_Шапка.Параметры.СпецИмя = СпецИмя;
		Область_Шапка.Параметры.НомерЛиста = НомерЛиста;
		Область_Шапка.Параметры.Заполнить(ВыборкаОсновноеИзделие);
		ТабличныйДокумент.Вывести(Область_Шапка);
		
		Область_Подвал.Параметры.Составил = Составил;
		Область_Подвал.Параметры.Дата = ДатаСоставления;
		
		ТабличныйДокумент.Вывести(Область_ШапкаТаблицы);
		
		КолНаИзд = ?(ВыборкаОсновноеИзделие.КоличествоУпаковокСпец = ВыборкаОсновноеИзделие.КоличествоЗаказа,
					ВыборкаОсновноеИзделие.КоличествоУпаковокСпец, "");
		
		Область_СтрокаИзделия.Параметры.Заполнить(ВыборкаОсновноеИзделие);
		Область_СтрокаИзделия.Параметры.КолНаИзд = КолНаИзд;
		ТабличныйДокумент.Вывести(Область_СтрокаИзделия);

		ВыборкаНоменклатураЗаказа = ВыборкаОсновноеИзделие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ЗаполнениеТаблицыТабличногоДокумента(ТабличныйДокумент, ВыборкаНоменклатураЗаказа, Макет, НомерЛиста);
				
		НомерЛиста	= НомерЛиста +	1;
		Область_Подвал.Параметры.Составил = Составил;
		Область_Подвал.Параметры.Дата = ДатаСоставления;
		
		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(Область_ПустаяСтрока);
		МассивВыводимыхОбластей.Добавить(Область_Подвал);
		Пока ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Цикл              
			ТабличныйДокумент.Вывести(Область_ПустаяСтрока);    
		КонецЦикла;

		ТабличныйДокумент.Вывести(Область_Подвал);

	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ЗаполнитьКоличествоЛистов(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;	
	
КонецФункции
// } #юум

// #юум {
// #04.02.01.02.01
// Получение фамилии пользователя
// Галфинд Домнышева 2026/10/27
//
// Возвращаемое значение:
//	Составил - Строка, СправочникСсылка.Пользователи  
//
Функция ПолучитьСоставителяПоПользователю()
	
	Пользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(Пользователь.ФизическоеЛицо) Тогда
		Составил = ФизическиеЛицаУТ.ФамилияИмяОтчество(Пользователь.ФизическоеЛицо, ТекущаяДатаСеанса()).Фамилия;
	Иначе
		Составил = Пользователь;
	КонецЕсли;
	
    Возврат Составил;
	
КонецФункции
// } #юум

// #юум {
// #04.02.01.02.01
// Получение данных для заполнения ПФ юум_СводнаяСпецификация
// Галфинд Домнышева 2026/10/27
//
// Параметры:
//  МассивОбъектов - Массив - из ссылок ДокументСсылка.ЗаказКлиента
//
// Возвращаемое значение:
//	РезультатЗапроса -  РезультатЗапроса, Неопределено  
//
Функция ПолучитьДанныеДляСпецификации(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.юум_СпецификацияПроработана КАК СпецификацияПроработана,
		|	ЗаказКлиента.юум_ОсновноеИзделие КАК юум_ОсновноеИзделие
		|ПОМЕСТИТЬ ЗаказыКлиентов
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство2_2.ДокументОснование КАК ДокументОснование,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(ЗаказНаПроизводство2_2.Номер) КАК Номер,
		|	МИНИМУМ(ЗаказНаПроизводство2_2.Ссылка) КАК Ссылка
		|ПОМЕСТИТЬ ЗаказыНаПроизводство
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
		|		ПО ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказНаПроизводство2_2.Ссылка
		|ГДЕ
		|	ЗаказНаПроизводство2_2.ДокументОснование В
		|			(ВЫБРАТЬ
		|				ЗаказыКлиентов.Ссылка
		|			ИЗ
		|				ЗаказыКлиентов КАК ЗаказыКлиентов)
		|   И ЗаказНаПроизводство2_2.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПроизводство2_2.ДокументОснование,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка КАК Ссылка,
		|	ЗаказыНаПроизводство.ДокументОснование КАК ДокументОснование,
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК НоменклатураСпец,
		|	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковокСпец,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК НоменклатураЗаказа,
		|	ЗаказНаПроизводство2_2Продукция.Количество КАК КоличествоЗаказа,
		|	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
		|	ЗаказыНаПроизводство.Номер КАК НомерЗаказа,
		|	РесурсныеСпецификацииМатериалыИУслуги.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ТОВАРЫСпецификации
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыНаПроизводство КАК ЗаказыНаПроизводство
		|		ПО ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказыНаПроизводство.Ссылка
		|			И ЗаказНаПроизводство2_2Продукция.Номенклатура = ЗаказыНаПроизводство.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		|		ПО ЗаказНаПроизводство2_2Продукция.Спецификация = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
		|			И (РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыКлиентов.Ссылка КАК ЗаказКлиента,
		|	ЗаказыКлиентов.НомерСтроки КАК НомерСтроки,
		|	ЗаказыКлиентов.Номенклатура КАК НоменклатураКлиента,
		|	ЗаказыКлиентов.Номенклатура.Код КАК НоменклатураКлиентаКод,
		|	ЗаказыКлиентов.Номенклатура.ВесЧислитель КАК НоменклатураКлиентаВесЧислитель,
		|	ЗаказыКлиентов.СпецификацияПроработана КАК СпецификацияПроработана,
		|	ЗаказыКлиентов.юум_ОсновноеИзделие КАК ОсновноеИзделие,
		|	ЗаказыКлиентов.юум_ОсновноеИзделие.ВесЧислитель КАК ОсновноеИзделиеВесЧислитель,
		|	ЗаказыКлиентов.юум_ОсновноеИзделие.Код КАК ОсновноеИзделиеКод,
		|	ЕстьNULL(ТОВАРЫСпецификации.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)) КАК ЗаказНапроизводство,
		|	ЕстьNULL(ТОВАРЫСпецификации.НоменклатураСпец, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураСпец,
		|	ТОВАРЫСпецификации.НоменклатураЗаказа КАК НоменклатураЗаказа,
		|	ЕстьNULL(ТОВАРЫСпецификации.НоменклатураЗаказа.Код, """") КАК НоменклатураЗаказаКод,
		|	ЕстьNULL(ТОВАРЫСпецификации.НоменклатураЗаказа.ВесЧислитель, 0) КАК НоменклатураЗаказаВесЧислитель,
		|	ЕстьNULL(ТОВАРЫСпецификации.Спецификация, """") КАК Спецификация,
		|	ЕстьNULL(ТОВАРЫСпецификации.НомерЗаказа, """") КАК НомерЗаказа,
		|	ЕстьNULL(ТОВАРЫСпецификации.НоменклатураСпец.Код, """") КАК НоменклатураСпецКод,
		|	ЕстьNULL(ТОВАРЫСпецификации.НоменклатураСпец.ВесЧислитель, 0) КАК НоменклатураСпецВесЧислитель,
		|	ЕстьNULL(ТОВАРЫСпецификации.НоменклатураСпец.ВесЧислитель, 0) * ЕстьNULL(ТОВАРЫСпецификации.КоличествоУпаковокСпец,0) КАК НоменклатураСпецВесКомпл,
		|	ЕстьNULL(ТОВАРЫСпецификации.НомерСтроки, """") КАК НомерСтрокиСпец,
		|	ЕстьNULL(ТОВАРЫСпецификации.КоличествоУпаковокСпец, 1) КАК КоличествоУпаковокСпец,
		|	ЕстьNULL(ТОВАРЫСпецификации.КоличествоЗаказа, 1) КАК КоличествоЗаказа
		|ИЗ
		|	ЗаказыКлиентов КАК ЗаказыКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТОВАРЫСпецификации КАК ТОВАРЫСпецификации
		|		ПО ЗаказыКлиентов.Ссылка = ТОВАРЫСпецификации.ДокументОснование
		|			И ЗаказыКлиентов.Номенклатура = ТОВАРЫСпецификации.НоменклатураЗаказа
		|ИТОГИ
		|	МАКСИМУМ(НомерСтроки),
		|	МИНИМУМ(СпецификацияПроработана),
		|	Максимум(КоличествоУпаковокСпец),
		|	МАКСИМУМ(КоличествоЗаказа)
		|ПО
		|	ОсновноеИзделие,
		|	НоменклатураЗаказа";

	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
// } #юум

// #юум {
// #04.02.01.02.01
// Проверка возможности вывода области Подвал и формирование новой страницы в случае ее отсутствия
// Галфинд Домнышева 2026/10/27
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - формируемый ТабличныйДокумент
//  ОбластьСтрока - ТабличныйДокумент - область "ШапкаСтрока"
//  Область_Подвал - ТабличныйДокумент - область "ШапкаПодвал"
//  Область_Шапка - ТабличныйДокумент - область "Шапка"
//  Область_ШапкаТаблицы - ТабличныйДокумент - область "ШапкаТаблицы"
//  НомерЛиста - Число - номер текущего листа ПФ
//
Процедура ПроверитьВыводВывестиПодвал(ТабличныйДокумент, ОбластьСтрока, Область_Подвал, Область_Шапка, 
	Область_ШапкаТаблицы, НомерЛиста) 
	
	МассивВыводимыхОбластей = Новый Массив;
	МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
	МассивВыводимыхОбластей.Добавить(Область_Подвал);
	
	Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
		ТабличныйДокумент.Вывести(Область_Подвал);
		
		НомерЛиста	= НомерЛиста +	1;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Область_Шапка.Параметры.НомерЛиста = НомерЛиста;
		ТабличныйДокумент.Вывести(Область_Шапка);
		ТабличныйДокумент.Вывести(Область_ШапкаТаблицы);
	КонецЕсли;
	
КонецПроцедуры 
// } #юум

// #юум {
// #04.02.01.02.01
// Проверка возможности вывода областей СтрокаЗаказа и СтрокаСпец
// Галфинд Домнышева 2026/10/27
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - формируемый ТабличныйДокумент
//  ВыборкаНоменклатураЗаказа - ВыборкаИзРезультатаЗапроса 
//  Макет - ТабличныйДокумент - макет ПФ
//  НомерЛиста - Число - номер текущего листа ПФ
//
Процедура ЗаполнениеТаблицыТабличногоДокумента(ТабличныйДокумент, ВыборкаНоменклатураЗаказа, Макет, НомерЛиста)
	
	Область_Шапка					= Макет.ПолучитьОбласть("Шапка");
	Область_ШапкаТаблицы			= Макет.ПолучитьОбласть("ШапкаТаблицы");
	Область_СтрокаЗаказа 			= Макет.ПолучитьОбласть("СтрокаЗаказа");
	Область_СтрокаСпец 				= Макет.ПолучитьОбласть("СтрокаСпец");
	Область_Подвал   				= Макет.ПолучитьОбласть("Подвал"); 
	
	Пока ВыборкаНоменклатураЗаказа.Следующий() Цикл
			
			Выборка = ВыборкаНоменклатураЗаказа.Выбрать();
			Если ВыборкаНоменклатураЗаказа.НоменклатураЗаказа = NULL Тогда
				Пока Выборка.Следующий() Цикл
					
					Область_СтрокаЗаказа.Параметры.Заполнить(Выборка);
					Область_СтрокаЗаказа.Параметры.НоменклатураЗаказа = Выборка.НоменклатураКлиента;
					Область_СтрокаЗаказа.Параметры.НоменклатураЗаказаКод = Выборка.НоменклатураКлиентаКод;
					Область_СтрокаЗаказа.Параметры.НоменклатураЗаказаВесЧислитель = Выборка.НоменклатураКлиентаВесЧислитель;
					Область_СтрокаЗаказа.Параметры.НоменклатураЗаказаВесКомплекта = Выборка.НоменклатураКлиентаВесЧислитель;
					Область_СтрокаЗаказа.Параметры.КоличествоЗаказа = "1";
					
					ПроверитьВыводВывестиПодвал(ТабличныйДокумент, Область_СтрокаЗаказа, Область_Подвал, Область_Шапка, 
										Область_ШапкаТаблицы, НомерЛиста);
					
					ТабличныйДокумент.Вывести(Область_СтрокаЗаказа);
					
				КонецЦикла;
				Продолжить;
			КонецЕсли;
			
			Область_СтрокаЗаказа.Параметры.Заполнить(ВыборкаНоменклатураЗаказа);
			Область_СтрокаЗаказа.Параметры.НоменклатураЗаказаВесКомплекта = 
					ВыборкаНоменклатураЗаказа.НоменклатураЗаказаВесЧислитель * ВыборкаНоменклатураЗаказа.КоличествоЗаказа;
					
			ПроверитьВыводВывестиПодвал(ТабличныйДокумент, Область_СтрокаЗаказа, Область_Подвал, Область_Шапка, 
										Область_ШапкаТаблицы, НомерЛиста); 
						
			ТабличныйДокумент.Вывести(Область_СтрокаЗаказа);
			
			Пока Выборка.Следующий() Цикл
				Область_СтрокаСпец.Параметры.Заполнить(Выборка);
				
				Область_СтрокаСпец.Параметры.НомерСпец = "" + Выборка.НомерСтроки + "." + Выборка.НомерСтрокиСпец;
				
				ПроверитьВыводВывестиПодвал(ТабличныйДокумент, Область_СтрокаСпец, Область_Подвал, Область_Шапка, 
											Область_ШапкаТаблицы, НомерЛиста);
				
				ТабличныйДокумент.Вывести(Область_СтрокаСпец);
				
			КонецЦикла;

		КонецЦикла;
		
КонецПроцедуры
// } #юум

// #юум {
// #04.02.01.02.01
// Заполнение параметра Листов по всему Табличному документу
// Галфинд Домнышева 2026/10/27
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - формируемый ТабличныйДокумент
//
Процедура ЗаполнитьКоличествоЛистов(ТабличныйДокумент)
	
	ИтогоСтраниц = ТабличныйДокумент.КоличествоСтраниц();

	ОбластьВсегоСтраниц = ТабличныйДокумент.НайтиТекст("%ВсегоЛ%");
	Пока ОбластьВсегоСтраниц <> Неопределено Цикл
		ОбластьВсегоСтраниц.Текст = СтрЗаменить(ОбластьВсегоСтраниц.Текст, "%ВсегоЛ%", "Листов " + ИтогоСтраниц);
		// Ищем следующее вхождение
		ОбластьВсегоСтраниц = ТабличныйДокумент.НайтиТекст("%ВсегоЛ%");
	КонецЦикла;
	
КонецПроцедуры 
// } #юум

#КонецОбласти 

#КонецЕсли