#Если Не МобильныйАвтономныйСервер Тогда
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

// #юум {
// #04.02.01.02.01
// Выполнение поиска Ресурсной Спецификации при проведении документа
// Галфинд Домнышева 2026/10/27
&После("ОбработкаПроведения")
Процедура юум_ОбработкаПроведения(Отказ, РежимПроведения)
	
	НайтиСпецификациюИПровести();
	
КонецПроцедуры
// } #юум

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #юум {
// #04.02.01.02.01
// Выполнение поиска Ресурсных Спецификаций и установление в них признака юум_СпецификацияПроработана
// Галфинд Домнышева 2026/10/27
Процедура НайтиСпецификациюИПровести()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.юум_СпецификацияПроработана КАК СпецификацияПроработана
		|ПОМЕСТИТЬ ЗаказыКлиентов
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство2_2.ДокументОснование КАК ДокументОснование,
		|	МИНИМУМ(ЗаказНаПроизводство2_2.Ссылка) КАК Ссылка
		|ПОМЕСТИТЬ ЗаказыНаПроизводство
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
		|ГДЕ
		|	ЗаказНаПроизводство2_2.ДокументОснование В
		|			(ВЫБРАТЬ
		|				ЗаказыКлиентов.Ссылка
		|			ИЗ
		|				ЗаказыКлиентов КАК ЗаказыКлиентов)
		|   И ЗаказНаПроизводство2_2.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПроизводство2_2.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыНаПроизводство.ДокументОснование КАК ДокументОснование,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК НоменклатураЗаказа,
		|	ЗаказНаПроизводство2_2Продукция.Ссылка КАК ЗаказНаПроизводство,
		|	РесурсныеСпецификации.Ссылка КАК РесурснаяСпецификация,
		|	РесурсныеСпецификации.юум_СпецификацияПроработана КАК СпецификацияПроработана
		|ПОМЕСТИТЬ Спецификации
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыНаПроизводство КАК ЗаказыНаПроизводство
		|		ПО ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказыНаПроизводство.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|		ПО ЗаказНаПроизводство2_2Продукция.Спецификация = РесурсныеСпецификации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыКлиентов.Ссылка КАК ЗаказКлиента,
		|	ЗаказыКлиентов.Номенклатура КАК НоменклатураКлиента,
		|	ЗаказыКлиентов.СпецификацияПроработана КАК СпецификацияПроработанаЗаказ,
		|	Спецификации.НоменклатураЗаказа КАК НоменклатураЗаказа,
		|	Спецификации.РесурснаяСпецификация КАК РесурснаяСпецификация,
		|	Спецификации.СпецификацияПроработана КАК СпецификацияПроработана
		|ИЗ
		|	ЗаказыКлиентов КАК ЗаказыКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Спецификации КАК Спецификации
		|		ПО ЗаказыКлиентов.Ссылка = Спецификации.ДокументОснование
		|			И ЗаказыКлиентов.Номенклатура = Спецификации.НоменклатураЗаказа
		|			И (ЗаказыКлиентов.СпецификацияПроработана <> Спецификации.СпецификацияПроработана)
		|ГДЕ НЕ Спецификации.ЗаказНаПроизводство Есть NULL
		|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		 СпецификацияОбъект = Выборка.РесурснаяСпецификация.ПолучитьОбъект();
		 СпецификацияОбъект.юум_СпецификацияПроработана = Выборка.СпецификацияПроработанаЗаказ;
		 СпецификацияОбъект.ОбменДанными.Загрузка = Истина;
		 СпецификацияОбъект.Записать();
		 
	КонецЦикла;
	
КонецПроцедуры
// } #юум

#КонецОбласти

#КонецЕсли
#КонецЕсли