
&НаСервере
Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// #юум {
	// #6.4
	// Добавление новых реквизитов на форму
	// Галфинд Красненков 2026/10/27
	ДобавитьЭлементы();
	// } #юум
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементы()

	// #юум {
	// #6.4
	// Добавление новых реквизитов на форму
	// Галфинд Красненков 2026/10/27
	НовЭлемент = Элементы.Вставить("юум_ЧерныйВес", Тип("ПолеФормы"), 
		Элементы.ГруппаОдноИзделие, Элементы.ГруппаРемонтируемоеИзделие);
	НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовЭлемент.ПутьКДанным = "Объект.юум_ЧерныйВес";
	
	НовЭлемент = Элементы.Вставить("юум_ЗаказНаПроизводство", Тип("ПолеФормы"), 
		Элементы.ГруппаДополнительноПраво);
	НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовЭлемент.ТолькоПросмотр = Истина; 
	НовЭлемент.Заголовок = "АОН";
	НовЭлемент.ПутьКДанным = "Объект.юум_ЗаказНаПроизводство";
	// } #юум
	
	// #юум {
	// #04.02.01.02.01
	// Добавление новых реквизитов на форму
	// Галфинд Домнышева 2026/10/27
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ПараметрыГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
	ПараметрыГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	
	юум_РаботаСФормой.СоздатьГруппуФормы(Элементы, "юум_ГруппаГотовности", , ВидГруппыФормы.ОбычнаяГруппа, 
						Элементы["ГруппаШапка"], , ПараметрыГруппы);
						
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	юум_РаботаСФормой.СоздатьПолеФормы(Элементы, "юум_СпецификацияПроработана", "Спецификация проработана", 
						"Объект.юум_СпецификацияПроработана", ВидПоляФормы.ПолеФлажка, Элементы["юум_ГруппаГотовности"], , ПараметрыЭлемента);
	// } #юум 
КонецПроцедуры

