
&НаСервере
Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	юум_РаботаСФормой.ДобавитьКоманду(ЭтотОбъект, "юум_ЗаполнитьРезервыМПЗ_Расходы", НСтр("ru = 'Заполнить резервы МПЗ'"), 
	"юум_ЗаполнитьРезервыМПЗ_Расходы");
	юум_РаботаСФормой.ДобавитьКоманду(ЭтотОбъект, "юум_ЗаполнитьРезервыМПЗ_Доходы", НСтр("ru = 'Заполнить резервы МПЗ'"), 
	"юум_ЗаполнитьРезервыМПЗ_Доходы");
	
	юум_РаботаСФормой.СоздатьКнопкуФормы(Элементы, "юум_ЗаполнитьРезервыМПЗ_Расходы", , 
		"юум_ЗаполнитьРезервыМПЗ_Расходы", , Элементы.ПрочиеРасходыГруппаЗаполнить);
	юум_РаботаСФормой.СоздатьКнопкуФормы(Элементы, "юум_ЗаполнитьРезервыМПЗ_Доходы", ,  
		"юум_ЗаполнитьРезервыМПЗ_Доходы", , Элементы.ПрочиеДоходыГруппаЗаполнить);

КонецПроцедуры

&НаСервере
Процедура юум_ПриЧтенииНаСервереПеред(ТекущийОбъект) 
	Если ЗначениеЗаполнено(ТекущийОбъект.ХозяйственнаяОперация) Тогда
		// без заполнения этого реквизита некорректно выполняется пр-ра ЗаполнитьРеквизитыВТабличнойЧасти
		ЭтоРасходы = ЭтоРасходы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура юум_ЗаполнитьРезервыМПЗ_Расходы(Команда)
	ЗагрузитьРезервыМПЗ(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура юум_ЗаполнитьРезервыМПЗ_Доходы(Команда)
	ЗагрузитьРезервыМПЗ(Истина);
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьРезервыМПЗ(ЭтоДоходы) 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоДоходы", ЭтоДоходы);
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ПрочиеДоходыРасходы.Форма.юум_ФормаЗагрузкаИзExcel",
		ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ЗагрузитьРезервыМПЗПоАдресу(Результат);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезервыМПЗПоАдресу(Результат)
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ТабРезультат = ПолучитьИзВременногоХранилища(Результат.Адрес); 
	Если Результат.ЭтоДоходы Тогда
		Приемник = Объект.ПрочиеДоходы;  
		ЭлементСтатьяРасходовДоходов = Элементы.ПрочиеДоходыСтатьяДоходов;
		ЭлементСтатьяАктивовПассивов = Элементы.ДоходыСтатьяАктивовПассивов;
	Иначе	                                                                          
		Приемник = Объект.ПрочиеРасходы;                                                   
		//ЭлементСтатьяРасходовДоходов = Элементы.ПрочиеРасходыСтатьяРасходов;
		ЭлементСтатьяРасходовДоходов = Элементы.СтатьяРасходовБезРазбиения;
		ЭлементСтатьяАктивовПассивов = Элементы.РасходыСтатьяАктивовПассивов;
	КонецЕсли;
	Приемник.Очистить();
	Для каждого СтрокаЗагрузки Из ТабРезультат Цикл
	    Строка = Приемник.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаЗагрузки);

		ИДСтроки = Строка.ПолучитьИдентификатор(); 
		ИндексСтроки = Строка.НомерСтроки - 1;
		Если Результат.ЭтоДоходы Тогда
			Строка.СтатьяДоходов = Результат.СтатьяДоходов;
		Иначе	
			Строка.СтатьяРасходов = Результат.СтатьяРасходов;
		КонецЕсли;
		//ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, ЭлементСтатьяРасходовДоходов, ИндексСтроки);
		//ЗаполнитьРеквизитыВТабличнойЧасти(ИДСтроки);  
		
		Строка.СтатьяАктивовПассивов = Результат.СтатьяАктивовПассивов;
		//ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, ЭлементСтатьяАктивовПассивов, ИндексСтроки);
		Строка.НастройкаСчетовУчета = НайтиСоздатьНастройкуСчетов(СтрокаЗагрузки.СчетУчета, СтрокаЗагрузки.Номенклатура, СтрокаЗагрузки.Склад);
		Строка.ПредставлениеОтраженияВРеглУчете = Строка(Строка.НастройкаСчетовУчета);
		Если НЕ Результат.ЭтоДоходы Тогда
			Строка.СуммаБезНДС = Строка.Сумма;
		КонецЕсли;
		Строка.СуммаРегл = Строка.Сумма;
		Строка.СуммаУпр = Строка.Сумма;
		Строка.ВременнаяРазница = Строка.Сумма;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры   

Функция НайтиСоздатьНастройкуСчетов(СчетУчета, Номенклатура, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиСчетовУчетаПрочихОпераций.Ссылка КАК Ссылка,
	|	НастройкиСчетовУчетаПрочихОпераций.СчетУчета КАК СчетУчета,
	|	НастройкиСчетовУчетаПрочихОпераций.Субконто1 КАК Субконто1,
	|	НастройкиСчетовУчетаПрочихОпераций.Субконто2 КАК Субконто2,
	|	НастройкиСчетовУчетаПрочихОпераций.ВладелецНастройки КАК ВладелецНастройки
	|ИЗ
	|	Справочник.НастройкиСчетовУчетаПрочихОпераций КАК НастройкиСчетовУчетаПрочихОпераций
	|ГДЕ
	|	НастройкиСчетовУчетаПрочихОпераций.Субконто1 = &Номенклатура
	|	И НастройкиСчетовУчетаПрочихОпераций.Субконто2 = &Склад
	|	И НастройкиСчетовУчетаПрочихОпераций.СчетУчета = &СчетУчета
	|	И НастройкиСчетовУчетаПрочихОпераций.ВладелецНастройки = &ДокументСсылка
	|	И НЕ НастройкиСчетовУчетаПрочихОпераций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СчетУчета", СчетУчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	 
	НастройкаОбъект = Справочники.НастройкиСчетовУчетаПрочихОпераций.СоздатьЭлемент();
	НастройкаОбъект.ВладелецНастройки = Объект.Ссылка;
    НастройкаОбъект.СчетУчета = СчетУчета;
    НастройкаОбъект.Субконто1 = Номенклатура;
    НастройкаОбъект.Субконто2 = Склад; 

	МассивПолей = Новый Массив;
	МассивПолей.Добавить(Строка(СчетУчета));
	МассивПолей.Добавить(Строка(Номенклатура));
	МассивПолей.Добавить(Строка(Склад));
	НастройкаОбъект.Наименование = СтрСоединить(МассивПолей, ", ");
	НастройкаОбъект.ОбменДанными.Загрузка = Истина;
	НастройкаОбъект.Записать();
	
	Возврат НастройкаОбъект.Ссылка;
	
КонецФункции // ()
