#Область ОбработчикиСобытийФормы
// #юум {
// #02.02.01
// Установка недоступности реквизита формы "СверхЛимита" для пользователей, у которых нет роли "юум_СозданиеСверхлимитныхЗаявок"
// Галфинд AMotorin 2026/09/17
&НаСервере
&После("ПриСозданииНаСервере")
Процедура юумПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Пользователи.РолиДоступны("юум_СозданиеСверхлимитныхЗаявок") = Ложь Тогда
		Элементы.СверхЛимита.Доступность = Ложь;
	КонецЕсли;
			
КонецПроцедуры // } #юум 
#КонецОбласти