
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура юум_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.НастройкаСчетовУчета) Тогда 
		ЗаполнитьФормуПоДаннымСправочника(Параметры); 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьФормуПоДаннымСправочника(Параметры) 
	ТекущийЭлементНастройки = Параметры.НастройкаСчетовУчета;
	КонтекстНастройки = Параметры.КонтекстНастройки;
	Если ЗначениеЗаполнено(КонтекстНастройки.СтатьяАктивовПассивов) Тогда
	    СтатьяАктивовПассивов = КонтекстНастройки.СтатьяАктивовПассивов;
		СтатьяАктивовПассивовПриИзмененииНаСервере();
		// Выбор статей и аналитик.
		ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, Элементы.СтатьяАктивовПассивов);
	КонецЕсли;
	СчетУчетаСправочника = ТекущийЭлементНастройки.СчетУчета;
    Если ЗначениеЗаполнено(СчетУчетаСправочника) Тогда
	    СчетУчета = СчетУчетаСправочника;
		СчетУчетаПриИзмененииСервер(); 
		Субконто1 = ТекущийЭлементНастройки.Субконто1;
		Субконто2 = ТекущийЭлементНастройки.Субконто2;
		Субконто3 = ТекущийЭлементНастройки.Субконто3;
	КонецЕсли; 

КонецПроцедуры
#КонецОбласти
