
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.юум_ЗагрузкаВРЦПоИзделиямИЭтапам);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ загрузки видов рабочих центров по графику производства.';
									|en = 'Analysis of load of work center types by production schedule.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "юум_ЗагрузкаВРЦПоИзделиямИЭтапам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Показывает какой заказ, изделие, узел, деталь и этап формируют занятость видов рабочих центров.';
									|en = 'Shows order, product, assembly, part, and stage contributing to the load of work center types.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
