&ИзменениеИКонтроль("ИнициализироватьГрафикПоИсполнителям")
Функция юум_ИнициализироватьГрафикПоИсполнителям()
	
	ТипыИсполнителей = Новый Массив;
	ТипыИсполнителей.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ТипыИсполнителей.Добавить(Тип("СправочникСсылка.ВидыРабочихЦентров"));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Исполнитель", Новый ОписаниеТипов(ТипыИсполнителей));
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Начало", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("Окончание", Новый ОписаниеТипов("Дата"));
	#Вставка 
	Результат.Колонки.Добавить("КлючПартия", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Результат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ВидСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Запланировано", Новый ОписаниеТипов("Число"));
	#КонецВставки
	
	Возврат Результат;                                 
	
КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаГрафикПоВидамРЦ")
Функция уюм_ТекстЗапросаГрафикПоВидамРЦ(СтатусГрафика)
	
	Результат = "
		|ВЫБРАТЬ
		|	Расписание.ГрафикРаботы КАК Смена,
		|	МИНИМУМ(ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, МИНУТА,
		|		ЧАС(ЕСТЬNULL(Расписание.ВремяНачала, ДАТАВРЕМЯ(1, 1, 1)))*60
		|		+ МИНУТА(ЕСТЬNULL(Расписание.ВремяНачала, ДАТАВРЕМЯ(1, 1, 1))))) КАК Начало,
		|	МАКСИМУМ(
		|		ВЫБОР
		|			КОГДА Расписание.ВремяОкончания ЕСТЬ NULL 
		|				ИЛИ Расписание.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, ДЕНЬ, 1)
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, МИНУТА,
		|				ЧАС(Расписание.ВремяОкончания)*60 + МИНУТА(Расписание.ВремяОкончания))
		|		КОНЕЦ) КАК Окончание
		|ПОМЕСТИТЬ ВТИнтервалыСмен
		|ИЗ
		|	ВТРасписанияРаботы КАК Расписание
		|
		|СГРУППИРОВАТЬ ПО
		|	Расписание.ГрафикРаботы,
		|	Расписание.Период";
	
	Результат = Результат + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Если СтатусГрафика = РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик() Тогда
		
		Результат = Результат +
		"ВЫБРАТЬ
		|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра КАК Исполнитель,
		|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра.Представление КАК Представление,
		#Вставка 
		|	ДоступностьВидовРабочихЦентров.КлючПартия КАК КлючПартия,
		#КонецВставки
		|	ДоступностьВидовРабочихЦентров.ДатаИнтервала КАК Начало,
		|	ВЫБОР ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, ЧАС)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.День)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, ДЕНЬ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Неделя)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, НЕДЕЛЯ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Месяц)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, МЕСЯЦ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
		|			ТОГДА ИнтервалыСмен.Окончание
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, ДЕНЬ)
		|	КОНЕЦ КАК Окончание
		|ИЗ
		|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнтервалыСмен КАК ИнтервалыСмен
		|		ПО ИнтервалыСмен.Смена = ДоступностьВидовРабочихЦентров.Смена
		|		И ИнтервалыСмен.Начало = ДоступностьВидовРабочихЦентров.ДатаИнтервала
		|ГДЕ
		|	ДоступностьВидовРабочихЦентров.Распоряжение = &ЗаказНаПроизводство
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра,
		#Вставка 
		|	ДоступностьВидовРабочихЦентров.КлючПартия,
		#КонецВставки
		|	ДоступностьВидовРабочихЦентров.ДатаИнтервала,
		|	ИнтервалыСмен.Окончание
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДоступностьВидовРабочихЦентров.Занято) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Исполнитель,
		|	Начало,
		|	Окончание
		|ИТОГИ
		|	МИНИМУМ(Начало),
		|	МАКСИМУМ(Окончание)
		|ПО
		|	ОБЩИЕ,
		#Удаление 
		|	Исполнитель";
		#КонецУдаления
		#Вставка 
		|	Исполнитель,
		|	КлючПартия";
		#КонецВставки
		
	Иначе
		
		Результат = Результат +
		"ВЫБРАТЬ
		|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра КАК Исполнитель,
		|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра.Представление КАК Представление,
		#Вставка 
		|	ДоступностьВидовРабочихЦентров.КлючПартия КАК КлючПартия,
		#КонецВставки
		|	ДоступностьВидовРабочихЦентров.ДатаИнтервала КАК Начало,
		|	ВЫБОР ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, ЧАС)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.День)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, ДЕНЬ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Неделя)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, НЕДЕЛЯ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Месяц)
		|			ТОГДА КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, МЕСЯЦ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
		|			ТОГДА ИнтервалыСмен.Окончание
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДоступностьВидовРабочихЦентров.ДатаИнтервала, ДЕНЬ)
		|	КОНЕЦ КАК Окончание
		|ИЗ
		|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнтервалыСмен КАК ИнтервалыСмен
		|		ПО ИнтервалыСмен.Смена = ДоступностьВидовРабочихЦентров.Смена
		|		И ИнтервалыСмен.Начало = ДоступностьВидовРабочихЦентров.ДатаИнтервала
		|ГДЕ
		|	ДоступностьВидовРабочихЦентров.Распоряжение = &ЗаказНаПроизводство
		|	И НЕ (ДоступностьВидовРабочихЦентров.Этап, ДоступностьВидовРабочихЦентров.КлючПартия) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ПланированиеЗагрузки.Этап,
		|					ПланированиеЗагрузки.КлючПартия
		|				ИЗ
		|					РегистрСведений.ПланированиеЗагрузкиВидовРабочихЦентров КАК ПланированиеЗагрузки
		|				ГДЕ
		|					ПланированиеЗагрузки.Распоряжение = &ЗаказНаПроизводство
		|					И ПланированиеЗагрузки.СтатусГрафика = &СтатусГрафика)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра,
		#Вставка 
		|	ДоступностьВидовРабочихЦентров.КлючПартия КАК КлючПартия,
		#КонецВставки
		|	ДоступностьВидовРабочихЦентров.ДатаИнтервала,
		|	ИнтервалыСмен.Окончание
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДоступностьВидовРабочихЦентров.Занято) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланированиеЗагрузки.ВидРабочегоЦентра,
		|	ПланированиеЗагрузки.ВидРабочегоЦентра.Представление,
		#Вставка 
		|	ПланированиеЗагрузки.КлючПартия КАК КлючПартия,
		#КонецВставки
		|	ПланированиеЗагрузки.ДатаИнтервала,
		|	ВЫБОР ПланированиеЗагрузки.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
		|			ТОГДА КОНЕЦПЕРИОДА(ПланированиеЗагрузки.ДатаИнтервала, ЧАС)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.День)
		|			ТОГДА КОНЕЦПЕРИОДА(ПланированиеЗагрузки.ДатаИнтервала, ДЕНЬ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Неделя)
		|			ТОГДА КОНЕЦПЕРИОДА(ПланированиеЗагрузки.ДатаИнтервала, НЕДЕЛЯ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Месяц)
		|			ТОГДА КОНЕЦПЕРИОДА(ПланированиеЗагрузки.ДатаИнтервала, МЕСЯЦ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
		|			ТОГДА ИнтервалыСмен.Окончание
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ПланированиеЗагрузки.ДатаИнтервала, ДЕНЬ)
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ПланированиеЗагрузкиВидовРабочихЦентров КАК ПланированиеЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнтервалыСмен КАК ИнтервалыСмен
		|		ПО ИнтервалыСмен.Смена = ПланированиеЗагрузки.Смена
		|		И ИнтервалыСмен.Начало = ПланированиеЗагрузки.ДатаИнтервала
		|ГДЕ
		|	ПланированиеЗагрузки.Распоряжение = &ЗаказНаПроизводство
		|	И ПланированиеЗагрузки.СтатусГрафика = &СтатусГрафика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Исполнитель,
		|	Начало,
		|	Окончание
		|ИТОГИ
		|	МИНИМУМ(Начало),
		|	МАКСИМУМ(Окончание)
		|ПО
		|	ОБЩИЕ,
		#Удаление 
		|	Исполнитель";
		#КонецУдаления
		#Вставка 
		|	Исполнитель,
		|	КлючПартия";
		#КонецВставки
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаГрафикПоПодразделениям")
Функция юум_ТекстЗапросаГрафикПоПодразделениям(СтатусГрафика)
	
	Если СтатусГрафика = РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик() Тогда
		
		Результат = 
		"ВЫБРАТЬ
		|	ГрафикЭтаповПроизводства2_2.Этап.Подразделение КАК Исполнитель,
		|	ГрафикЭтаповПроизводства2_2.Этап.Подразделение.Представление КАК Представление,
		#Вставка 
		|	ГрафикЭтаповПроизводства2_2.КлючПартия КАК КлючПартия,
		#КонецВставки
		|	ГрафикЭтаповПроизводства2_2.Начало КАК Начало,
		|	ГрафикЭтаповПроизводства2_2.Окончание КАК Окончание
		|ИЗ
		|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
		|ГДЕ
		|	ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|	И ГрафикЭтаповПроизводства2_2.СтатусГрафика = &СтатусГрафика
		|	И НЕ ГрафикЭтаповПроизводства2_2.Этап В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Исполнитель,
		|	Начало,
		|	Окончание
		|ИТОГИ
		|	МИНИМУМ(Начало),
		|	МАКСИМУМ(Окончание)
		|ПО
		|	ОБЩИЕ,
		#Удаление 
		|	Исполнитель";
		#КонецУдаления
		#Вставка 
		|	Исполнитель,
		|	КлючПартия";
		#КонецВставки
		
	Иначе
		
		Результат =
		"ВЫБРАТЬ
		|	ГрафикЭтаповПроизводства2_2.Этап.Подразделение КАК Исполнитель,
		|	ГрафикЭтаповПроизводства2_2.Этап.Подразделение.Представление КАК Представление,
		#Вставка 
		|	ГрафикЭтаповПроизводства2_2.КлючПартия КАК КлючПартия,
		#КонецВставки
		|	ГрафикЭтаповПроизводства2_2.Начало КАК Начало,
		|	ГрафикЭтаповПроизводства2_2.Окончание КАК Окончание
		|ИЗ
		|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
		|ГДЕ
		|	ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|	И ГрафикЭтаповПроизводства2_2.СтатусГрафика = &СтатусГрафика
		|	И НЕ ГрафикЭтаповПроизводства2_2.Этап В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикЭтаповПроизводства2_2.Этап.Подразделение,
		|	ГрафикЭтаповПроизводства2_2.Этап.Подразделение.Представление,
		#Вставка 
		|	ГрафикЭтаповПроизводства2_2.КлючПартия,
		#КонецВставки
		|	ГрафикЭтаповПроизводства2_2.Начало,
		|	ГрафикЭтаповПроизводства2_2.Окончание
		|ИЗ
		|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
		|ГДЕ
		|	ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|	И ГрафикЭтаповПроизводства2_2.СтатусГрафика = &СтатусРабочийГрафик
		|	И НЕ (ГрафикЭтаповПроизводства2_2.Этап, ГрафикЭтаповПроизводства2_2.КлючПартия) В
		|				(ВЫБРАТЬ
		|					ДД.Этап,
		|					ДД.КлючПартия
		|				ИЗ
		|					РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ДД
		|				ГДЕ
		|					ДД.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|					И ДД.СтатусГрафика = &СтатусГрафика)
		|	И НЕ ГрафикЭтаповПроизводства2_2.Этап В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Исполнитель,
		|	Начало,
		|	Окончание
		|ИТОГИ
		|	МИНИМУМ(Начало),
		|	МАКСИМУМ(Окончание)
		|ПО
		|	ОБЩИЕ,
		#Удаление 
		|	Исполнитель";
		#КонецУдаления
		#Вставка 
		|	Исполнитель,
		|	КлючПартия";
		#КонецВставки
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&Вместо("ГрафикПоИсполнителям")
Функция юум_ГрафикПоИсполнителям(ЗаказНаПроизводство, РежимОтображения, СтатусГрафика, Границы)
	
	Результат = ИнициализироватьГрафикПоИсполнителям();
	
	Запрос = ИнициализироватьЗапросПоИсполнителям(ЗаказНаПроизводство, РежимОтображения, СтатусГрафика); 
	
	ВыборкаПоПартиямПродукции = юум_ПолучитьДанныеПоПартиямПродукции(ЗаказНаПроизводство, РежимОтображения = РежимПоПодразделениям());
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаИтоги.Следующий() Тогда       // общие
		
		ЗаполнитьЗначенияСвойств(Границы, ВыборкаИтоги);
		
		ВыборкаИсполнитель = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИсполнитель.Следующий() Цикл
			
			ПредыдущаяСтрока = Неопределено;
			
			Выборка = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				
				Если ПредыдущаяСтрока = Неопределено
					ИЛИ (ПредыдущаяСтрока.Окончание + 1) < Выборка.Начало Тогда
					
					НоваяСтрока = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
					НоваяСтрока.Уровень = 1;
					
					ПредыдущаяСтрока = НоваяСтрока;
					
				Иначе
					
					ПредыдущаяСтрока.Окончание = Макс(ПредыдущаяСтрока.Окончание, Выборка.Окончание);
					
				КонецЕсли; 
				ВыборкаПоПартиям = Выборка.Выбрать();
				ПредыдущаяСтрокаПартий = Неопределено;
				Пока ВыборкаПоПартиям.Следующий()  Цикл
					ВыборкаПоПартиямПродукции.Сбросить();
					СтруктураОтбора = Новый Структура("Исполнитель, КлючПартия",
							Выборка.Исполнитель, ВыборкаПоПартиям.КлючПартия);  
					Пока ВыборкаПоПартиямПродукции.НайтиСледующий(СтруктураОтбора)  Цикл
						Если ПредыдущаяСтрокаПартий = Неопределено
							ИЛИ (ПредыдущаяСтрокаПартий.Окончание + 1) < ВыборкаПоПартиямПродукции.Начало Тогда
							
							НоваяСтрока = Результат.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоПартиямПродукции); 
							НоваяСтрока.Уровень = 2;
							
							ПредыдущаяСтрокаПартий = НоваяСтрока;
							
						Иначе
							
							ПредыдущаяСтрокаПартий.Окончание = 
								Макс(ПредыдущаяСтрокаПартий.Окончание, ВыборкаПоПартиямПродукции.Окончание);
							
						КонецЕсли; 
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция юум_ПолучитьДанныеПоПартиямПродукции(ЗаказНаПроизводство, ПоПодразделениям)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ПоПодразделениям
	|			ТОГДА ДоступностьВидовРабочихЦентров.Подразделение
	|		ИНАЧЕ ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра
	|	КОНЕЦ КАК Исполнитель,
	|	ДоступностьВидовРабочихЦентров.КлючПартия КАК КлючПартия,
	|	МИНИМУМ(ДоступностьВидовРабочихЦентров.ДатаИнтервала) КАК Начало,
	|	МАКСИМУМ(ДоступностьВидовРабочихЦентров.ДатаИнтервала) КАК Окончание
	|ПОМЕСТИТЬ ИнтервалыПартий
	|ИЗ
	|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
	|ГДЕ
	|	ДоступностьВидовРабочихЦентров.Распоряжение = &ЗаказНаПроизводство
	|	И ДоступностьВидовРабочихЦентров.Активность = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступностьВидовРабочихЦентров.КлючПартия,
	|	ВЫБОР
	|		КОГДА &ПоПодразделениям
	|			ТОГДА ДоступностьВидовРабочихЦентров.Подразделение
	|		ИНАЧЕ ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураЗаказа.Номенклатура КАК Номенклатура,
	|	СтруктураЗаказа.КлючПартия КАК КлючПартия,
	|	ИнтервалыПартий.Начало КАК Начало,
	|	ИнтервалыПартий.Окончание КАК Окончание,
	|	СУММА(СтруктураЗаказа.Запланировано) КАК Запланировано,
	|	ИнтервалыПартий.Исполнитель КАК Исполнитель,
	|	СтруктураЗаказа.ВидСтроки КАК ВидСтроки
	|ПОМЕСТИТЬ ДанныеПоНоменклатуре
	|ИЗ
	|	РегистрСведений.СтруктураЗаказа КАК СтруктураЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИнтервалыПартий КАК ИнтервалыПартий
	|		ПО СтруктураЗаказа.КлючПартия = ИнтервалыПартий.КлючПартия
	|ГДЕ
	|	СтруктураЗаказа.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И СтруктураЗаказа.ВидСтроки В(&ВидыСтрокПроизводство)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтруктураЗаказа.Номенклатура,
	|	СтруктураЗаказа.КлючПартия,
	|	ИнтервалыПартий.Начало,
	|	ИнтервалыПартий.Окончание,
	|	ИнтервалыПартий.Исполнитель,
	|	СтруктураЗаказа.ВидСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоНоменклатуре.Исполнитель КАК Исполнитель,
	|	ДанныеПоНоменклатуре.Номенклатура КАК Номенклатура,
	|	ДанныеПоНоменклатуре.КлючПартия КАК КлючПартия,
	|	НАЧАЛОПЕРИОДА(ДанныеПоНоменклатуре.Начало, ДЕНЬ) КАК Начало,
	|	КОНЕЦПЕРИОДА(ДанныеПоНоменклатуре.Окончание, ДЕНЬ) КАК Окончание,
	|	ДанныеПоНоменклатуре.Запланировано КАК Запланировано,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеПоНоменклатуре.Номенклатура) КАК Представление,
	|	ВЫБОР
	|		КОГДА ДанныеПоНоменклатуре.ВидСтроки = &ВидСтрокиПроизводствоГП
	|			ТОГДА ""ГП""
	|		КОГДА ДанныеПоНоменклатуре.ВидСтроки = &ВидСтрокиПроизводствоПФ
	|			ТОГДА ""ПФ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидСтроки,
	|	СпрНоменклатура.Код КАК Код
	|ИЗ
	|	ДанныеПоНоменклатуре КАК ДанныеПоНоменклатуре
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ДанныеПоНоменклатуре.Номенклатура = СпрНоменклатура.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Начало";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);  
	Запрос.УстановитьПараметр("ПоПодразделениям", ПоПодразделениям); 
	ВидСтрокиПроизводствоГП = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции;
	ВидСтрокиПроизводствоПФ = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката;
	ВидыСтрокПроизводство = Новый Массив; 
	ВидыСтрокПроизводство.Добавить(ВидСтрокиПроизводствоГП);
	ВидыСтрокПроизводство.Добавить(ВидСтрокиПроизводствоПФ);
	Запрос.УстановитьПараметр("ВидСтрокиПроизводствоГП", ВидСтрокиПроизводствоГП);
	Запрос.УстановитьПараметр("ВидСтрокиПроизводствоПФ", ВидСтрокиПроизводствоПФ);
	Запрос.УстановитьПараметр("ВидыСтрокПроизводство", ВидыСтрокПроизводство);
	
    Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
КонецФункции // ()

&Вместо("СформироватьОтчетПоИсполнителям")
Процедура юум_СформироватьОтчетПоИсполнителям(ДиаграммаГанта, ЗаказНаПроизводство, РежимОтображения, СтатусГрафика, Границы)
	
	ДиаграммаГанта.Обновление = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	График = ГрафикПоИсполнителям(ЗаказНаПроизводство, РежимОтображения, СтатусГрафика, Границы);
	УстановитьПривилегированныйРежим(Ложь);
	
	Серия = ДиаграммаГанта.УстановитьСерию("ГрафикПроизводства");   
	ШаблонПредставлениеНоменклатуры = "%1, %2 (%3 план %4)";
	
	Исполнитель = Неопределено;
	СтрокиУровень1 = График.НайтиСтроки(Новый Структура("Уровень", 1)); 
	Для каждого Строка Из СтрокиУровень1 Цикл  
		
		Если Исполнитель = Неопределено
			ИЛИ НЕ Исполнитель = Строка.Исполнитель Тогда
			
			Точка = УстановитьТочкуИсполнитель(ДиаграммаГанта, Строка);
			Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
			ТочкиУровень2 = Точка.Точки; 
		КонецЕсли;
  		ДобавитьИнтервалИсполнитель(Значение, Строка);
			
		СтруктураОтбора2 = Новый Структура("Уровень, Исполнитель, КлючПартия", 2, Строка.Исполнитель, Строка.КлючПартия);
		СтрокиУровень2 = График.НайтиСтроки(СтруктураОтбора2);  
		НоменклатураПредставление = Неопределено;
		Для каждого СтрокаПартии Из СтрокиУровень2 Цикл 
			СтрокаПлан = Формат(СтрокаПартии.Запланировано, "ЧДЦ=3");
			ПредставлениеСтроки = СтрШаблон(ШаблонПредставлениеНоменклатуры, 
				СокрЛП(СтрокаПартии.Код), СтрокаПартии.Представление, СтрокаПартии.ВидСтроки, СтрокаПлан);
			Если НоменклатураПредставление = Неопределено
				ИЛИ НЕ НоменклатураПредставление = ПредставлениеСтроки Тогда 
				ТочкаУровень2 = ТочкиУровень2.Добавить();
				ТочкаУровень2.Текст = ПредставлениеСтроки;
				ТочкаУровень2.Расшифровка = СтрокаПартии.Номенклатура;
				
				ЗначениеУровень2 = ДиаграммаГанта.ПолучитьЗначение(ТочкаУровень2, Серия);
				ДобавитьИнтервалИсполнитель(ЗначениеУровень2, СтрокаПартии);
			КонецЕсли;
		КонецЦикла;
		Исполнитель = Строка.Исполнитель;
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Ложь;
	
КонецПроцедуры
