

Функция ПолучитьЗапрещенныеДействияНадОбъектом(Знач Пользователь, ВидОбъекта, ИмяОбъекта, Префикс, ВидНоменклатуры = Неопределено) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(истина);
		
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("Префикс", Префикс);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи) КАК Ссылка
	|ПОМЕСТИТЬ втГруппыПользователей
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Ссылка
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЗапрещенныеОбъекты.ЗапрещеноДобавлениеНовых КАК ЗапрещеноДобавлениеНовых,
	|	тЗапрещенныеОбъекты.ЗапрещеноИзменениеСуществующих КАК ЗапрещеноИзменениеСуществующих,
	|	тЗапрещенныеОбъекты.РазрешеноДляНекорректнойНоменклатуры КАК РазрешеноДляНекорректнойНоменклатуры
	|ИЗ
	|	втГруппыПользователей КАК втГруппыПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.юум_ЗапрещенныеДляРучногоИзмененияОбъекты КАК тЗапрещенныеОбъекты
	|		ПО втГруппыПользователей.Ссылка = тЗапрещенныеОбъекты.Пользователь
	|			И (тЗапрещенныеОбъекты.ВидОбъекта = &ВидОбъекта)
	|ГДЕ
	|	тЗапрещенныеОбъекты.ИмяОбъекта В (&ИмяОбъекта, """")
	|	И тЗапрещенныеОбъекты.Префикс В (&Префикс, """")
	|	И тЗапрещенныеОбъекты.ВидНоменклатуры = &ВидНоменклатуры";
	
	Струк = новый Структура("ЗапрещеноДобавлениеНовых, ЗапрещеноИзменениеСуществующих, РазрешеноДляНекорректнойНоменклатуры", ложь, ложь, ложь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для каждого Элем из Струк Цикл
			Струк[Элем.Ключ] = Струк[Элем.Ключ] или Выборка[Элем.Ключ];
		КонецЦикла;
	КонецЦикла;
	
	Возврат Струк;
КонецФункции

Функция ПолучитьРазрешенныеРеквизитыОбъекта(Знач Пользователь, ВидОбъекта, ИмяОбъекта, Префикс, ВидНоменклатуры = Неопределено) Экспорт
	
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(истина);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("Префикс", Префикс);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи) КАК Ссылка
	|ПОМЕСТИТЬ втГруппыПользователей
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Ссылка
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тРазрешенныеРеквизиты.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	тРазрешенныеРеквизиты.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	втГруппыПользователей КАК втГруппыПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.юум_РазрешенныеРеквизитыЗапрещенныхОбъектов КАК тРазрешенныеРеквизиты
	|		ПО втГруппыПользователей.Ссылка = тРазрешенныеРеквизиты.Пользователь
	|			И (тРазрешенныеРеквизиты.ВидОбъекта = &ВидОбъекта)
	|ГДЕ
	|	тРазрешенныеРеквизиты.ИмяОбъекта В (&ИмяОбъекта, """")
	|	И тРазрешенныеРеквизиты.Префикс В (&Префикс, """")
	|	И тРазрешенныеРеквизиты.ВидНоменклатуры = &ВидНоменклатуры";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция вПроверитьИзменениеРеквизитовОбъекта(Источник, ВидОбъекта, ИмяОбъекта, ТабРазрешенныеРеквизиты)
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 *
	|ИЗ
	|	" + ВидОбъекта+"."+ИмяОбъекта + " КАК тДанныеОбъекта
	|ГДЕ тДанныеОбъекта.Ссылка = &Ссылка";
	
	ТабДанные = Запрос.Выполнить().Выгрузить();
	Если ТабДанные.Количество() <> 1 Тогда
		Возврат "";
	КонецЕсли;
	
	ТабРазрешенныеРеквизиты.Индексы.Добавить("ИмяТабличнойЧасти, ИмяРеквизита");
	
	СтрукПоиск = новый Структура;
	
	пСпецКолонки = новый Соответствие;
	пСпецКолонки.Вставить("Ссылка", 1);
	пСпецКолонки.Вставить("ВерсияДанных", 1);
	
	пТипТаблицаЗначений = Тип("ТаблицаЗначений");
	пТипХЗ = Тип("ХранилищеЗначения");
	
	пИменаТабличныхЧастей = новый Массив;
	
	
	Для каждого Элем из ТабДанные.Колонки Цикл
		ИмяКолонки = Элем.Имя;
		Если пСпецКолонки[ИмяКолонки] = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элем.ТипЗначения.СодержитТип(пТипХЗ) Тогда
			Продолжить;
		ИначеЕсли Элем.ТипЗначения.СодержитТип(пТипТаблицаЗначений) Тогда
			пИменаТабличныхЧастей.Добавить(ИмяКолонки);
		Иначе
			Если ТабДанные[0][ИмяКолонки] <> Источник[ИмяКолонки] Тогда
				СтрукПоиск.Вставить("ИмяТабличнойЧасти", "");
				СтрукПоиск.Вставить("ИмяРеквизита", ИмяКолонки);
				Если ТабРазрешенныеРеквизиты.НайтиСтроки(СтрукПоиск).Количество() = 0 Тогда
					Возврат "изменен реквизит """ + ИмяКолонки + """!";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	пСпецКолонки = новый Соответствие;
	пСпецКолонки.Вставить("Ссылка", 1);
	пСпецКолонки.Вставить("НомерСтроки", 1);
	
	Для каждого ИмяТЧ из пИменаТабличныхЧастей Цикл
		ТабЧасть1 = ТабДанные[0][ИмяТЧ];
		ТабЧасть2 = Источник[ИмяТЧ];
		Если ТабЧасть1.Количество() <> ТабЧасть2.Количество() Тогда
			Возврат "изменилось количество строк табличной части """ + ИмяТЧ + """!";
		КонецЕсли;
		
		СтрукПоиск.Вставить("ИмяТабличнойЧасти", ИмяТЧ);
		
		Инд = -1;
		Для каждого Стр1 из ТабЧасть1 Цикл
			Инд = Инд + 1;
			Стр2 = ТабЧасть2[Инд];
			
			Для каждого Элем из ТабЧасть1.Колонки Цикл
				ИмяКолонки = Элем.Имя;
				Если пСпецКолонки[ИмяКолонки] = 1 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Стр1[ИмяКолонки] <> Стр2[ИмяКолонки] Тогда
					СтрукПоиск.Вставить("ИмяРеквизита", ИмяКолонки);
					Если ТабРазрешенныеРеквизиты.НайтиСтроки(СтрукПоиск).Количество() = 0 Тогда
						Возврат "изменен реквизит """ + ИмяКолонки + """ в строке " + (Инд+1) + " таблчиной части """ + ИмяТЧ + """!";
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат "";
КонецФункции

Функция вЕстьОсобыйДоступКНоменклатуре(Источник, Знач Пользователь)
	
	МассивОсобыхГрупп = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначениеМассив("ГруппыНоменклатурыСОсобымДоступом_Список");
	Если МассивОсобыхГрупп = Неопределено Тогда
		МассивОсобыхГрупп = Новый Массив;		
	КонецЕсли;
	
	пОсобаяГруппа = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ГруппаНоменклатурыСОсобымДоступом");
	Если ЗначениеЗаполнено(пОсобаяГруппа) Тогда
		МассивОсобыхГрупп.Добавить(пОсобаяГруппа);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивОсобыхГрупп) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//пПользователи = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначениеМассив("ПользователиСОсобымиПравамиДляНоменклатуры_СПИСОК");
	//Если пПользователи.Найти(Пользователь) = Неопределено Тогда
	//	Возврат ложь;
	//КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Источник.Родитель);
	Запрос.УстановитьПараметр("ОсобаяГруппа", МассивОсобыхГрупп);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ОсобаяГруппа)
	|	И Номенклатура.Ссылка = &Родитель";
	
	//Если Источник.Родитель <> пОсобаяГруппа и Запрос.Выполнить().Пустой() Тогда
	Если МассивОсобыхГрупп.Найти(Источник.Родитель) = Неопределено
		И Запрос.Выполнить().Пустой() Тогда	
		Возврат ложь;
	КонецЕсли;
	
	Если не Источник.ЭтоНовый() Тогда
		пСтарыйРодитель = юум_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "Справочник.Номенклатура", "Родитель");
		Запрос.УстановитьПараметр("Родитель", пСтарыйРодитель);
		
		//Если пСтарыйРодитель <> пОсобаяГруппа и Запрос.Выполнить().Пустой() Тогда
		Если МассивОсобыхГрупп.Найти(пСтарыйРодитель) = Неопределено
			И Запрос.Выполнить().Пустой() Тогда	
			Возврат ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат истина;
КонецФункции

Функция вЕстьОсобыйДоступКДоговорамКонтрагентов(Источник, Знач Пользователь)
	
	ВОЗВРАТ ЛОЖЬ;
	
	ЕстьПраво = Ложь;
	
	//1. Право создания и РЕДАКТИРОВАНИЯ спецификаций к договорам кредитов и депозитов
	// vvv Галфинд \ Sakovich 09.02.2022 
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=8114bcee7bda45d711ec89976ea7217e
	Если (Источник.ВидДоговораУХ = Справочники.ВидыДоговоровКонтрагентовУХ.Кредит ИЛИ
		Источник.ВидДоговораУХ = Справочники.ВидыДоговоровКонтрагентовУХ.Депозит) И 
		Источник.ВидСоглашения = Перечисления.ВидыСоглашений.Спецификация Тогда	
		
		Если РольДоступна("ПолныеПрава") ИЛИ 
			РольДоступна("юум_СозданиеДоговоровКредитовДепозитовМНО") ИЛИ 
			УправлениеДоступом.ЕстьРоль("юум_СозданиеДоговоровКредитовДепозитовМНО", ,Пользователь)Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции 

Функция вЕстьОсобыйДоступКДокументамВерсииСоглашенияКредитДепозит(Источник, Знач Пользователь) 
	
	ВОЗВРАТ ЛОЖЬ; 
	
	ЕстьПраво = Ложь;
	
	//1. Право создания и РЕДАКТИРОВАНИЯ спецификаций к договорам кредитов и депозитов (и версий соглашений по ним)
	// vvv Галфинд \ Sakovich 09.02.2022 
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=8114bcee7bda45d711ec89976ea7217e
	Если (Источник.ВидДоговораУХ = Справочники.ВидыДоговоровКонтрагентовУХ.Кредит ИЛИ
		Источник.ВидДоговораУХ = Справочники.ВидыДоговоровКонтрагентовУХ.Депозит) И 
		Источник.ВидСоглашения = Перечисления.ВидыСоглашений.Спецификация Тогда	
		
		Если РольДоступна("ПолныеПрава") ИЛИ 
			РольДоступна("юум_СозданиеДоговоровКредитовДепозитовМНО") ИЛИ 
			УправлениеДоступом.ЕстьРоль("юум_СозданиеДоговоровКредитовДепозитовМНО", ,Пользователь)Тогда
			ЕстьПраво = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции 


#Область События

Процедура ПроверитьЗапретНаИзменениеПередЗаписьюСправочника(Источник, Отказ) Экспорт
	Если Отказ или Источник.ОбменДанными.Загрузка или юум_ОбщегоНазначения.ЕстьПолныеПрава() Тогда
		Возврат;
	КонецЕсли;
	
	ВидОбъекта = "Справочник";
	ИмяОбъекта = Источник.Метаданные().Имя;
	ТекПользователь = юум_ОбщегоНазначенияКлиентСервер.ТекущийПользователь();
	
	ПодВидОбъекта = Неопределено;
	
	Если ИмяОбъекта = "Номенклатура" Тогда
		
		ПодВидОбъекта = Источник.ВидНоменклатуры;
		
		Если вЕстьОсобыйДоступКНоменклатуре(Источник, ТекПользователь) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяОбъекта = "ДоговорыКонтрагентов" Тогда
		Если вЕстьОсобыйДоступКДоговорамКонтрагентов(Источник, ТекПользователь) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	
	Префикс = юум_ОбщегоНазначенияКлиентСервер.ПолучитьПрефиксИзСтроки(Источник.Код, "НЕТ");
	
	СтрукДанные = ПолучитьЗапрещенныеДействияНадОбъектом(ТекПользователь, ВидОбъекта, ИмяОбъекта, Префикс, ПодВидОбъекта);
	
	Если Источник.ЭтоНовый() Тогда
		Если СтрукДанные["ЗапрещеноДобавлениеНовых"] Тогда
			Отказ = истина;
			пТекст = СтрШаблон("Запрещено добавление новых объектов в справочник ""%1"", см. регистр сведений ""Запрещенные для ручного изменения объекты""!", ИмяОбъекта);
			юум_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(пТекст);
		КонецЕсли;
	Иначе
		Если СтрукДанные["ЗапрещеноИзменениеСуществующих"] Тогда
			ТабРазрешенныеРеквизиты = ПолучитьРазрешенныеРеквизитыОбъекта(ТекПользователь, "Справочник", ИмяОбъекта, Префикс);
			
			пЧтоИзменили = вПроверитьИзменениеРеквизитовОбъекта(Источник, ВидОбъекта, ИмяОбъекта, ТабРазрешенныеРеквизиты);
			
			Если не ПустаяСтрока(пЧтоИзменили) Тогда
				Отказ = истина;
				
				пТекст = СтрШаблон(
				"Запрещено изменение объектов справочника ""%1"", см. регистр сведений ""Запрещенные для ручного изменения объекты""!
				|%2
				|(перечень разрешенных реквизитов настраивается в регистре сведений ""Разрешенные реквизиты запрещенных объектов"")"
				, ИмяОбъекта, пЧтоИзменили);
				
				юум_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(пТекст);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗапретНаИзменениеПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ или Источник.ОбменДанными.Загрузка или юум_ОбщегоНазначения.ЕстьПолныеПрава() Тогда
		Возврат;
	КонецЕсли;
	
	ВидОбъекта = "Документ";
	ИмяОбъекта = Источник.Метаданные().Имя;
	ТекПользователь = юум_ОбщегоНазначенияКлиентСервер.ТекущийПользователь();
	Префикс = юум_ОбщегоНазначенияКлиентСервер.ПолучитьПрефиксИзСтроки(Источник.Номер, "НЕТ");
	
	Если ИмяОбъекта = "ВерсияСоглашенияДепозит" ИЛИ ИмяОбъекта = "ВерсияСоглашенияКредит" Тогда
		Если вЕстьОсобыйДоступКДокументамВерсииСоглашенияКредитДепозит(Источник, ТекПользователь) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтрукДанные = ПолучитьЗапрещенныеДействияНадОбъектом(ТекПользователь, ВидОбъекта, ИмяОбъекта, Префикс);
	
	Если Источник.ЭтоНовый() Тогда
		Если СтрукДанные["ЗапрещеноДобавлениеНовых"] Тогда
			Отказ = истина;
			пТекст = СтрШаблон("Запрещено добавление новых документов ""%1"", см. регистр сведений ""Запрещенные для ручного изменения объекты""!", ИмяОбъекта);
			юум_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(пТекст);
		КонецЕсли;
	Иначе
		Если СтрукДанные["ЗапрещеноИзменениеСуществующих"] Тогда
			ТабРазрешенныеРеквизиты = ПолучитьРазрешенныеРеквизитыОбъекта(ТекПользователь, "Документ", ИмяОбъекта, Префикс);
			
			пЧтоИзменили = вПроверитьИзменениеРеквизитовОбъекта(Источник, ВидОбъекта, ИмяОбъекта, ТабРазрешенныеРеквизиты);
			
			Если не ПустаяСтрока(пЧтоИзменили) Тогда
				Отказ = истина;
				
				пТекст = СтрШаблон(
				"Запрещено изменение документов ""%1"", см. регистр сведений ""Запрещенные для ручного изменения объекты""!
				|%2
				|(перечень разрешенных реквизитов настраивается в регистре сведений ""Разрешенные реквизиты запрещенных объектов"")"
				, ИмяОбъекта, пЧтоИзменили);
				
				юум_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(пТекст);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

