
&НаСервере
Процедура ЗагрузитьАктыНаСервере()
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьАкты(НомерЗаказа);
	ОбновитьСессию();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАкты(Команда)

	ЗагрузитьАктыНаСервере();
	ПоказатьОповещениеПользователя("Акты загружены");
	ОбновитьСессию();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСессию()
	
	ДатаИзменения = юум_ОбщегоНазначения.ПолучитьГлобальноеЗначение("ДатаИзмененияАОН");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ГЗ(Ключ)

	Возврат ПланыВидовХарактеристик.юум_ГлобальныеЗначения.НайтиПоРеквизиту("Ключ", Ключ);
	
КонецФункции


&НаКлиенте
Процедура ЗагруженаСессияОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ГЗ("ДатаИзмененияАОН"));

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСессию();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененоГлобальноеЗначение" Тогда
		ОбновитьСессию();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСессию();
КонецПроцедуры

