Функция Поле(RS, Имя)

	п = RS.Fields(Имя);	
	Если п.Type = 200 ИЛИ п.Type = 202 Тогда
		//строка
		Возврат СокрЛП(п.Value);		
	ИначеЕсли п.Type = 139 Тогда		
		// число
		Возврат Формат(п.Value, "ЧГ=0");	
	КонецЕсли;
	
КонецФункции

Функция _ПОДОБНО(Код, Начало)

	Возврат СтрНачинаетсяС(Код, Начало);

КонецФункции 

Функция стрВидНоменклатурыПоКоду(Код) Экспорт
	
//Сырье и материалы
//Топливо
//Тара и тарные Материалы
//Запасные части
//Строительные материалы
//Инвентарь и хозяйственные принадлежности СПИ < 12 мес
//Инвентарь и хозяйственные принадлежности СПИ > 12 мес
//Специальная оснастка СПИ < 12 мес 
//Спецодежда СПИ > 12 мес
//Спецодежда СПИ < 12 мес
//Прочие материалы											
//Готовая продукция, товары, полуфабрикаты

	ТолькоЦифры = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Код);
	
	Если ТолькоЦифры И СтрДлина(Код) = 11 Тогда
		
		Если _ПОДОБНО(Код, "950") Тогда 
			
			Если _ПОДОБНО(Код, "95031") Тогда  
				Возврат "Сырье и материалы";
			Иначе  
				Возврат "Топливо";
			КонецЕсли;
			
		ИначеЕсли	_ПОДОБНО(Код, "91077") 
			ИЛИ		_ПОДОБНО(Код, "91030") 
			ИЛИ 	_ПОДОБНО(Код, "970") 
			Тогда Возврат "Тара и тарные Материалы";
			
		ИначеЕсли 	_ПОДОБНО(Код, "071") 
			Тогда Возврат "Запасные части";

		ИначеЕсли 	_ПОДОБНО(Код, "9310") 
			ИЛИ 	_ПОДОБНО(Код, "9311") 
			ИЛИ 	_ПОДОБНО(Код, "9312") 
			ИЛИ   	_ПОДОБНО(Код, "9313") 
			ИЛИ 	_ПОДОБНО(Код, "9614") 
			Тогда Возврат "Строительные материалы";
	
		ИначеЕсли 	_ПОДОБНО(Код, "91245") 	
			ИЛИ 	_ПОДОБНО(Код, "9315") 
			ИЛИ 	_ПОДОБНО(Код, "9317")
			ИЛИ   	_ПОДОБНО(Код, "054") 	
			ИЛИ 	_ПОДОБНО(Код, "935") 
			ИЛИ 	_ПОДОБНО(Код, "9661")
			ИЛИ 	_ПОДОБНО(Код, "9662") 	
			ИЛИ 	_ПОДОБНО(Код, "9663") 
			ИЛИ 	_ПОДОБНО(Код, "980")
			ИЛИ 	_ПОДОБНО(Код, "01-") 	//??? Не сработает, противоречит условию 11 только цифр
			ИЛИ 	_ПОДОБНО(Код, "02-") 	//???
			ИЛИ 	_ПОДОБНО(Код, "93415") 	
			ИЛИ 	_ПОДОБНО(Код, "085") 
			ИЛИ 	_ПОДОБНО(Код, "648")
			ИЛИ 	_ПОДОБНО(Код, "650")
			ИЛИ 	_ПОДОБНО(Код, "651") 
			ИЛИ 	_ПОДОБНО(Код, "08200")
			ИЛИ 	_ПОДОБНО(Код, "082021")	
			ИЛИ 	_ПОДОБНО(Код, "082023") 
			ИЛИ 	_ПОДОБНО(Код, "082025")
			ИЛИ 	_ПОДОБНО(Код, "08203")  
			Тогда Возврат "Инвентарь и хозяйственные принадлежности СПИ < 12 мес";  
			
	
		ИначеЕсли 	_ПОДОБНО(Код, "0124") 	
			ИЛИ 	_ПОДОБНО(Код, "088092906") 
			ИЛИ 	_ПОДОБНО(Код, "088092907")
			ИЛИ   	_ПОДОБНО(Код, "088092908") 	
			ИЛИ 	_ПОДОБНО(Код, "88092909") 
			ИЛИ 	_ПОДОБНО(Код, "91088")
			ИЛИ 	_ПОДОБНО(Код, "9316")
			ИЛИ 	_ПОДОБНО(Код, "9348")
			ИЛИ 	_ПОДОБНО(Код, "9660")
			ИЛИ 	_ПОДОБНО(Код, "972")
			ИЛИ 	_ПОДОБНО(Код, "00000005")
			ИЛИ 	_ПОДОБНО(Код, "00000006")
			ИЛИ 	_ПОДОБНО(Код, "0122")	
			Тогда Возврат "Инвентарь и хозяйственные принадлежности СПИ > 12 мес"; 

		ИначеЕсли 	_ПОДОБНО(Код, "81") 	
			ИЛИ 	_ПОДОБНО(Код, "82")
			ИЛИ 	_ПОДОБНО(Код, "83")
			ИЛИ 	_ПОДОБНО(Код, "84")
			ИЛИ 	_ПОДОБНО(Код, "85")
			ИЛИ 	_ПОДОБНО(Код, "86")
			ИЛИ 	_ПОДОБНО(Код, "87")
			ИЛИ 	_ПОДОБНО(Код, "88")
			ИЛИ 	_ПОДОБНО(Код, "89")
			ИЛИ 	_ПОДОБНО(Код, "0603")
			ИЛИ 	_ПОДОБНО(Код, "6584")
			ИЛИ 	_ПОДОБНО(Код, "6585")
			ИЛИ 	_ПОДОБНО(Код, "6586")
			Тогда Возврат "Специальная оснастка СПИ < 12 мес"; 

		ИначеЕсли 	_ПОДОБНО(Код, "93426") 	
			ИЛИ 	_ПОДОБНО(Код, "93402")
			Тогда Возврат "Спецодежда СПИ < 12 мес"; 
			
		ИначеЕсли 	_ПОДОБНО(Код, "93425") 	
			Тогда Возврат "Спецодежда СПИ > 12 мес"; 
			
		ИначеЕсли 	_ПОДОБНО(Код, "189") 	
			ИЛИ Код = "80199999901"
			ИЛИ Код = "83160000000"
			ИЛИ Код = "83150000000"
			ИЛИ Код = "83140000000"
			ИЛИ Код = "83027000000"
			ИЛИ Код = "73500820000"
			ИЛИ Код = "91080600010"
			ИЛИ Код = "83102000000"
			ИЛИ Код = "83110000000"
			ИЛИ Код = "83120000000"
			ИЛИ Код = "83121000000"
			ИЛИ Код = "83200000000"
			ИЛИ Код = "83210000000"
			ИЛИ Код = "92317035100"
			ИЛИ Код = "92317037100"
			ИЛИ Код = "92317038900"
			ИЛИ Код = "92317039100"
			ИЛИ Код = "92317039110"
			ИЛИ Код = "92317039120"
			ИЛИ Код = "92317039130"
			Тогда Возврат "Прочие материалы";											
								
		Иначе								
			Возврат "Сырье и материалы";
		КонецЕсли	
	Иначе
		Возврат "Готовая продукция, товары, полуфабрикаты";
	КонецЕсли;

КонецФункции

Функция ОбъектНоменклатуры(КЭШ, RS, Орск, ТекОб = Неопределено) Экспорт

	ИД = Поле(RS, "DESIGNATIO");
	Если СтрДлина(ИД) > 19 Тогда
		ИД = Лев(ИД, 19);		
	КонецЕсли;
	
	ИмяПодПапки  =  Поле(RS, "GROUP_NAME");
	Родитель = НайтиСоздатьПапкуНоменклатуры(КЭШ, ИмяПодПапки);
		
	Если Орск Тогда
		
		струПоля = Новый Структура("NAME,MATERIAL,GOST_M,TYPSIZE,GOST_S,STP", 
		Поле(RS, "NAME"), Поле(RS, "MATERIAL"), Поле(RS, "GOST_M"),
		Поле(RS, "TYPSIZE"), Поле(RS, "GOST_S"), Поле(RS, "STP"));
		НаименованиеП =	ПолучитьПолноеНаименование(струПоля);
		
	Иначе
		
		НаименованиеП = Поле(RS, "FULL_NAME_1C");
		
		Если ПустаяСтрока(НаименованиеП) Тогда
		
			струПоля = Новый Структура("NAME,MATERIAL,GOST_M,TYPSIZE,GOST_S,STP", 
				Поле(RS, "NAME"), Поле(RS, "MATERIAL"), Поле(RS, "GOST_M"),
			Поле(RS, "TYPSIZE"), Поле(RS, "GOST_S"), Поле(RS, "STP"));
			НаименованиеП =	ПолучитьПолноеНаименование(струПоля);
		
		КонецЕсли;
		стрВидНом 		= Поле(RS, "VID_NOMENKL");
	КонецЕсли;
	
	Попытка
		кодЕИ 			= Число(RS.Fields("P750").Value);
	Исключение
		кодЕИ = 0;
	КонецПопытки;
	
	стрЕИ_вес  		= Поле(RS, "P750M");
	Попытка
		Вес 			= Число(RS.Fields("H580").Value);
	Исключение
		Вес = 0;	
	КонецПопытки;
	
	стрЕИ_вес = ИсправитьЕИ(стрЕИ_вес);

	стрВидНом = стрВидНоменклатурыПоКоду(ИД);
	ВидНоменклатуры = НайтиСоздатьВидНоменклатуры(КЭШ, стрВидНом);
	
	ЕИ = КЭШ.ствЕИ_РС[кодЕИ];
	ЕИ_вес = НайтиСоздатьЕИ(КЭШ, стрЕИ_вес);
	
	Если ТекОб <> Неопределено Тогда
		об = ТекОб;	
	Иначе
		об = Справочники.Номенклатура.СоздатьЭлемент();
		об.юум_КодИнтермех = ИД;
		об.Код = ИД;
	КонецЕсли;
	
	об.ЕдиницаИзмерения = ЕИ;
	об.ВесЕдиницаИзмерения = ЕИ_вес;
	
	об.НаименованиеПолное = НаименованиеП;
	об.Наименование = об.НаименованиеПолное;
	
	об.ЕдиницаИзмерения = ЕИ;
	об.ВесЕдиницаИзмерения = ЕИ_вес;
	об.ВесЧислитель = Вес;
	об.ВесЗнаменатель = 1;
	об.ВесИспользовать = Истина;
	об.ВесМожноУказыватьВДокументах = Истина;
	
	об.ВидНоменклатуры = ВидНоменклатуры; 
	об.ТипНоменклатуры = ВидНоменклатуры.ТипНоменклатуры;
	Если об.ВидНоменклатуры = НайтиСоздатьВидНоменклатуры(КЭШ, "Готовая продукция, товары, полуфабрикаты") Тогда
		об.СхемаОбеспечения = КЭШ.схемаПроизводство;
	Иначе	
		об.СхемаОбеспечения = КЭШ.схемаОсновная;		
	КонецЕсли;
	об.Качество = Перечисления.ГрадацииКачества.Новый;
	
	об.СтавкаНДС = КЭШ.СтавкаНДС;
	об.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
	об.ИспользоватьУпаковки = Истина;
	об.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры;
	
	об.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	об.ОбособленнаяЗакупкаПродажа = Истина;
	об.Родитель = Родитель;
	
	об.ГруппаФинансовогоУчета = ГФУН(КЭШ, ВидНоменклатуры);
	об.ЦеноваяГруппа = ЦеноваяГруппа(КЭШ, ВидНоменклатуры);
	
	об.ДополнительныеСвойства.Вставить("РабочееНаименованиеПроверено", Истина);
	//об.Записать();
	Возврат об;

КонецФункции

Функция НайтиСоздатьПапкуНоменклатуры(КЭШ, наим)

	Если ПустаяСтрока(наим) Тогда
		Возврат КЭШ.КореньНом;	
	КонецЕсли;
	
	Папка = КЭШ.ПапкиНом[наим];
	Если Папка <> Неопределено Тогда
		Возврат Папка;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель В ИЕРАРХИИ(&КореньНом)
	|	И Номенклатура.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("КореньНом", КЭШ.КореньНом);
	Запрос.УстановитьПараметр("Наименование", наим);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		КЭШ.ПапкиНом[наим] = Выборка.Ссылка;
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	об = Справочники.Номенклатура.СоздатьГруппу();
	об.Родитель = КЭШ.КореньНом; 
	об.Код = наим;
	об.Наименование = наим;
	об.ОбменДанными.Загрузка = Истина;
	об.Записать();	
	
	КЭШ.ПапкиНом[наим] = об.Ссылка;
	Возврат об.Ссылка;
	
КонецФункции

Функция ПолучитьПолноеНаименование(Структура)
	
	Стр = ""
	+?(ЗначениеЗаполнено(Структура.NAME),		Структура.NAME+		"; ","")
	+?(ЗначениеЗаполнено(Структура.MATERIAL),	Структура.MATERIAL+	"; ","")
	+?(ЗначениеЗаполнено(Структура.GOST_M),		Структура.GOST_M+	"; ","")
	+?(ЗначениеЗаполнено(Структура.TYPSIZE),	Структура.TYPSIZE+	"; ","")
	+?(ЗначениеЗаполнено(Структура.GOST_S),		Структура.GOST_S+	"; ","")
	+?(ЗначениеЗаполнено(Структура.STP),		Структура.STP+		"; ","");
	
	Если СтрДлина(Стр) > 0 Тогда
		Стр = Лев(Стр, СтрДлина(Стр)-2); // убираем конечные "; "
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

Функция ИсправитьЕИ(стр)

	Если стр = "1000шт" Тогда
		Возврат "тыс. шт";
	ИначеЕсли стр = "тыс" Тогда
		Возврат "тыс. шт";	
	ИначеЕсли стр = "пм" Тогда
		Возврат "пог. м";
	ИначеЕсли стр = "ком" Тогда
		Возврат "компл";
	КонецЕсли;
	
	Возврат стр;
	
КонецФункции

Функция НайтиСоздатьВидНоменклатуры(КЭШ, стрВид)

	Если ПустаяСтрока(стрВид) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ВидНом = КЭШ.ствВидНом[НРег(стрВид)];
	//Если ВидНом = Неопределено Тогда
	//	об = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
	//	об.Наименование = стрВид;
	//	об.ОбменДанными.Загрузка = Истина;
	//	об.Записать();
	//	ВидНом = об.Ссылка;
	//	ствВидыНоменклатуры[НРег(стрВид)] = ВидНом;
	//КонецЕсли;	
	
	Возврат ВидНом;
	
КонецФункции

Функция НайтиСоздатьЕИ(КЭШ, стрЕИ)

	Если ПустаяСтрока(стрЕИ) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ЕИ = КЭШ.ствЕИ[НРег(стрЕИ)];
	//Если ЕИ = Неопределено Тогда
	//	обЕИ = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
	//	обЕИ.Наименование = стрЕИ;
	//	обЕИ.НаименованиеПолное = стрЕИ;
	//	обЕИ.Код = стрЕИ;		
	//	//обЕИ.ОбменДанными.Загрузка = Истина;
	//	обЕИ.Записать();
	//	ЕИ = обЕИ.Ссылка;
	//	ствЕИ[НРег(стрЕИ)] = ЕИ;
	//КонецЕсли;	
	
	Возврат ЕИ;
	
КонецФункции

Функция ГФУН(КЭШ, ВидНоменклатуры)

	рез = КЭШ.ствГФУН[ВидНоменклатуры];
	Если ЗначениеЗаполнено(рез) Тогда
		Возврат рез;	
	КонецЕсли;

	рез = КЭШ.ствГФУН["ВСЕ"];
	Возврат рез;
	
КонецФункции 

Функция ЦеноваяГруппа(КЭШ, ВидНоменклатуры)

	рез = КЭШ.ствЦГ[ВидНоменклатуры];
	Если ЗначениеЗаполнено(рез) Тогда
		Возврат рез;	
	КонецЕсли;

	рез = КЭШ.ствЦГ["ВСЕ"];
	Возврат рез;
	
КонецФункции

Процедура ЗаполнитьКЭШНоменклатуры(КЭШ) Экспорт

    КЭШ.Вставить("схемаОсновная", Справочники.СхемыОбеспечения.НайтиПоНаименованию("Основная"));
	КЭШ.Вставить("схемаПроизводство", Справочники.СхемыОбеспечения.НайтиПоНаименованию("Производство"));

	КЭШ.Вставить("ствВидНом", ПолучитьВидыНоменклатуры());
	КЭШ.Вставить("ствЕИ", ПолучитьЕИ());
	КЭШ.Вставить("ствЕИ_РС", ПолучитьЕИ_РС());
	КЭШ.Вставить("СтавкаНДС", СтавкаНДС());
	
	суид = "735decb5-6d73-11ec-9721-00155d6a0f13";
	КореньНом = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(суид));
	
	Если КореньНом.ПолучитьОбъект() = Неопределено  Тогда
		об = Справочники.Номенклатура.СоздатьГруппу();
		об.УстановитьСсылкуНового(КореньНом);
		об.Код = "Intermech";
		об.Наименование = "Загружено из Intermech";
		об.ОбменДанными.Загрузка = Истина;
		об.Записать();
	КонецЕсли;

	КЭШ.Вставить("КореньНом", КореньНом);
	КЭШ.Вставить("ПапкиНом", Новый Соответствие);
	
	ПолучитьГФУН_ЦГ(КЭШ);
	
КонецПроцедуры

Функция ПолучитьЕИ()

	ств = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Наименование КАК Наименование,
	|	Т.Код КАК Код,
	|	Т.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК Т
	|ГДЕ
	|	Т.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ПометкаУдаления УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ств[НРег(Выборка.Наименование)] = Выборка.Ссылка; 
	КонецЦикла;

	Возврат ств;
	
КонецФункции

Функция ПолучитьЕИ_РС()

	ств = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Код КАК Код,
	|	Т.ЕдиницаИзмерения КАК Ссылка
	|ИЗ
	|	РегистрСведений.юум_СоответствиеЕдиницИзмеренияВнешнейСистемы КАК Т";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ств[Выборка.Код] = Выборка.Ссылка; 
	КонецЦикла;

	Возврат ств;
	
КонецФункции

Функция ПолучитьВидыНоменклатуры()

	ств = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Наименование КАК ИД,
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыНоменклатуры.ПометкаУдаления УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ств[НРег(Выборка.ИД)] = Выборка.Ссылка; 
	КонецЦикла;

	Возврат ств;
	
КонецФункции 

Процедура ПолучитьГФУН_ЦГ(КЭШ)

	ств = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.ВидНоменклатуры КАК ВидНоменклатуры,
	|	т.ГруппаФинансовогоУчетаНоменклатуры КАК ГФУН
	|ИЗ
	|	РегистрСведений.юум_СоотвествиеВидаНоменклатурыГФУН КАК т";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ГФУН) Тогда
			Продолжить;	
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Выборка.ВидНоменклатуры) Тогда
			вн = "ВСЕ";
		Иначе
			вн = Выборка.ВидНоменклатуры;
		КонецЕсли;
		ств[вн] = Выборка.ГФУН;
	КонецЦикла;
	КЭШ.Вставить("ствГФУН", ств);
	
	ств = Новый Соответствие;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.ВидНоменклатуры КАК ВидНоменклатуры,
	|	т.ЦеноваяГруппа КАК ЦГ
	|ИЗ
	|	РегистрСведений.юум_СоотвествиеВидаНоменклатурыЦеновойГруппе КАК т";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ЦГ) Тогда
			Продолжить;	
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Выборка.ВидНоменклатуры) Тогда
			вн = "ВСЕ";
		Иначе
			вн = Выборка.ВидНоменклатуры;
		КонецЕсли;
		ств[вн] = Выборка.ЦГ;
	КонецЦикла;
	КЭШ.Вставить("ствЦГ", ств);
	
КонецПроцедуры

Функция СтавкаНДС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ставка
	|ИЗ
	|	Справочник.СтавкиНДС КАК т
	|ГДЕ
	|	т.Основная
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.НачалоПериода УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ставка;
	КонецЦикла;

КонецФункции

#Область РегламентныеЗадания

Процедура юум_ЗагрузкаАОН() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.юум_ЗагрузкаАОН);
	УстановитьПривилегированныйРежим(Истина);

	обр = Обработки.ЗагрузкаАОН.Создать();
	обр.ЗагрузитьАкты(Неопределено);
	
КонецПроцедуры

#КонецОбласти