#Область ПрограммныйИнтерфейс

// Добавляет выражение условия в запрос
//
// Параметры:
//  Запрос - Строка, Запрос - Текст запроса или запрос.
//  ВыражениеУсловия - Строка - Выражение условия.
//  ИндексЗапросаВПакете - Число - Индекс запроса в пакете запросов. Если не задано, то последний запрос в пакете.
//	ВПараметрыВиртуальныхТаблиц - Булево - Если Ложь, то условие добавляется в секцию "ГДЕ".
//	МассивИндексовЗапросовОбъединения - Массив Из Число - Если пустой, то подставляет условие во всех запросах объединения,
//		иначе только в указанных. Нумерация начинается с 0. Работает только при добавлении условия в секцию "ГДЕ".
//
// Возвращаемое значение:
//  Строка, Запрос - измененный текст запроса или запрос.
//
Функция ДобавитьУсловиеВЗапрос(Знач Запрос, ВыражениеУсловия, Знач ИндексЗапросаВПакете = Неопределено,
				ВПараметрыВиртуальныхТаблиц = Ложь, МассивИндексовЗапросовОбъединения = Неопределено) Экспорт
				
	Если ВПараметрыВиртуальныхТаблиц Тогда
		Запрос = СхемыЗапросов.ДобавитьУсловиеВЗапрос(Запрос, ВыражениеУсловия, ИндексЗапросаВПакете);
	Иначе
		
		Если ТипЗнч(Запрос) = Тип("Строка") Тогда
			ТекстЗапроса = Запрос;
		Иначе
			ТекстЗапроса = Запрос.Текст;
		КонецЕсли;
		
		СхемаЗапроса = Новый СхемаЗапроса;
		
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ИзменяемыйЗапрос = СхемыЗапросов.ЗапросПакетаЗапросов(СхемаЗапроса, ИндексЗапросаВПакете);
		
		ИндексЗапросаОбъединения = 0;
		Для Каждого ОператорВыбрать Из ИзменяемыйЗапрос.Операторы Цикл
			
			Если МассивИндексовЗапросовОбъединения <> Неопределено
				И МассивИндексовЗапросовОбъединения.Найти(ИндексЗапросаОбъединения) = Неопределено Тогда
					
				ИндексЗапросаОбъединения = ИндексЗапросаОбъединения + 1;
				Продолжить;
				
			КонецЕсли;
			
			ОператорВыбрать.Отбор.Добавить(ВыражениеУсловия);
			
			ИндексЗапросаОбъединения = ИндексЗапросаОбъединения + 1;
		КонецЦикла;
		
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
		Если ТипЗнч(Запрос) = Тип("Строка") Тогда
			Запрос = ТекстЗапроса;
		Иначе
			Запрос.Текст = ТекстЗапроса;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

// Находит значение списка запросов по представлению
//  Параметры:
//  ТекстыЗапроса - СписокЗначений из Строка - список запросов
//  ИмяРегистра - Строка - имя запроса в списке 
//  ДобавлятьЕслиНеНайден - Булево - опционально добавлять в список найденный элемент 
//
// Возвращаемое значение:
//  ЭлементСпискаЗначений - найденное значение списка, Неопределено если не найдено
//
Функция НайтиЭлементСписка(ТекстыЗапроса, ИмяРегистра, ДобавлятьЕслиНеНайден = Истина) Экспорт
	
	НайденныйЭлементСписка = Неопределено;
	Для Каждого ЭлементаСписка Из ТекстыЗапроса Цикл
		
		Если ЭлементаСписка.Представление = ИмяРегистра Тогда
			НайденныйЭлементСписка = ЭлементаСписка;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДобавлятьЕслиНеНайден И НайденныйЭлементСписка = Неопределено Тогда
		НайденныйЭлементСписка = ТекстыЗапроса.Добавить("", ИмяРегистра) ;
	КонецЕсли;
	
	Возврат НайденныйЭлементСписка;
	
КонецФункции

// Находит текст запроса по фрагменту в массиве строк
// и возвращает индекс найденного текста запроса
// 
//  Параметры:
//  ТекстыЗапроса - Массив из Строка - массив текстов запросов
//  Фрагмент - Строка - искомая часть текста запроса
//
// Возвращаемое значение:
//  Число - индекс найденного текста запроса, -1 если не найден
Функция ИндексТекстаЗапросаПоФрагменту(ТекстыЗапроса, Фрагмент) Экспорт
	
	Для Индекс = 0 По ТекстыЗапроса.ВГраница() Цикл
		
		Если СтрНайти(ТекстыЗапроса[Индекс], Фрагмент) > 0 Тогда
			Возврат Индекс;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат -1;
	
КонецФункции

// Заменяет поле запроса по псевдониму
//
// Параметры:
//  ТекстЗапроса - Строка - редактируемый запроса или запрос.
//  ПсевдонимПоля - Строка - псевдоним поля для замены 
//  ШаблонЗамены - Строка - если заполнено, исходное значения поля должно содержать переданный шаблон
//	НовыйТекст - Строка - текст нового значения поля
//	ТаблицаДляПомещения - Строка - если заполнено, выполняется проверка соотвествия ТаблицаДляПомещения пакета и переданного значения
//
Процедура ЗаменитьПолеЗапроса(ТекстЗапроса, ПсевдонимПоля, ШаблонЗамены, НовыйТекст, ТаблицаДляПомещения = "") Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТаблицаДляПомещения = "" ИЛИ Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения Тогда
			Для Каждого Оператор Из Пакет.Операторы Цикл
				УстановитьПолеЗапроса(Пакет, Оператор, ПсевдонимПоля, НовыйТекст, ШаблонЗамены);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецПроцедуры

// Заменяет поле запроса по псевдониму
//
// Параметры:
//  ТекстЗапроса - Строка - редактируемый запроса или запрос.
//  ШаблонЗамены - Строка - исходный отбор должен содержать переданный шаблон
//	НовыйОтбор - Строка - текст нового значения поля
//	ТаблицаДляПомещения - Строка - если заполнено, выполняется проверка соотвествия ТаблицаДляПомещения пакета и переданного значения
//
Процедура ЗаменитьОтборЗапроса(ТекстЗапроса, ШаблонЗамены, НовыйОтбор, ТаблицаДляПомещения = "") Экспорт
	
	НоваяСхемаЗапроса = Новый СхемаЗапроса();
	НоваяСхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	Для Каждого Пакет Из НоваяСхемаЗапроса.ПакетЗапросов Цикл
		Если ТаблицаДляПомещения = "" ИЛИ Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения Тогда
			Для Каждого Оператор Из Пакет.Операторы Цикл
				УстановитьОтборЗапроса(Пакет, Оператор, НовыйОтбор, ШаблонЗамены);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	ТекстЗапроса = НоваяСхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецПроцедуры

// Устанавливает поле запроса новым выражением 
//
// Параметры:
//  ЗапросВыбора - ЗапросВыбораСхемыЗапроса - запрос выбора схемы запроса
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//  ПсевдонимПоля - Строка - псевдоним поля для замены 
//	НовыйТекст - Строка - текст нового значения поля
//  ШаблонЗамены - Строка - если заполнено, исходное значения поля должно содержать переданный шаблон
//
Процедура УстановитьПолеЗапроса(ЗапросВыбора, Оператор, ПсевдонимПоля, НовыйТекст, ШаблонЗамены = "") Экспорт
	
	Колонки = ЗапросВыбора.Колонки;
	Колонка = Колонки.Найти(ПсевдонимПоля);
	Индекс  = Колонки.Индекс(Колонка);
	
	Если ШаблонЗамены = "" ИЛИ СтрЧислоВхождений(Оператор.ВыбираемыеПоля[Индекс], ШаблонЗамены) > 0 Тогда
		Оператор.ВыбираемыеПоля.Установить(Индекс, Новый ВыражениеСхемыЗапроса(НовыйТекст));
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает поле отбора новым выражением 
//
// Параметры:
//  ЗапросВыбора - ЗапросВыбораСхемыЗапроса - запрос выбора схемы запроса
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//	НовыйОтбор - Строка - текст нового значения поля
//  ШаблонЗамены - Строка - если заполнено, исходное значения поля должно содержать переданный шаблон
//
Процедура УстановитьОтборЗапроса(ЗапросВыбора, Оператор, НовыйОтбор, ШаблонЗамены = "") Экспорт
	
	Для Индекс = 0 По Оператор.Отбор.Количество() - 1 Цикл
		Если СтрЧислоВхождений(Оператор.Отбор[Индекс], ШаблонЗамены) > 0 Тогда
			Оператор.Отбор[Индекс] = Новый ВыражениеСхемыЗапроса(НовыйОтбор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет новое поле в таблицу
//
// Параметры:
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//  ПсевдонимТаблицы - Строка - псевдоним источника
//	Поля - Массив из Строка, Строка - имена доступных полей
//
Процедура ДобавитьДоступноеПолеВТаблицу(Оператор, ПсевдонимТаблицы, Поля) Экспорт
	
	Если ТипЗнч(Поля) = Тип("Массив") Тогда
		МассивПолей = Поля;
	Иначе
		МассивПолей = Новый Массив;
		МассивПолей.Добавить(Поля);
	КонецЕсли;
	
	Для Каждого Источник Из Оператор.Источники Цикл
		Если Источник.Источник.Псевдоним = ПсевдонимТаблицы Тогда
			Для Каждого ИмяПоля Из МассивПолей Цикл
				Источник.Источник.ДоступныеПоля.Добавить(ИмяПоля);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет новое поле в запрос
//
// Параметры:
//  ЗапросВыбора - ЗапросВыбораСхемыЗапроса - запрос выбора схемы запроса
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//  ПсевдонимПоля - Строка - псевдоним нового поля
//	НовыйТекст - Строка - текст нового значения поля
//
Процедура ДобавитьПолеВЗапрос(ЗапросВыбора, Оператор, ПсевдонимПоля, НовыйТекст) Экспорт
	
	КолонкиЗапросВыбора = ЗапросВыбора.Колонки;
	
	Оператор.ВыбираемыеПоля.Добавить(НовыйТекст);
	КолонкиЗапросВыбора[КолонкиЗапросВыбора.Количество() - 1].Псевдоним = ПсевдонимПоля;
	
КонецПроцедуры

// Добавляет новое поле в запрос
//
// Параметры:
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//  Таблица1 - Строка - имя таблицы 1
//  Таблица2 - Строка - имя таблицы 2
//	Условие - Строка - условие соединения
//
Процедура ДобавитьУсловиеСоединения(Оператор, Таблица1, Таблица2, Условие) Экспорт
	
	Источник = Оператор.Источники.НайтиПоПсевдониму(Таблица1);
	
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Соединения = Источник.Соединения;
	Соединение = Соединения.НайтиПоПсевдониму(Таблица2);
	
	Если Соединение = Неопределено Или Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее Тогда
		Соединения.Добавить(Таблица2, Условие);
	Иначе
		
		// Ищем последнее соединение с конца, и к нему добавляем условие
		// т.к. тип существующего соединения отличается от левого
		
		Для Индекс = 1 - Соединения.Количество() По 0 Цикл
			
			Соединение = Соединения[-Индекс];
			
			Если Соединение.Источник.Источник.Псевдоним = Таблица2 Тогда
				Соединение.Условие = Новый ВыражениеСхемыЗапроса(СтрШаблон("(%1) И (%2)", Соединение.Условие, Условие));
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Копирует оператор запроса по переданному номеру
//
// Параметры:
//  СхемаЗапроса - СхемаЗапроса - объект схемы запроса с установленным текстом запроса 
//  НомерОператора - Число - номер оператора для копирования
//
Процедура СкопироватьОператорЗапроса(СхемаЗапроса, НомерОператора = 0) Экспорт
	
	Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		Индекс = 0;
		Для Каждого Оператор Из Пакет.Операторы Цикл
			Если Индекс = НомерОператора Тогда
				Пакет.Операторы.Добавить(Оператор);
				Прервать;
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает новую структуру для Массива замены полей
// 
// Параметры:
//  ПсевдонимПоля - Строка - псевдоним поля для замены 
//  ШаблонЗамены - Строка - если заполнено, исходное значения поля должно содержать переданный шаблон
//	НовыйТекст - Строка - текст нового значения поля
// 
// Возвращаемое значение:
//  Структура - см. ЗаменитьПоляЗапроса:
//     * ПсевдонимПоля - Строка - псевдоним поля для замены.
//     * ШаблонЗамены - Строка - если заполнено, исходное значения поля должно содержать переданный шаблон.
//     * НовыйТекст - Строка - текст нового значения поля.
//
Функция СтруктураЗаменыПолей(ПсевдонимПоля, ШаблонЗамены, НовыйТекст) Экспорт
	
	СтруктураЗаменыПолей = Новый Структура("ПсевдонимПоля, ШаблонЗамены, НовыйТекст", ПсевдонимПоля, ШаблонЗамены, НовыйТекст);
	Возврат СтруктураЗаменыПолей;
	
КонецФункции

// Заменяет поля запроса по массиву структур
//
// Параметры:
//  СхемаЗапроса - СхемаЗапроса - объект схемы запроса с установленным текстом запроса 
//  МассивПолей - Массив из Структура - Содержит структуру "ПсевдонимПоля, ШаблонЗамены, НовыйТекст". Поля описаны в процедуре УстановитьПолеЗапроса 
//	ТаблицаДляПомещения - Строка - если заполнено, выполняется проверка соотвествия ТаблицаДляПомещения пакета и переданного значения
//	НомерОператора - Число - номер оператора
//	ДобавлятьВДоступныеПоляИсточника - Булево - добавлять в достыпные поля источника
//
Процедура ЗаменитьПоляЗапроса(
	СхемаЗапроса, МассивПолей, ТаблицаДляПомещения = "", НомерОператора = Неопределено, ДобавлятьВДоступныеПоляИсточника = Ложь) Экспорт
	
	Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТаблицаДляПомещения = "" ИЛИ Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения Тогда
			Индекс = 0;
			Для Каждого Оператор Из Пакет.Операторы Цикл
				Если НомерОператора = Неопределено ИЛИ Индекс = НомерОператора Тогда
					УстановитьПоляЗапроса(Пакет, Оператор, МассивПолей);
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Добавляет поля в операторы схемы запроса
//
// Параметры:
//  СхемаЗапроса - СхемаЗапроса - объект схемы запроса с установленным текстом запроса 
//  ПсевдонимТаблицы - Строка - псевдоним таблицы в которую добавляется поле  
//  СписокПолей - СписокЗначений из Структура - список в котором Значение - текст поля выборки, Представление - представление нового поля
//	ТаблицаДляПомещения - Строка - если заполнено, выполняется проверка соотвествия ТаблицаДляПомещения пакета и переданного значения
//  НомерОператора - Число - номер оператора в который добавляются условия. если не передан - добавляет во все операторы
//
Процедура ДобавитьПоляЗапроса(
	СхемаЗапроса, ПсевдонимТаблицы, СписокПолей, ТаблицаДляПомещения = Неопределено, НомерОператора = Неопределено) Экспорт

	Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТаблицаДляПомещения <> Неопределено И Пакет.ТаблицаДляПомещения <> ТаблицаДляПомещения Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Оператор Из Пакет.Операторы Цикл
			ДобавитьПоляЗапросаОбработатьОператор(ПсевдонимТаблицы, СписокПолей, Пакет, Оператор, НомерОператора);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет новые условия "И" в указанные операторы схемы запроса
//
// Параметры:
//  СхемаЗапроса - СхемаЗапроса - объект схемы запроса с установленным текстом запроса 
//  МассивУсловий - Массив из Строка - массив новых текстов условий
//	ТаблицаДляПомещения - Строка - если заполнено, выполняется проверка соотвествия ТаблицаДляПомещения пакета и переданного значения
//  НомерОператора - Число - номер оператора в который добавляются условия. если не передан - добавляет во все операторы
//
Процедура ДобавитьУсловияВЗапрос(СхемаЗапроса, МассивУсловий, ТаблицаДляПомещения = "", НомерОператора = Неопределено) Экспорт
	
	Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТаблицаДляПомещения = "" ИЛИ Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения Тогда
			Индекс = 0;
			Для Каждого Оператор Из Пакет.Операторы Цикл
				Если Индекс = НомерОператора Тогда
					ДобавитьУсловияВОператор(Оператор, МассивУсловий);
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает поле запроса новым выражением 
//
// Параметры:
//  Пакет - ЗапросВыбораСхемыЗапроса - запрос выбора схемы запроса
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//  МассивПолей - Массив из Структура - массив со структурой полей
//
Процедура УстановитьПоляЗапроса(Пакет, Оператор, МассивПолей) Экспорт
	
	Для Каждого СтруктураЗамены Из МассивПолей Цикл
		УстановитьПолеЗапроса(Пакет, Оператор, СтруктураЗамены.ПсевдонимПоля, СтруктураЗамены.НовыйТекст, СтруктураЗамены.ШаблонЗамены);
	КонецЦикла;
	
КонецПроцедуры

// Добавляет новый отбор
//
// Параметры:
//  Оператор - ОператорВыбратьСхемыЗапроса - оператор схемы запроса
//	МассивУсловий - Массив из Строка - массив из условий
//
Процедура ДобавитьУсловияВОператор(Оператор, МассивУсловий) Экспорт
	
    Для Каждого Условие Из МассивУсловий Цикл
		Оператор.Отбор.Добавить(Условие);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоляЗапросаОбработатьОператор(ПсевдонимТаблицы, СписокПолей, Пакет, Оператор, НомерОператора)

	Индекс = 0;
	Если Индекс = НомерОператора ИЛИ НомерОператора = Неопределено Тогда
		Для Каждого НовоеПоле Из СписокПолей Цикл
			ДобавитьДоступноеПолеВТаблицу(Оператор, ПсевдонимТаблицы, НовоеПоле.Значение);
			ДобавитьПолеВЗапрос(Пакет, Оператор,
				?(ПустаяСтрока(НовоеПоле.Представление), НовоеПоле.Значение, НовоеПоле.Представление), НовоеПоле.Значение);
		КонецЦикла;
	КонецЕсли;
	Индекс = Индекс + 1;
	
КонецПроцедуры

#КонецОбласти
