#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Не Пользователи.ЭтоПолноправныйПользователь();
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "ЗаказНаПроизводство", ЗаказНаПроизводство, СтруктураБыстрогоОтбора);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Спецификация", Спецификация, СтруктураБыстрогоОтбора);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Номенклатура", Номенклатура, СтруктураБыстрогоОтбора); 
	
	Элементы.ФормаГруппаСлужебныеКоманды.Видимость = Не ТолькоПросмотр;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(Список, "ЗаказНаПроизводство", ЗаказНаПроизводство, СтруктураБыстрогоОтбора, Настройки);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(Список, "Спецификация", Спецификация, СтруктураБыстрогоОтбора, Настройки);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(Список, "Номенклатура", Номенклатура, СтруктураБыстрогоОтбора, Настройки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаказНаПроизводствоОтборПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказНаПроизводство", ЗаказНаПроизводство, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ЗаказНаПроизводство));

КонецПроцедуры

&НаКлиенте
Процедура СпецификацияОтборПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Спецификация", Спецификация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Спецификация));

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОтборПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", Номенклатура, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Номенклатура));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьДвижения(Команда)
	
	СвернутьДвиженияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СвернутьДвиженияНаСервере()
	
	СтруктураЗаказаСлужебный.СверткаРегистров();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьЗаписиПоУстановленномуОтбору(Команда)
	
	Если НЕ (ЗначениеЗаполнено(ЗаказНаПроизводство) Или ЗначениеЗаполнено(Спецификация) Или ЗначениеЗаполнено(Номенклатура)) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не установлен отбор. Продолжение операции недоступно.';
									|en = 'No filter is set. Cannot continue the operation.'"));
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Продолжить выполнение операции?';
									|en = 'Continue the operation?'"), РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗаписиПоУстановленномуОтборуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиПоУстановленномуОтборуНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураЗаказа.КлючНабор КАК КлючНабор
	|ИЗ
	|	РегистрСведений.СтруктураЗаказа КАК СтруктураЗаказа
	|ГДЕ
	|	&ЗаказНаПроизводство В (СтруктураЗаказа.ЗаказНаПроизводство, ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка))
	|	И &Номенклатура В (СтруктураЗаказа.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И &Спецификация В (СтруктураЗаказа.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка))";
	
	СтруктураЗаказаСлужебный.УдалитьПартииИзСтруктурыПоКлючамНаборов(Запрос.Выполнить().Выгрузить());
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
