#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ЗаказНаПроизводствоОтборПриИзменении(Неопределено);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗаказНаПроизводствоОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказНаПроизводство", ЗаказНаПроизводство, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ЗаказНаПроизводство));
КонецПроцедуры
#КонецОбласти
